[
    {
        "cluster_id": "6a545e6c175778f4cf426a0dbb6cfdf6",
        "rep_id": "6a545e6c175778f4cf426a0dbb6cfdf6",
        "member_ids": [
            "6a545e6c175778f4cf426a0dbb6cfdf6"
        ],
        "rep_title": "NASA, European Partners Set to Launch Sentinel-6B Earth Satellite",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-16T00:02:29+00:00",
        "articles": [
            {
                "id": "6a545e6c175778f4cf426a0dbb6cfdf6",
                "title": "NASA, European Partners Set to Launch Sentinel-6B Earth Satellite",
                "source": "NASA",
                "url": "https://www.nasa.gov/missions/jason-cs-sentinel-6/sentinel-6b/nasa-european-partners-set-to-launch-sentinel-6b-earth-satellite/",
                "text": "5 min read Preparations for Next Moonwalk Simulations Underway (and Underwater) Set to launch no earlier than Nov. 16, Sentinel-6B will continue the data record now being collected by its twin satellite Sentinel-6 Michael Freilich, which lifted off from Vandenberg Space Force Base in November 2020 aboard the SpaceX Falcon 9 rocket shown here. SpaceX Set to track sea levels across more than 90% of Earth’s ocean, the mission must first get into orbit. Here’s what to expect. Sentinel-6B, an ocean-tracking satellite jointly developed by NASA and ESA (European Space Agency), is ready to roll out to the launch pad, packed into the payload fairing of a SpaceX Falcon 9 rocket. Launch is targeted at 12:21 a.m. EST, Monday, Nov. 17 (9:21 p.m. PST, Sunday, Nov. 16). Once it lifts off from Vandenberg Space Force Base in California, the satellite will ride out a 57-minute sequence of events ending in spacecraft separation, when the satellite detaches from the rocket. Then Sentinel-6B’s real work begins. Orbiting Earth every 112 minutes at 4.5 miles (7.2 kilometers) per second, the satellite will eventually take over for its twin, Sentinel-6 Michael Freilich, launched five years ago, to continue a multidecade dataset for sea level measurements from space. Those measurements, along with atmospheric data the mission gathers, will help improve public safety and city planning while protecting coastal infrastructure, including power plants and defense interests. NASA will also use the data to refine atmospheric models that support the safe re-entry of Artemis astronauts. Get the Sentinel-6B Press Kit Here’s a closer look at what lies ahead for the satellite in the coming days. Launch timeline Measuring 19.1 feet (5.82 meters) long and 7.74 feet (2.36 meters) high (including the communications antennas), the satellite weighs in at around 2,600 pounds (1,200 kilograms) when loaded with propellant at launch. The satellite will lift off from Space Launch Complex 4 East at Vandenberg. If needed, backup launch opportunities are available on subsequent days, with the 20-second launch window occurring about 12 to 13 minutes earlier each day. A little more than two minutes after the Falcon 9 rocket lifts off, the main engine cuts off. Shortly after, the rocket’s first and second stages separate, followed by second-stage engine start. The reusable Falcon 9 first stage then begins its automated boost-back burn to the launch site for a powered landing. About three minutes after launch, the two halves of the payload fairing, which protected the satellite as it traveled through the atmosphere, separate and fall safely back to Earth. The first cutoff of the second stage engine takes place approximately eight minutes after liftoff, at which point the launch vehicle and the spacecraft will be in a temporary “parking” orbit. The second stage engine fires a second time about 44 minutes later, and about 57 minutes after liftoff, the rocket and the spacecraft separate. Roughly seven minutes after that, the satellite’s solar panels deploy. Sentinel-6B is expected to make first contact with ground controllers about 35 minutes after separation (roughly an hour and a half after liftoff) — a major milestone indicating that the spacecraft is healthy. Science mission Following launch operations, the team will focus on its next challenge: getting the spacecraft ready for science operations. Once in orbit, Sentinel-6B will fly about 30 seconds behind its twin, the Sentinel-6 Michael Freilich satellite. When scientists and engineers have completed cross-calibrating the data collected by the two spacecraft, Sentinel-6B will take over the role of providing primary sea level measurements while Sentinel-6 Michael Freilich will move into a different orbit. From there, researchers plan to use measurements from Sentinel-6 Michael Freilich for different purposes, including helping to map seafloor features (variations in sea surface height can reveal variations in ocean floor features, such as seamounts). Sentinel-6B is part of a U.S.-European mission that will continue 30-year-plus record of sea-level measurements. Its observations will help build an accurate picture of local and global sea surface heights to support storm forecasting, secure coastal infrastructure, and help optimize commercial activities, such as shipping. NASA/JPL-Caltech Where to find launch coverage Launch day coverage of the mission will be available on the agency’s website , including links to live streaming and blog updates beginning no earlier than 11 p.m. EST, Nov. 16, as the countdown milestones occur. Streaming video and photos of the launch will be accessible on demand shortly after liftoff. Follow countdown coverage on NASA’s Sentinel-6B blog . For more information about NASA’s live programming schedule, visit plus.nasa.gov/scheduled-events . More about Sentinel-6B The Copernicus Sentinel-6/Jason-CS (Continuity of Service) mission is a collaboration between NASA, ESA, EUMETSAT (European Organisation for the Exploitation of Meteorological Satellites), and the National Oceanic and Atmospheric Administration (NOAA). The European Commission contributed funding support while France’s space agency CNES (Centre National d’Études Spatiales) provided technical expertise. The mission also marks the first international involvement in Copernicus, the European Union’s Earth Observation Programme. A division of Caltech in Pasadena, JPL built three science instruments for each Sentinel-6 satellite: the Advanced Microwave Radiometer , the Global Navigation Satellite System – Radio Occultation , and the Laser Retroreflector Array . NASA is also contributing launch services, ground systems supporting operation of the NASA science instruments, the science data processors for two of these instruments, and support for the U.S. members of the international Ocean Surface Topography and Sentinel-6 science teams. The launch service is managed by NASA’s Launch Services Program, based at the agency’s Kennedy Space Center in Florida. How Sentinel-6B Will Help Ships at Sea How Sentinel-6B Will Help Improve Hurricane Forecasts How Do We Measure Sea Level? News Media Contacts Elizabeth Vlock NASA Headquarters, Washington 202-358-1600 elizabeth.a.vlock@nasa.gov Andrew Wang / Andrew Good Jet Propulsion Laboratory, Pasadena, Calif. 626-379-6874 / 626-840-4291 andrew.wang@jpl.nasa.gov / andrew.c.good@jpl.nasa.gov 2025-125 Share Details Last Updated Nov 15, 2025 Related Terms Sentinel-6B Earth Earth Science Earth Science Division Jason-CS (Continuity of Service) / Sentinel-6 Explore More 6 min read 6 Things to Know From NASA About New US, European Sea Satellite Article 2 days ago 1 min read Inside the Visualization: Aerosols NASA uses satellites, ground measurements, and powerful computer models to track tiny particles floating in… Article 2 months ago 4 min read NASA Aircraft Coordinate Science Flights to Measure Air Quality Magic is in the air. No wait… MAGEQ is in the air, featuring scientists from… Article 2 months ago Keep Exploring Discover Related Topics Explore Earth Science From its origins, NASA has studied our planet in novel ways, using a fleet of satellites and ambitious airborne and ground-based… Earth Science at Work NASA Earth Science helps Americans respond to challenges and societal needs — such as wildland fires, hurricanes, and water supplies… Earth Science Data Earth Science Missions In order to study the Earth as a whole system and understand how it is changing, NASA develops and supports…",
                "timestamp": "2025-11-16T00:02:29+00:00"
            }
        ],
        "urls": [
            "https://www.nasa.gov/missions/jason-cs-sentinel-6/sentinel-6b/nasa-european-partners-set-to-launch-sentinel-6b-earth-satellite/"
        ],
        "rep_text": "5 min read Preparations for Next Moonwalk Simulations Underway (and Underwater) Set to launch no earlier than Nov. 16, Sentinel-6B will continue the data record now being collected by its twin satellite Sentinel-6 Michael Freilich, which lifted off from Vandenberg Space Force Base in November 2020 aboard the SpaceX Falcon 9 rocket shown here. SpaceX Set to track sea levels across more than 90% of Earth’s ocean, the mission must first get into orbit. Here’s what to expect. Sentinel-6B, an ocean-tracking satellite jointly developed by NASA and ESA (European Space Agency), is ready to roll out to the launch pad, packed into the payload fairing of a SpaceX Falcon 9 rocket. Launch is targeted at 12:21 a.m. EST, Monday, Nov. 17 (9:21 p.m. PST, Sunday, Nov. 16). Once it lifts off from Vandenberg Space Force Base in California, the satellite will ride out a 57-minute sequence of events ending in spacecraft separation, when the satellite detaches from the rocket. Then Sentinel-6B’s real work begins. Orbiting Earth every 112 minutes at 4.5 miles (7.2 kilometers) per second, the satellite will eventually take over for its twin, Sentinel-6 Michael Freilich, launched five years ago, to continue a multidecade dataset for sea level measurements from space. Those measurements, along with atmospheric data the mission gathers, will help improve public safety and city planning while protecting coastal infrastructure, including power plants and defense interests. NASA will also use the data to refine atmospheric models that support the safe re-entry of Artemis astronauts. Get the Sentinel-6B Press Kit Here’s a closer look at what lies ahead for the satellite in the coming days. Launch timeline Measuring 19.1 feet (5.82 meters) long and 7.74 feet (2.36 meters) high (including the communications antennas), the satellite weighs in at around 2,600 pounds (1,200 kilograms) when loaded with propellant at launch. The satellite will lift off from Space Launch Complex 4 East at Vandenberg. If needed, backup launch opportunities are available on subsequent days, with the 20-second launch window occurring about 12 to 13 minutes earlier each day. A little more than two minutes after the Falcon 9 rocket lifts off, the main engine cuts off. Shortly after, the rocket’s first and second stages separate, followed by second-stage engine start. The reusable Falcon 9 first stage then begins its automated boost-back burn to the launch site for a powered landing. About three minutes after launch, the two halves of the payload fairing, which protected the satellite as it traveled through the atmosphere, separate and fall safely back to Earth. The first cutoff of the second stage engine takes place approximately eight minutes after liftoff, at which point the launch vehicle and the spacecraft will be in a temporary “parking” orbit. The second stage engine fires a second time about 44 minutes later, and about 57 minutes after liftoff, the rocket and the spacecraft separate. Roughly seven minutes after that, the satellite’s solar panels deploy. Sentinel-6B is expected to make first contact with ground controllers about 35 minutes after separation (roughly an hour and a half after liftoff) — a major milestone indicating that the spacecraft is healthy. Science mission Following launch operations, the team will focus on its next challenge: getting the spacecraft ready for science operations. Once in orbit, Sentinel-6B will fly about 30 seconds behind its twin, the Sentinel-6 Michael Freilich satellite. When scientists and engineers have completed cross-calibrating the data collected by the two spacecraft, Sentinel-6B will take over the role of providing primary sea level measurements while Sentinel-6 Michael Freilich will move into a different orbit. From there, researchers plan to use measurements from Sentinel-6 Michael Freilich for different purposes, including helping to map seafloor features (variations in sea surface height can reveal variations in ocean floor features, such as seamounts). Sentinel-6B is part of a U.S.-European mission that will continue 30-year-plus record of sea-level measurements. Its observations will help build an accurate picture of local and global sea surface heights to support storm forecasting, secure coastal infrastructure, and help optimize commercial activities, such as shipping. NASA/JPL-Caltech Where to find launch coverage Launch day coverage of the mission will be available on the agency’s website , including links to live streaming and blog updates beginning no earlier than 11 p.m. EST, Nov. 16, as the countdown milestones occur. Streaming video and photos of the launch will be accessible on demand shortly after liftoff. Follow countdown coverage on NASA’s Sentinel-6B blog . For more information about NASA’s live programming schedule, visit plus.nasa.gov/scheduled-events . More about Sentinel-6B The Copernicus Sentinel-6/Jason-CS (Continuity of Service) mission is a collaboration between NASA, ESA, EUMETSAT (European Organisation for the Exploitation of Meteorological Satellites), and the National Oceanic and Atmospheric Administration (NOAA). The European Commission contributed funding support while France’s space agency CNES (Centre National d’Études Spatiales) provided technical expertise. The mission also marks the first international involvement in Copernicus, the European Union’s Earth Observation Programme. A division of Caltech in Pasadena, JPL built three science instruments for each Sentinel-6 satellite: the Advanced Microwave Radiometer , the Global Navigation Satellite System – Radio Occultation , and the Laser Retroreflector Array . NASA is also contributing launch services, ground systems supporting operation of the NASA science instruments, the science data processors for two of these instruments, and support for the U.S. members of the international Ocean Surface Topography and Sentinel-6 science teams. The launch service is managed by NASA’s Launch Services Program, based at the agency’s Kennedy Space Center in Florida. How Sentinel-6B Will Help Ships at Sea How Sentinel-6B Will Help Improve Hurricane Forecasts How Do We Measure Sea Level? News Media Contacts Elizabeth Vlock NASA Headquarters, Washington 202-358-1600 elizabeth.a.vlock@nasa.gov Andrew Wang / Andrew Good Jet Propulsion Laboratory, Pasadena, Calif. 626-379-6874 / 626-840-4291 andrew.wang@jpl.nasa.gov / andrew.c.good@jpl.nasa.gov 2025-125 Share Details Last Updated Nov 15, 2025 Related Terms Sentinel-6B Earth Earth Science Earth Science Division Jason-CS (Continuity of Service) / Sentinel-6 Explore More 6 min read 6 Things to Know From NASA About New US, European Sea Satellite Article 2 days ago 1 min read Inside the Visualization: Aerosols NASA uses satellites, ground measurements, and powerful computer models to track tiny particles floating in… Article 2 months ago 4 min read NASA Aircraft Coordinate Science Flights to Measure Air Quality Magic is in the air. No wait… MAGEQ is in the air, featuring scientists from… Article 2 months ago Keep Exploring Discover Related Topics Explore Earth Science From its origins, NASA has studied our planet in novel ways, using a fleet of satellites and ambitious airborne and ground-based… Earth Science at Work NASA Earth Science helps Americans respond to challenges and societal needs — such as wildland fires, hurricanes, and water supplies… Earth Science Data Earth Science Missions In order to study the Earth as a whole system and understand how it is changing, NASA develops and supports…",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "0c61cc450e4121df9d05552ce32fc847",
        "rep_id": "0c61cc450e4121df9d05552ce32fc847",
        "member_ids": [
            "0c61cc450e4121df9d05552ce32fc847"
        ],
        "rep_title": "6 Things to Know From NASA About New US, European Sea Satellite",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-15T00:13:01+00:00",
        "articles": [
            {
                "id": "0c61cc450e4121df9d05552ce32fc847",
                "title": "6 Things to Know From NASA About New US, European Sea Satellite",
                "source": "NASA",
                "url": "https://www.nasa.gov/missions/jason-cs-sentinel-6/sentinel-6b/6-things-to-know-from-nasa-about-new-us-european-sea-satellite/",
                "text": "6 min read Preparations for Next Moonwalk Simulations Underway (and Underwater) Set to launch no earlier than Nov. 16, Sentinel-6B will continue a decades-long data record of sea level measurement that will help decision-makers manage coastal flooding, support hurricane intensity forecasts, and assist in the return of astronauts from space. NASA Data from Sentinel-6B will continue a decades-long record of sea surface height, helping to improve coastal planning, protect critical infrastructure, and advance weather forecasts. With launch set for no earlier than 12:21 a.m. EST Monday, Nov. 17, Sentinel-6B is the latest satellite in a series of spacecraft NASA and its partners have used to measure sea levels since 1992. Their data has helped meteorologists improve hurricane forecasts, managers protect infrastructure, and coastal communities plan. After launch, Sentinel-6B will begin the process of data cross-calibration with its predecessor, Sentinel-6 Michael Freilich , to provide essential information about Earth’s ocean. Sentinel-6B is the second of two satellites that constitute the Sentinel-6/Jason-CS (Continuity of Service) mission, a collaboration between NASA, ESA (European Space Agency), EUMETSAT (European Organisation for the Exploitation of Meteorological Satellites), and the National Oceanic and Atmospheric Administration (NOAA). The European Commission contributed funding support while France’s space agency CNES (Centre National d’Études Spatiales) provided technical expertise. Here are six things to know about Sentinel-6B and the broader Copernicus Sentinel-6/Jason-CS mission: 1. Sentinel-6B will deliver data on about 90% of Earth’s ocean, providing direct benefits to humanity . Sentinel-6B will contribute to a multidecade dataset for sea level measurements from space. This data is key to helping improve public safety, city planning, and protecting commercial and defense interests. Pioneered by NASA and its partners, the dataset enables users in government, industry, and the research community to better understand how sea levels change over time. Combined with information from other NASA satellites, data from Copernicus Sentinel-6/Jason-CS is vital for tracking how heat and energy move through Earth’s seas and atmosphere, as well as for monitoring ocean features such as currents and eddies. The measurements come courtesy of a radar altimeter that measures sea levels for nearly all of Earth’s ocean, providing information on large-scale currents that can aid in commercial and naval navigation, search and rescue, and the tracking of debris and pollutants from disasters at sea. Sentinel-6B is part of a U.S.-European mission that will continue 30-year-plus record of sea-level measurements. Its observations will help build an accurate picture of local and global sea surface heights to support storm forecasting, secure coastal infrastructure, and help optimize commercial activities, such as shipping. Credit: NASA/JPL-Caltech 2. Data from the Copernicus Sentinel-6/Jason-CS mission helps NASA prepare for the next phase of space exploration . The better we understand Earth, the better NASA can carry out its mission to explore the universe. Data from the Copernicus Sentinel-6/Jason-CS mission is used to refine the Goddard Earth Observing System atmospheric forecast models, which the NASA Engineering Safety Center uses to plan safer reentry of astronauts returning from Artemis missions. Additionally, changes to Earth’s ocean, observed by satellites, can have measurable effects beyond our planet. For instance, while the Moon influences ocean tides on Earth, changes in those tides can also exert a small influence on the Moon. Data from Copernicus Sentinel-6/Jason-CS can help improve understanding of this relationship, knowledge that can contribute to future lunar exploration missions. 3. The Copernicus Sentinel-6/Jason-CS mission helps the U.S. respond to challenges by putting actionable information into the hands of decision-makers . Data collected by the mission helps city planners, as well as local and state governments, to make informed decisions on protecting coastal infrastructure, real estate, and energy facilities. The mission’s sea level data also improves meteorologists’ weather predictions, which are critical to commercial and recreational navigation. By enhancing weather prediction models, data provided by Copernicus Sentinel-6/Jason-CS improves forecasts of hurricane development, including the likelihood of storm intensification, which can aid disaster preparedness and response. Get the Sentinel-6B Press Kit 4. Data from Sentinel-6B will support national security efforts . The ocean and atmosphere measurements from Sentinel-6B will enable decision-makers to better protect coastal military installations from such events as nuisance flooding while aiding national defense efforts by providing crucial information about weather and ocean conditions. The satellite will do so by feeding near-real time data on Earth’s atmosphere and seas to forward-looking weather and ocean models. Since the measurements are part of a long-term dataset, they also can add historical context that puts the new data in perspective. 5. The Copernicus Sentinel-6/Jason-CS mission’s direct observation of sea levels delivers information critical to protecting coastlines, where nearly half of the world’s population lives . Sea level rise varies from one area to another, meaning that some coastlines are more vulnerable than others to flooding, erosion, and saltwater contamination of underground freshwater supplies, the latter of which threatens farmland and drinking water. Sea level measurements from Sentinel-6 Michael Freilich, and soon, Sentinel-6B, form the basis of U.S. flood predictions for coastal infrastructure, real estate, energy storage sites, and other coastal assets. Knowing which regions are more vulnerable to these risks will enable U.S. industries and emergency managers to make better-informed decisions about transportation and commercial infrastructure, land-use planning, water management, and adaptation strategies. 6. The international collaboration behind the mission enables the pooling of capabilities, resources, and expertise . The multidecadal dataset that this mission supports is the result of years of close work between NASA and several collaborators, including NASA, ESA, EUMETSAT, CNES, and NOAA. By pooling expertise and resources, this partnership has delivered cost-effective solutions that have made precise, high-impact data available to industry and government agencies alike. More about Sentinel-6B Copernicus Sentinel-6/Jason-CS was jointly developed by ESA, EUMETSAT, NASA, and NOAA, with funding support from the European Commission and technical support from CNES. The mission also marks the first international involvement in Copernicus, the European Union’s Earth Observation Programme. Managed for NASA by Caltech in Pasadena, JPL contributed three science instruments for each Sentinel-6 satellite: the Advanced Microwave Radiometer , the Global Navigation Satellite System – Radio Occultation , and the laser retroreflector array . NASA is also contributing launch services, ground systems supporting operation of the NASA science instruments, the science data processors for two of these instruments, and support for the international ocean surface topography community. For more about Sentinel-6B, visit: https://science.nasa.gov/mission/sentinel-6B How Sentinel-6B Will Help Ships at Sea How Sentinel-6B Will Help Improve Hurricane Forecasts How Do We Measure Sea Level? News Media Contacts Elizabeth Vlock NASA Headquarters, Washington 202-358-1600 elizabeth.a.vlock@nasa.gov Andrew Wang / Andrew Good Jet Propulsion Laboratory, Pasadena, Calif. 626-379-6874 / 626-840-4291 andrew.wang@jpl.nasa.gov / andrew.c.good@jpl.nasa.gov 2025-124 Share Details Last Updated Nov 14, 2025 Related Terms Sentinel-6B Earth Earth Science Earth Science Division Jason-CS (Continuity of Service) / Sentinel-6 Explore More 5 min read NASA, European Partners Set to Launch Sentinel-6B Earth Satellite Article 24 hours ago 1 min read Inside the Visualization: Aerosols NASA uses satellites, ground measurements, and powerful computer models to track tiny particles floating in… Article 2 months ago 4 min read NASA Aircraft Coordinate Science Flights to Measure Air Quality Magic is in the air. No wait… MAGEQ is in the air, featuring scientists from… Article 2 months ago Keep Exploring Discover Related Topics About NASA’s Earth Science Division NASA applies ingenuity and expertise gained from decades of planetary and deep-space exploration to the study of our home planet.… Sentinel-6B Sentinel-6B will extend NASA’s sea level measurements gold-standard dataset into its fourth decade, providing an accurate picture of global and… Ocean Surface Topography Mission (OSTM Jason-2) OSTM/Jason-2’s primary payload includes five instruments similar to those aboard Jason-1, along with three experimental instruments. Its main instrument is… Sea Level – Earth Indicator Global sea level rise is caused primarily by two factors: added fresh water from melting ice sheets and glaciers, and…",
                "timestamp": "2025-11-15T00:13:01+00:00"
            }
        ],
        "urls": [
            "https://www.nasa.gov/missions/jason-cs-sentinel-6/sentinel-6b/6-things-to-know-from-nasa-about-new-us-european-sea-satellite/"
        ],
        "rep_text": "6 min read Preparations for Next Moonwalk Simulations Underway (and Underwater) Set to launch no earlier than Nov. 16, Sentinel-6B will continue a decades-long data record of sea level measurement that will help decision-makers manage coastal flooding, support hurricane intensity forecasts, and assist in the return of astronauts from space. NASA Data from Sentinel-6B will continue a decades-long record of sea surface height, helping to improve coastal planning, protect critical infrastructure, and advance weather forecasts. With launch set for no earlier than 12:21 a.m. EST Monday, Nov. 17, Sentinel-6B is the latest satellite in a series of spacecraft NASA and its partners have used to measure sea levels since 1992. Their data has helped meteorologists improve hurricane forecasts, managers protect infrastructure, and coastal communities plan. After launch, Sentinel-6B will begin the process of data cross-calibration with its predecessor, Sentinel-6 Michael Freilich , to provide essential information about Earth’s ocean. Sentinel-6B is the second of two satellites that constitute the Sentinel-6/Jason-CS (Continuity of Service) mission, a collaboration between NASA, ESA (European Space Agency), EUMETSAT (European Organisation for the Exploitation of Meteorological Satellites), and the National Oceanic and Atmospheric Administration (NOAA). The European Commission contributed funding support while France’s space agency CNES (Centre National d’Études Spatiales) provided technical expertise. Here are six things to know about Sentinel-6B and the broader Copernicus Sentinel-6/Jason-CS mission: 1. Sentinel-6B will deliver data on about 90% of Earth’s ocean, providing direct benefits to humanity . Sentinel-6B will contribute to a multidecade dataset for sea level measurements from space. This data is key to helping improve public safety, city planning, and protecting commercial and defense interests. Pioneered by NASA and its partners, the dataset enables users in government, industry, and the research community to better understand how sea levels change over time. Combined with information from other NASA satellites, data from Copernicus Sentinel-6/Jason-CS is vital for tracking how heat and energy move through Earth’s seas and atmosphere, as well as for monitoring ocean features such as currents and eddies. The measurements come courtesy of a radar altimeter that measures sea levels for nearly all of Earth’s ocean, providing information on large-scale currents that can aid in commercial and naval navigation, search and rescue, and the tracking of debris and pollutants from disasters at sea. Sentinel-6B is part of a U.S.-European mission that will continue 30-year-plus record of sea-level measurements. Its observations will help build an accurate picture of local and global sea surface heights to support storm forecasting, secure coastal infrastructure, and help optimize commercial activities, such as shipping. Credit: NASA/JPL-Caltech 2. Data from the Copernicus Sentinel-6/Jason-CS mission helps NASA prepare for the next phase of space exploration . The better we understand Earth, the better NASA can carry out its mission to explore the universe. Data from the Copernicus Sentinel-6/Jason-CS mission is used to refine the Goddard Earth Observing System atmospheric forecast models, which the NASA Engineering Safety Center uses to plan safer reentry of astronauts returning from Artemis missions. Additionally, changes to Earth’s ocean, observed by satellites, can have measurable effects beyond our planet. For instance, while the Moon influences ocean tides on Earth, changes in those tides can also exert a small influence on the Moon. Data from Copernicus Sentinel-6/Jason-CS can help improve understanding of this relationship, knowledge that can contribute to future lunar exploration missions. 3. The Copernicus Sentinel-6/Jason-CS mission helps the U.S. respond to challenges by putting actionable information into the hands of decision-makers . Data collected by the mission helps city planners, as well as local and state governments, to make informed decisions on protecting coastal infrastructure, real estate, and energy facilities. The mission’s sea level data also improves meteorologists’ weather predictions, which are critical to commercial and recreational navigation. By enhancing weather prediction models, data provided by Copernicus Sentinel-6/Jason-CS improves forecasts of hurricane development, including the likelihood of storm intensification, which can aid disaster preparedness and response. Get the Sentinel-6B Press Kit 4. Data from Sentinel-6B will support national security efforts . The ocean and atmosphere measurements from Sentinel-6B will enable decision-makers to better protect coastal military installations from such events as nuisance flooding while aiding national defense efforts by providing crucial information about weather and ocean conditions. The satellite will do so by feeding near-real time data on Earth’s atmosphere and seas to forward-looking weather and ocean models. Since the measurements are part of a long-term dataset, they also can add historical context that puts the new data in perspective. 5. The Copernicus Sentinel-6/Jason-CS mission’s direct observation of sea levels delivers information critical to protecting coastlines, where nearly half of the world’s population lives . Sea level rise varies from one area to another, meaning that some coastlines are more vulnerable than others to flooding, erosion, and saltwater contamination of underground freshwater supplies, the latter of which threatens farmland and drinking water. Sea level measurements from Sentinel-6 Michael Freilich, and soon, Sentinel-6B, form the basis of U.S. flood predictions for coastal infrastructure, real estate, energy storage sites, and other coastal assets. Knowing which regions are more vulnerable to these risks will enable U.S. industries and emergency managers to make better-informed decisions about transportation and commercial infrastructure, land-use planning, water management, and adaptation strategies. 6. The international collaboration behind the mission enables the pooling of capabilities, resources, and expertise . The multidecadal dataset that this mission supports is the result of years of close work between NASA and several collaborators, including NASA, ESA, EUMETSAT, CNES, and NOAA. By pooling expertise and resources, this partnership has delivered cost-effective solutions that have made precise, high-impact data available to industry and government agencies alike. More about Sentinel-6B Copernicus Sentinel-6/Jason-CS was jointly developed by ESA, EUMETSAT, NASA, and NOAA, with funding support from the European Commission and technical support from CNES. The mission also marks the first international involvement in Copernicus, the European Union’s Earth Observation Programme. Managed for NASA by Caltech in Pasadena, JPL contributed three science instruments for each Sentinel-6 satellite: the Advanced Microwave Radiometer , the Global Navigation Satellite System – Radio Occultation , and the laser retroreflector array . NASA is also contributing launch services, ground systems supporting operation of the NASA science instruments, the science data processors for two of these instruments, and support for the international ocean surface topography community. For more about Sentinel-6B, visit: https://science.nasa.gov/mission/sentinel-6B How Sentinel-6B Will Help Ships at Sea How Sentinel-6B Will Help Improve Hurricane Forecasts How Do We Measure Sea Level? News Media Contacts Elizabeth Vlock NASA Headquarters, Washington 202-358-1600 elizabeth.a.vlock@nasa.gov Andrew Wang / Andrew Good Jet Propulsion Laboratory, Pasadena, Calif. 626-379-6874 / 626-840-4291 andrew.wang@jpl.nasa.gov / andrew.c.good@jpl.nasa.gov 2025-124 Share Details Last Updated Nov 14, 2025 Related Terms Sentinel-6B Earth Earth Science Earth Science Division Jason-CS (Continuity of Service) / Sentinel-6 Explore More 5 min read NASA, European Partners Set to Launch Sentinel-6B Earth Satellite Article 24 hours ago 1 min read Inside the Visualization: Aerosols NASA uses satellites, ground measurements, and powerful computer models to track tiny particles floating in… Article 2 months ago 4 min read NASA Aircraft Coordinate Science Flights to Measure Air Quality Magic is in the air. No wait… MAGEQ is in the air, featuring scientists from… Article 2 months ago Keep Exploring Discover Related Topics About NASA’s Earth Science Division NASA applies ingenuity and expertise gained from decades of planetary and deep-space exploration to the study of our home planet.… Sentinel-6B Sentinel-6B will extend NASA’s sea level measurements gold-standard dataset into its fourth decade, providing an accurate picture of global and… Ocean Surface Topography Mission (OSTM Jason-2) OSTM/Jason-2’s primary payload includes five instruments similar to those aboard Jason-1, along with three experimental instruments. Its main instrument is… Sea Level – Earth Indicator Global sea level rise is caused primarily by two factors: added fresh water from melting ice sheets and glaciers, and…",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "fc3c37aa0f2203c19ea0ee6a868596f7",
        "rep_id": "fc3c37aa0f2203c19ea0ee6a868596f7",
        "member_ids": [
            "fc3c37aa0f2203c19ea0ee6a868596f7"
        ],
        "rep_title": "Mapping Dark Matter",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-14T17:44:46+00:00",
        "articles": [
            {
                "id": "fc3c37aa0f2203c19ea0ee6a868596f7",
                "title": "Mapping Dark Matter",
                "source": "NASA",
                "url": "https://www.nasa.gov/image-article/mapping-dark-matter/",
                "text": "NASA, ESA, CSA, STScI, CXC This image released on June 30, 2025, combines data from NASA’s James Webb Space Telescope and NASA’s Chandra X-ray Observatory to visualize dark matter. Researchers used Webb’s observations to carefully measure the mass of the galaxy clusters shown here as well as the collective light emitted by stars that are no longer bound to individual galaxies. Learn more. Image credit: NASA, ESA, CSA, STScI, CXC",
                "timestamp": "2025-11-14T17:44:46+00:00"
            }
        ],
        "urls": [
            "https://www.nasa.gov/image-article/mapping-dark-matter/"
        ],
        "rep_text": "NASA, ESA, CSA, STScI, CXC This image released on June 30, 2025, combines data from NASA’s James Webb Space Telescope and NASA’s Chandra X-ray Observatory to visualize dark matter. Researchers used Webb’s observations to carefully measure the mass of the galaxy clusters shown here as well as the collective light emitted by stars that are no longer bound to individual galaxies. Learn more. Image credit: NASA, ESA, CSA, STScI, CXC",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "b6861e773ca1b4ee023c6c635c7c4e93",
        "rep_id": "b6861e773ca1b4ee023c6c635c7c4e93",
        "member_ids": [
            "b6861e773ca1b4ee023c6c635c7c4e93"
        ],
        "rep_title": "NASA Glenn Teams Win 2025 R&D 100 Awards",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-14T17:39:19+00:00",
        "articles": [
            {
                "id": "b6861e773ca1b4ee023c6c635c7c4e93",
                "title": "NASA Glenn Teams Win 2025 R&D 100 Awards",
                "source": "NASA",
                "url": "https://www.nasa.gov/newsletters/aerospace-frontiers/nasa-glenn-teams-win-2025-rd-100-awards/",
                "text": "Artistic rendering of the High-Rate Delay Tolerant Networking protocol being used on the Laser Communications Relay Demonstration to transfer radio and optical communications between Earth and space. Credit: NASA NASA’s Glenn Research Center in Cleveland has earned 2025 R&D 100 Awards for developing a system that delivers high-speed internet for space and co-inventing technology for a new class of soft magnetic nanocrystalline materials designed to operate at extreme temperatures. This brings NASA Glenn’s total to 130 R&D 100 Awards. High-Rate Delay Tolerant Networking NASA Glenn’s Daniel Raible and Rachel Dudukovich led their team of engineers to create High-Rate Delay Tolerant Networking (HDTN) , a cutting-edge software solution designed to revolutionize data streaming and communication in space. HDTN enables reliable, high-speed transmission of data between space and Earth — even under the extreme conditions of space — minimizing loss and system delay. High-Rate Delay Tolerant Networking team photo, left to right: Tad Kollar, Eric Brace, Brian Tomko, José Lombay-González, Nadia Kortas, Daniel Raible, John Nowakowski, Shaun McKeehan, Ethan Schweinsberg, Prash Choksi, and Rachel Dudukovich. Credit: NASA/Jef Janis “The HDTN software protocol allows faster, automated, and seamless data transfer between spacecraft, even across communication systems operating on different link speeds,” Raible said. “It’s up to 10 times faster than current delay-tolerant networking (DTN).” This advanced technology has far-reaching implications beyond NASA. With its open-source code, HDTN paves the way for collaboration, innovation, and adoption across the rapidly expanding commercial space industry, offering near real-time communication capabilities. Looking ahead, HDTN could form the foundation of a solar system-wide internet, supporting data exchange between Earth, spacecraft, and even future missions involving human travel to the Moon and Mars. VulcanAlloy In a project led by the University of Pittsburgh, researchers at NASA Glenn, including Nick Bruno, Grant Feichter, Vladimir Keylin, Alex Leary, and Ron Noebe, partnered with CorePower Magnetics to develop VulcanAlloy — a breakthrough soft magnetic nanocrystalline material. NASA’s Glenn Research Center in Cleveland tested high-temperature inductors using VulcanAlloy technology in the NASA Glenn Extreme Environments Rig, which simulates the conditions on Venus’ surface, on May 13, 2025. Credit: NASA VulcanAlloy, developed under NASA’s High Operating Temperature Technology Program using processing capability established by the Advanced Air Transport Technology project, operates above 500°C, far beyond the limits of conventional soft magnetic materials. Its nano-engineered structure maintains efficiency at high temperatures and frequencies. With adjustable magnetic properties, it can replace multiple materials in components like inductors, transformers, motors, and sensors while reducing the need for bulky cooling systems — ideal for extreme environments. Raytheon has tested VulcanAlloy cores, highlighting their potential in electrified aircraft, defense, and aerospace systems. This innovation also promises major impact in electric vehicles, data centers, microgrids, and energy systems, where smaller, lighter, and more efficient components are key to advancing next-generation power electronics. The R&D 100 Awards, a worldwide science and innovation competition, received entries from organizations around the world. Now in its 63rd year, this year’s judging panel included industry professionals from across the globe who evaluated breakthrough innovations in technology and science. Return to Newsletter Explore More NASA Glenn Reinforces Role in Aerospace Innovation During Ohio Space Week Article 2 months ago NASA Glenn’s AeroSpace Frontiers Newsletter Takes a Bow Article 2 months ago Glenn Highlights Space Exploration at Minnesota State Fair Article 2 months ago",
                "timestamp": "2025-11-14T17:39:19+00:00"
            }
        ],
        "urls": [
            "https://www.nasa.gov/newsletters/aerospace-frontiers/nasa-glenn-teams-win-2025-rd-100-awards/"
        ],
        "rep_text": "Artistic rendering of the High-Rate Delay Tolerant Networking protocol being used on the Laser Communications Relay Demonstration to transfer radio and optical communications between Earth and space. Credit: NASA NASA’s Glenn Research Center in Cleveland has earned 2025 R&D 100 Awards for developing a system that delivers high-speed internet for space and co-inventing technology for a new class of soft magnetic nanocrystalline materials designed to operate at extreme temperatures. This brings NASA Glenn’s total to 130 R&D 100 Awards. High-Rate Delay Tolerant Networking NASA Glenn’s Daniel Raible and Rachel Dudukovich led their team of engineers to create High-Rate Delay Tolerant Networking (HDTN) , a cutting-edge software solution designed to revolutionize data streaming and communication in space. HDTN enables reliable, high-speed transmission of data between space and Earth — even under the extreme conditions of space — minimizing loss and system delay. High-Rate Delay Tolerant Networking team photo, left to right: Tad Kollar, Eric Brace, Brian Tomko, José Lombay-González, Nadia Kortas, Daniel Raible, John Nowakowski, Shaun McKeehan, Ethan Schweinsberg, Prash Choksi, and Rachel Dudukovich. Credit: NASA/Jef Janis “The HDTN software protocol allows faster, automated, and seamless data transfer between spacecraft, even across communication systems operating on different link speeds,” Raible said. “It’s up to 10 times faster than current delay-tolerant networking (DTN).” This advanced technology has far-reaching implications beyond NASA. With its open-source code, HDTN paves the way for collaboration, innovation, and adoption across the rapidly expanding commercial space industry, offering near real-time communication capabilities. Looking ahead, HDTN could form the foundation of a solar system-wide internet, supporting data exchange between Earth, spacecraft, and even future missions involving human travel to the Moon and Mars. VulcanAlloy In a project led by the University of Pittsburgh, researchers at NASA Glenn, including Nick Bruno, Grant Feichter, Vladimir Keylin, Alex Leary, and Ron Noebe, partnered with CorePower Magnetics to develop VulcanAlloy — a breakthrough soft magnetic nanocrystalline material. NASA’s Glenn Research Center in Cleveland tested high-temperature inductors using VulcanAlloy technology in the NASA Glenn Extreme Environments Rig, which simulates the conditions on Venus’ surface, on May 13, 2025. Credit: NASA VulcanAlloy, developed under NASA’s High Operating Temperature Technology Program using processing capability established by the Advanced Air Transport Technology project, operates above 500°C, far beyond the limits of conventional soft magnetic materials. Its nano-engineered structure maintains efficiency at high temperatures and frequencies. With adjustable magnetic properties, it can replace multiple materials in components like inductors, transformers, motors, and sensors while reducing the need for bulky cooling systems — ideal for extreme environments. Raytheon has tested VulcanAlloy cores, highlighting their potential in electrified aircraft, defense, and aerospace systems. This innovation also promises major impact in electric vehicles, data centers, microgrids, and energy systems, where smaller, lighter, and more efficient components are key to advancing next-generation power electronics. The R&D 100 Awards, a worldwide science and innovation competition, received entries from organizations around the world. Now in its 63rd year, this year’s judging panel included industry professionals from across the globe who evaluated breakthrough innovations in technology and science. Return to Newsletter Explore More NASA Glenn Reinforces Role in Aerospace Innovation During Ohio Space Week Article 2 months ago NASA Glenn’s AeroSpace Frontiers Newsletter Takes a Bow Article 2 months ago Glenn Highlights Space Exploration at Minnesota State Fair Article 2 months ago",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "1cd9f2fb290651b54056b458ca16c621",
        "rep_id": "1cd9f2fb290651b54056b458ca16c621",
        "member_ids": [
            "1cd9f2fb290651b54056b458ca16c621"
        ],
        "rep_title": "Hubble Studies Star Ages in Colorful Galaxy",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-14T12:46:56+00:00",
        "articles": [
            {
                "id": "1cd9f2fb290651b54056b458ca16c621",
                "title": "Hubble Studies Star Ages in Colorful Galaxy",
                "source": "NASA",
                "url": "https://science.nasa.gov/missions/hubble/hubble-studies-star-ages-in-colorful-galaxy/",
                "text": "Explore Hubble Hubble Home Overview About Hubble The History of Hubble Hubble Timeline Why Have a Telescope in Space? Hubble by the Numbers At the Museum FAQs Impact & Benefits Hubble’s Impact & Benefits Science Impacts Cultural Impact Technology Benefits Impact on Human Spaceflight Astro Community Impacts Science Hubble Science Science Themes Science Highlights Science Behind Discoveries Universe Uncovered Hubble’s Partners in Science AI and Hubble Science Explore the Night Sky Observatory Hubble Observatory Hubble Design Mission Operations Science Operations Astronaut Missions to Hubble Hubble vs Webb Team Hubble Team Career Aspirations Hubble Astronauts Multimedia Images Videos Sonifications Podcasts e-Books Online Activities 3D Hubble Models Lithographs Fact Sheets Posters Hubble on the NASA App Glossary News Hubble News Social Media Media Resources More 35th Anniversary Online Activities 2 min read Hubble Studies Star Ages in Colorful Galaxy This NASA/ESA Hubble Space Telescope image features the spiral galaxy called NGC 6000. ESA/Hubble & NASA, A. Filippenko; Acknowledgment: M. H. Özsaraç Stars of all ages are on display in this NASA/ESA Hubble Space Telescope image of the sparkling spiral galaxy called NGC 6000, located 102 million light-years away in the constellation Scorpius. NGC 6000 has a glowing yellow center and glittering blue outskirts. These colors reflect differences in the average ages, masses, and temperatures of the galaxy’s stars. At the heart of the galaxy, the stars tend to be older and smaller. Less massive stars are cooler than more massive stars, and somewhat counterintuitively, cooler stars are redder, while hotter stars are bluer. Farther out along NGC 6000’s spiral arms, brilliant star clusters host young, massive stars that appear distinctly blue. Hubble collected the data for this image while surveying the sites of recent supernova explosions in nearby galaxies. NGC 6000 hosted two recent supernovae: SN 2007ch in 2007 and SN 2010as in 2010. Using Hubble’s sensitive detectors, researchers can discern the faint glow of supernovae years after the initial explosion. These observations help constrain the masses of supernovae progenitor stars and can indicate if they had any stellar companions. By zooming in to the right side of the galaxy’s disk in this image, you can see a set of four thin yellow and blue lines. These lines are an asteroid in our solar system that was drifting across Hubble’s field of view as it gazed at NGC 6000. The four lines are due to four different exposures recorded one after another with slight pauses in between. Image processors combined these four exposures to create the final image. The lines appear dashed with alternating colors because each exposure used a filter to collect very specific wavelengths of light, in this case around red and blue. Having these separate exposures of particular wavelengths is important to study and compare stars by their colors — but it also makes asteroid interlopers very obvious! Facebook logo @NASAHubble @NASAHubble Instagram logo @NASAHubble Media Contact : Claire Andreoli ( claire.andreoli@nasa.gov ) NASA’s Goddard Space Flight Center , Greenbelt, MD Share Details Last Updated Nov 14, 2025 Editor Andrea Gianopoulos Location NASA Goddard Space Flight Center Related Terms Hubble Space Telescope Astrophysics Astrophysics Division Galaxies Goddard Space Flight Center Spiral Galaxies Stars The Universe Keep Exploring Discover More Topics From Hubble Hubble Space Telescope Since its 1990 launch, the Hubble Space Telescope has changed our fundamental understanding of the universe. Hubble News Hubble Science Highlights Hubble Online Activities",
                "timestamp": "2025-11-14T12:46:56+00:00"
            }
        ],
        "urls": [
            "https://science.nasa.gov/missions/hubble/hubble-studies-star-ages-in-colorful-galaxy/"
        ],
        "rep_text": "Explore Hubble Hubble Home Overview About Hubble The History of Hubble Hubble Timeline Why Have a Telescope in Space? Hubble by the Numbers At the Museum FAQs Impact & Benefits Hubble’s Impact & Benefits Science Impacts Cultural Impact Technology Benefits Impact on Human Spaceflight Astro Community Impacts Science Hubble Science Science Themes Science Highlights Science Behind Discoveries Universe Uncovered Hubble’s Partners in Science AI and Hubble Science Explore the Night Sky Observatory Hubble Observatory Hubble Design Mission Operations Science Operations Astronaut Missions to Hubble Hubble vs Webb Team Hubble Team Career Aspirations Hubble Astronauts Multimedia Images Videos Sonifications Podcasts e-Books Online Activities 3D Hubble Models Lithographs Fact Sheets Posters Hubble on the NASA App Glossary News Hubble News Social Media Media Resources More 35th Anniversary Online Activities 2 min read Hubble Studies Star Ages in Colorful Galaxy This NASA/ESA Hubble Space Telescope image features the spiral galaxy called NGC 6000. ESA/Hubble & NASA, A. Filippenko; Acknowledgment: M. H. Özsaraç Stars of all ages are on display in this NASA/ESA Hubble Space Telescope image of the sparkling spiral galaxy called NGC 6000, located 102 million light-years away in the constellation Scorpius. NGC 6000 has a glowing yellow center and glittering blue outskirts. These colors reflect differences in the average ages, masses, and temperatures of the galaxy’s stars. At the heart of the galaxy, the stars tend to be older and smaller. Less massive stars are cooler than more massive stars, and somewhat counterintuitively, cooler stars are redder, while hotter stars are bluer. Farther out along NGC 6000’s spiral arms, brilliant star clusters host young, massive stars that appear distinctly blue. Hubble collected the data for this image while surveying the sites of recent supernova explosions in nearby galaxies. NGC 6000 hosted two recent supernovae: SN 2007ch in 2007 and SN 2010as in 2010. Using Hubble’s sensitive detectors, researchers can discern the faint glow of supernovae years after the initial explosion. These observations help constrain the masses of supernovae progenitor stars and can indicate if they had any stellar companions. By zooming in to the right side of the galaxy’s disk in this image, you can see a set of four thin yellow and blue lines. These lines are an asteroid in our solar system that was drifting across Hubble’s field of view as it gazed at NGC 6000. The four lines are due to four different exposures recorded one after another with slight pauses in between. Image processors combined these four exposures to create the final image. The lines appear dashed with alternating colors because each exposure used a filter to collect very specific wavelengths of light, in this case around red and blue. Having these separate exposures of particular wavelengths is important to study and compare stars by their colors — but it also makes asteroid interlopers very obvious! Facebook logo @NASAHubble @NASAHubble Instagram logo @NASAHubble Media Contact : Claire Andreoli ( claire.andreoli@nasa.gov ) NASA’s Goddard Space Flight Center , Greenbelt, MD Share Details Last Updated Nov 14, 2025 Editor Andrea Gianopoulos Location NASA Goddard Space Flight Center Related Terms Hubble Space Telescope Astrophysics Astrophysics Division Galaxies Goddard Space Flight Center Spiral Galaxies Stars The Universe Keep Exploring Discover More Topics From Hubble Hubble Space Telescope Since its 1990 launch, the Hubble Space Telescope has changed our fundamental understanding of the universe. Hubble News Hubble Science Highlights Hubble Online Activities",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "853c836eb99d85ae60774121920f2563",
        "rep_id": "853c836eb99d85ae60774121920f2563",
        "member_ids": [
            "853c836eb99d85ae60774121920f2563"
        ],
        "rep_title": "Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today!",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-14T00:27:17+00:00",
        "articles": [
            {
                "id": "853c836eb99d85ae60774121920f2563",
                "title": "Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today!",
                "source": "NASA",
                "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4702-4708-its-only-spooky-here-on-earth-today/",
                "text": "Curiosity Navigation Curiosity Home Mission Overview Where is Curiosity? Mission Updates Science Overview Instruments Highlights Exploration Goals News and Features Multimedia Curiosity Raw Images Images Videos Audio Mosaics More Resources Mars Missions Mars Sample Return Mars Perseverance Rover Mars Curiosity Rover MAVEN Mars Reconnaissance Orbiter Mars Odyssey More Mars Missions Mars Home 4 min read Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today! NASA’s Mars rover Curiosity acquired this image at the start of the drilling activity at the “Valle de la Luna” site, “caught in the act” as this image was taken on Oct. 19, 2025. Curiosity used its Front Hazard Avoidance Camera (Front Hazcam) on Sol 4693, or Martian day 4,693 of the Mars Science Laboratory mission, at 01:54:37 UTC. NASA/JPL-Caltech By Susanne P. Schwenzer, Professor of Planetary Mineralogy at The Open University, U.K. Earth planning date: Friday, Oct. 31, 2025 I am writing this blog and it’s still daytime — and I am looking forward to accompanying one of my favorite kids to trick-and-treating afterwards. That’s a new feeling for me because I am usually in the U.K., which means my Curiosity shifts start in the late afternoon when everyone else finishes working. But for now, I am in the U.S. (Houston, Texas), and it’s daytime, which is a lovely change, especially today as I don’t have to hide from trick-and-treaters’ interruptions but instead can give out all the candy they can possibly eat! Looking forward to that… but before, let’s see what Curiosity was up to this week! You’ll have seen the blog by my colleague Bill, “Searching for Answers at Monte Grande,” about our analysis of the “Valle de la Luna” sample with CheMin and SAM EGA. This week we were continuing the SAM analysis of the 44th drilled sample, which always takes a lot of power, so that leaves less room for other investigations. Hence, you might notice that there were fewer ChemCam and Mastcam activities. The rover also did not drive while sample is still in the turret ready for delivery of the next SAM activities. Curiosity has now completed the deliveries to CheMin and SAM, though, and the last action in Friday’s plan was to clean out the remaining sample from the drill in preparation for driving away here in Monday’s plan. In Monday’s plan we’ll reposition the rover to get a very good look at the potential next drill targets on the ridge. We’ve been able to scout them already in previous images and have a few candidates, but decision-making will require images from Monday’s parking position, since we are currently parked in a hollow and cannot really see what’s up on the ridge. That said, being stationary has always been a golden opportunity for looking at wind action, and this week was no difference as Mastcam looked at the drill fines several times over the time we were stationary, to ascertain the safety for MAHLI to approach — and of course to use those images for atmospheric science, too. In addition, Mastcam took the opportunity to get comprehensive imaging of the entire area. There are several mosaics that document the near-field, for example at target “Nazareth.” In the mid- and far-field distances, Mastcam assembled a large mosaic on “Monte Grande” and “Ticaco” to document the different rocks in the surrounding ridge walls and wider afield. There are so many interesting textures and alteration features, alongside troughs and fractures, that the team will have a fun time analyzing them all in great detail individually, as well as their relationships to each other. ChemCam has investigated the Valle de la Luna drill hole and tailings as per the usual cadence of post-drilling activities, and in addition investigated target Nazareth to understand how the block that Curiosity drilled might vary chemically. Another ChemCam target was “Pachica,” as the team observed many nodules in this target and we are interested in their chemical variability and “Palpana,” a more smooth block. Further investigations of the Valle de la Luna drill hole with ChemCam are targets “Anapia” and “Bandara” to further investigate the chemical diversity of the drill target block. ChemCam Remote Micro Imager (RMI) observations were also taken in the near-field and farther away. In the near-field, RMI images are documenting further details on the Valle de la Luna drill hole and its tailings, while further afield the Monte Grande Wall is one of the RMI targets alongside with other details in the boxwork ridges around us. On Friday, the RMI was pointed far uphill to continue imaging the yardang unit, which is one of our next goals in the longer term future. In addition to all the drill activities and rock investigations, the atmosphere received attention too. We have the usual cadence of environmental investigations, building our long-term pressure, temperature, and humidity record of Mars; and we observe the atmospheric opacity, dust-devil activities, and clouds. Of course, we are all looking forward to next week, when we will decide on the second drill target in this area, this time on the ridge. Let’s see what block will be looking best, both from a science and an engineering point of view – we’ve got a short list of candidates; the detailed images are for Monday’s plan. Meanwhile, we’ll enjoy trick-and-treating here on Earth and our weekends while Curiosity finishes the drill activities at Valle de la Luna. Want to read more posts from the Curiosity team? Visit Mission Updates Want to learn more about Curiosity’s science instruments? Visit the Science Instruments page NASA’s Mars rover Curiosity at the base of Mount Sharp NASA/JPL-Caltech/MSSS Share Details Last Updated Nov 13, 2025 Related Terms Blogs Explore More 3 min read Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande Article 40 minutes ago 3 min read Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO! Article 43 minutes ago 4 min read Curiosity Blog, Sols 4682-4688: Seven Mars Years Article 50 minutes ago Keep Exploring Discover More Topics From NASA Mars Mars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited… All Mars Resources Explore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,… Rover Basics Each robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a… Mars Exploration: Science Goals The key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
                "timestamp": "2025-11-14T00:27:17+00:00"
            }
        ],
        "urls": [
            "https://science.nasa.gov/blog/curiosity-blog-sols-4702-4708-its-only-spooky-here-on-earth-today/"
        ],
        "rep_text": "Curiosity Navigation Curiosity Home Mission Overview Where is Curiosity? Mission Updates Science Overview Instruments Highlights Exploration Goals News and Features Multimedia Curiosity Raw Images Images Videos Audio Mosaics More Resources Mars Missions Mars Sample Return Mars Perseverance Rover Mars Curiosity Rover MAVEN Mars Reconnaissance Orbiter Mars Odyssey More Mars Missions Mars Home 4 min read Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today! NASA’s Mars rover Curiosity acquired this image at the start of the drilling activity at the “Valle de la Luna” site, “caught in the act” as this image was taken on Oct. 19, 2025. Curiosity used its Front Hazard Avoidance Camera (Front Hazcam) on Sol 4693, or Martian day 4,693 of the Mars Science Laboratory mission, at 01:54:37 UTC. NASA/JPL-Caltech By Susanne P. Schwenzer, Professor of Planetary Mineralogy at The Open University, U.K. Earth planning date: Friday, Oct. 31, 2025 I am writing this blog and it’s still daytime — and I am looking forward to accompanying one of my favorite kids to trick-and-treating afterwards. That’s a new feeling for me because I am usually in the U.K., which means my Curiosity shifts start in the late afternoon when everyone else finishes working. But for now, I am in the U.S. (Houston, Texas), and it’s daytime, which is a lovely change, especially today as I don’t have to hide from trick-and-treaters’ interruptions but instead can give out all the candy they can possibly eat! Looking forward to that… but before, let’s see what Curiosity was up to this week! You’ll have seen the blog by my colleague Bill, “Searching for Answers at Monte Grande,” about our analysis of the “Valle de la Luna” sample with CheMin and SAM EGA. This week we were continuing the SAM analysis of the 44th drilled sample, which always takes a lot of power, so that leaves less room for other investigations. Hence, you might notice that there were fewer ChemCam and Mastcam activities. The rover also did not drive while sample is still in the turret ready for delivery of the next SAM activities. Curiosity has now completed the deliveries to CheMin and SAM, though, and the last action in Friday’s plan was to clean out the remaining sample from the drill in preparation for driving away here in Monday’s plan. In Monday’s plan we’ll reposition the rover to get a very good look at the potential next drill targets on the ridge. We’ve been able to scout them already in previous images and have a few candidates, but decision-making will require images from Monday’s parking position, since we are currently parked in a hollow and cannot really see what’s up on the ridge. That said, being stationary has always been a golden opportunity for looking at wind action, and this week was no difference as Mastcam looked at the drill fines several times over the time we were stationary, to ascertain the safety for MAHLI to approach — and of course to use those images for atmospheric science, too. In addition, Mastcam took the opportunity to get comprehensive imaging of the entire area. There are several mosaics that document the near-field, for example at target “Nazareth.” In the mid- and far-field distances, Mastcam assembled a large mosaic on “Monte Grande” and “Ticaco” to document the different rocks in the surrounding ridge walls and wider afield. There are so many interesting textures and alteration features, alongside troughs and fractures, that the team will have a fun time analyzing them all in great detail individually, as well as their relationships to each other. ChemCam has investigated the Valle de la Luna drill hole and tailings as per the usual cadence of post-drilling activities, and in addition investigated target Nazareth to understand how the block that Curiosity drilled might vary chemically. Another ChemCam target was “Pachica,” as the team observed many nodules in this target and we are interested in their chemical variability and “Palpana,” a more smooth block. Further investigations of the Valle de la Luna drill hole with ChemCam are targets “Anapia” and “Bandara” to further investigate the chemical diversity of the drill target block. ChemCam Remote Micro Imager (RMI) observations were also taken in the near-field and farther away. In the near-field, RMI images are documenting further details on the Valle de la Luna drill hole and its tailings, while further afield the Monte Grande Wall is one of the RMI targets alongside with other details in the boxwork ridges around us. On Friday, the RMI was pointed far uphill to continue imaging the yardang unit, which is one of our next goals in the longer term future. In addition to all the drill activities and rock investigations, the atmosphere received attention too. We have the usual cadence of environmental investigations, building our long-term pressure, temperature, and humidity record of Mars; and we observe the atmospheric opacity, dust-devil activities, and clouds. Of course, we are all looking forward to next week, when we will decide on the second drill target in this area, this time on the ridge. Let’s see what block will be looking best, both from a science and an engineering point of view – we’ve got a short list of candidates; the detailed images are for Monday’s plan. Meanwhile, we’ll enjoy trick-and-treating here on Earth and our weekends while Curiosity finishes the drill activities at Valle de la Luna. Want to read more posts from the Curiosity team? Visit Mission Updates Want to learn more about Curiosity’s science instruments? Visit the Science Instruments page NASA’s Mars rover Curiosity at the base of Mount Sharp NASA/JPL-Caltech/MSSS Share Details Last Updated Nov 13, 2025 Related Terms Blogs Explore More 3 min read Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande Article 40 minutes ago 3 min read Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO! Article 43 minutes ago 4 min read Curiosity Blog, Sols 4682-4688: Seven Mars Years Article 50 minutes ago Keep Exploring Discover More Topics From NASA Mars Mars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited… All Mars Resources Explore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,… Rover Basics Each robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a… Mars Exploration: Science Goals The key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "1312ecf80e0de9267642a73c3bad0220",
        "rep_id": "1312ecf80e0de9267642a73c3bad0220",
        "member_ids": [
            "1312ecf80e0de9267642a73c3bad0220"
        ],
        "rep_title": "Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-14T00:25:18+00:00",
        "articles": [
            {
                "id": "1312ecf80e0de9267642a73c3bad0220",
                "title": "Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande",
                "source": "NASA",
                "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4695-4701-searching-for-answers-at-monte-grande/",
                "text": "Curiosity Navigation Curiosity Home Mission Overview Where is Curiosity? Mission Updates Science Overview Instruments Highlights Exploration Goals News and Features Multimedia Curiosity Raw Images Images Videos Audio Mosaics More Resources Mars Missions Mars Sample Return Mars Perseverance Rover Mars Curiosity Rover MAVEN Mars Reconnaissance Orbiter Mars Odyssey More Mars Missions Mars Home 3 min read Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande NASA’s Mars rover Curiosity acquired this image of the “Valle de la Luna” drill hole using its Mast Camera (Mastcam) on Oct. 19, 2025 — Sol 4693, or Martian day 4,693 of the Mars Science Laboratory mission — at 02:04:29 UTC. NASA/JPL-Caltech/MSSS Written by William Farrand, Senior Research Scientist, Space Science Institute Earth planning date: Friday, Oct. 24, 2025 Curiosity has successfully drilled its 44 th hole on Mars, which is a major milestone in our investigation of the enigmatic “boxwork unit,” a region of resistant ridges surrounding pits or “hollows” of less-resistant rock. The drilling took place over the past weekend within the “Monte Grande” hollow at the “Valle de la Luna” target. Rover planning this week consisted of ensuring that the granular drill tailings from Valle de la Luna were transferred to the SAM (Sample Analysis at Mars) and CheMin (X-ray diffraction) instruments, and analyzing the results. Results from these instruments, which will provide mineralogical and other compositional information, will be especially critical for determining how the boxwork features formed, since chemistry from the APXS and ChemCam instruments and reflectance spectra from ChemCam have revealed subtle, but not striking, differences between the rocks making up the ridges and those making up the hollows. Thus, a compositional explanation for the differences between the two terrain types has yet to be determined. While these internal studies of the Valle de la Luna samples were going on, remote sensing data were collected by Mastcam of a series of targets, as well as atmospheric remote sensing. Among the Mastcam studies being conducted is a photometry study, a kind of study usually only carried out during an extended stationary period, such as the current drill campaign. Photometry is the study of changes in the apparent reflected brightness of rocks and soils based on the illumination geometry (for example, whether the Sun is low on the horizon or high in the sky). During this photometry campaign, multiple images are collected of the same target regions at different times of day. In the final plan of the week, as part of the ongoing assessment of the Valle de la Luna sample, material will undergo an evolved gas analysis (EGA) in which the drilled sample is baked in an oven in SAM and volatile molecules including H 2 O, CO 2 , and SO 2 are released and used to further aid in the characterization of the target materials. Mastcam observations will include further images collected as part of the photometry campaign. Also mosaics of the west wall of the Monte Grande hollow will be collected as well as several atmospheric measurements. Next week the rover will continue analyzing the drilled sample with more SAM experiments, and also analyze the tailings. The team is also starting to search for a suitable drilling location on a ridge as the next drilling site, in order to compare with the results from the Monte Grande hollow. Want to read more posts from the Curiosity team? Visit Mission Updates Want to learn more about Curiosity’s science instruments? Visit the Science Instruments page NASA’s Mars rover Curiosity at the base of Mount Sharp NASA/JPL-Caltech/MSSS Share Details Last Updated Nov 13, 2025 Related Terms Blogs Explore More 4 min read Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today! Article 38 minutes ago 3 min read Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO! Article 43 minutes ago 4 min read Curiosity Blog, Sols 4682-4688: Seven Mars Years Article 50 minutes ago Keep Exploring Discover More Topics From NASA Mars Mars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited… All Mars Resources Explore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,… Rover Basics Each robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a… Mars Exploration: Science Goals The key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
                "timestamp": "2025-11-14T00:25:18+00:00"
            }
        ],
        "urls": [
            "https://science.nasa.gov/blog/curiosity-blog-sols-4695-4701-searching-for-answers-at-monte-grande/"
        ],
        "rep_text": "Curiosity Navigation Curiosity Home Mission Overview Where is Curiosity? Mission Updates Science Overview Instruments Highlights Exploration Goals News and Features Multimedia Curiosity Raw Images Images Videos Audio Mosaics More Resources Mars Missions Mars Sample Return Mars Perseverance Rover Mars Curiosity Rover MAVEN Mars Reconnaissance Orbiter Mars Odyssey More Mars Missions Mars Home 3 min read Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande NASA’s Mars rover Curiosity acquired this image of the “Valle de la Luna” drill hole using its Mast Camera (Mastcam) on Oct. 19, 2025 — Sol 4693, or Martian day 4,693 of the Mars Science Laboratory mission — at 02:04:29 UTC. NASA/JPL-Caltech/MSSS Written by William Farrand, Senior Research Scientist, Space Science Institute Earth planning date: Friday, Oct. 24, 2025 Curiosity has successfully drilled its 44 th hole on Mars, which is a major milestone in our investigation of the enigmatic “boxwork unit,” a region of resistant ridges surrounding pits or “hollows” of less-resistant rock. The drilling took place over the past weekend within the “Monte Grande” hollow at the “Valle de la Luna” target. Rover planning this week consisted of ensuring that the granular drill tailings from Valle de la Luna were transferred to the SAM (Sample Analysis at Mars) and CheMin (X-ray diffraction) instruments, and analyzing the results. Results from these instruments, which will provide mineralogical and other compositional information, will be especially critical for determining how the boxwork features formed, since chemistry from the APXS and ChemCam instruments and reflectance spectra from ChemCam have revealed subtle, but not striking, differences between the rocks making up the ridges and those making up the hollows. Thus, a compositional explanation for the differences between the two terrain types has yet to be determined. While these internal studies of the Valle de la Luna samples were going on, remote sensing data were collected by Mastcam of a series of targets, as well as atmospheric remote sensing. Among the Mastcam studies being conducted is a photometry study, a kind of study usually only carried out during an extended stationary period, such as the current drill campaign. Photometry is the study of changes in the apparent reflected brightness of rocks and soils based on the illumination geometry (for example, whether the Sun is low on the horizon or high in the sky). During this photometry campaign, multiple images are collected of the same target regions at different times of day. In the final plan of the week, as part of the ongoing assessment of the Valle de la Luna sample, material will undergo an evolved gas analysis (EGA) in which the drilled sample is baked in an oven in SAM and volatile molecules including H 2 O, CO 2 , and SO 2 are released and used to further aid in the characterization of the target materials. Mastcam observations will include further images collected as part of the photometry campaign. Also mosaics of the west wall of the Monte Grande hollow will be collected as well as several atmospheric measurements. Next week the rover will continue analyzing the drilled sample with more SAM experiments, and also analyze the tailings. The team is also starting to search for a suitable drilling location on a ridge as the next drilling site, in order to compare with the results from the Monte Grande hollow. Want to read more posts from the Curiosity team? Visit Mission Updates Want to learn more about Curiosity’s science instruments? Visit the Science Instruments page NASA’s Mars rover Curiosity at the base of Mount Sharp NASA/JPL-Caltech/MSSS Share Details Last Updated Nov 13, 2025 Related Terms Blogs Explore More 4 min read Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today! Article 38 minutes ago 3 min read Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO! Article 43 minutes ago 4 min read Curiosity Blog, Sols 4682-4688: Seven Mars Years Article 50 minutes ago Keep Exploring Discover More Topics From NASA Mars Mars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited… All Mars Resources Explore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,… Rover Basics Each robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a… Mars Exploration: Science Goals The key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "0d45243d93b37c7f35bf7bd551b5376e",
        "rep_id": "0d45243d93b37c7f35bf7bd551b5376e",
        "member_ids": [
            "0d45243d93b37c7f35bf7bd551b5376e"
        ],
        "rep_title": "Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO!",
        "sources": [
            "NASA"
        ],
        "timestamp": "2025-11-14T00:22:05+00:00",
        "articles": [
            {
                "id": "0d45243d93b37c7f35bf7bd551b5376e",
                "title": "Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO!",
                "source": "NASA",
                "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4689-4694-drill-in-the-boxwork-unit-is-go/",
                "text": "Curiosity Navigation Curiosity Home Mission Overview Where is Curiosity? Mission Updates Science Overview Instruments Highlights Exploration Goals News and Features Multimedia Curiosity Raw Images Images Videos Audio Mosaics More Resources Mars Missions Mars Sample Return Mars Perseverance Rover Mars Curiosity Rover MAVEN Mars Reconnaissance Orbiter Mars Odyssey More Mars Missions Mars Home 3 min read Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO! NASA’s Mars rover Curiosity acquired this image showing the “Valle de la Luna” block in the “Monte Grande” hollow, a location it targeted for drilling the weekend of Oct. 18-19, 2025. Curiosity captured the image with its Front Hazard Avoidance Camera (Front Hazcam) on Oct. 12, 2025 — Sol 4687, or Martian day 4,687 of the Mars Science Laboratory mission — at 23:11:12 UTC. NASA/JPL-Caltech Written by Catherine O’Connell-Cooper, APXS Payload Uplink/Downlink Lead, University of New Brunswick Earth planning date: Friday, Oct. 17, 2025 Curiosity has been investigating the “boxwork unit” for several months now. Readers might remember we drilled at the edge of the boxwork at “Altadena ,” back in June. Since then, we have driven just under a kilometer across the boxwork unit (about 0.6 miles) and now we are ready to acquire the next drill target, in an area where the structure is really well preserved. The boxwork structures are a series of ridges and hollows, so our plan is to drill within one of the hollows and then on one of the adjacent ridges. On Monday, we did our drill triage on “Valle de la Luna” within the hollow “ Monte Grande ” – a multi-instrument endeavor. We assessed the chemistry using APXS and ChemCam, to make sure it is within the expected range and not something completely different from the bedrock compositions we have been tracking. The rover planners (RPs) use a “pre-load” test, putting pressure on the bedrock surface to characterize how the rover arm and rock might behave during drilling. We take multiple images (including images before and after the pre-load test), using MAHLI and Mastcam to help the RPs assess the surface of the potential drill area. Finding a suitable place to drill in the hollows was a challenge, as the low point of each hollow (what we are most interested in) is often covered in sand or small pebbles, with just sparse bedrock peeking through, as you can see in the accompanying image . However, we got lucky here in Monte Grande. The chemistry shows that this rock is within our expected compositional range. The MAHLI images show a smoother surface in the center of the brushed area (where the drill will focus), and the before-and-after images indicated that the rock reacted well to the pre-load test. On Friday, the RPs and mission scientists pored over the data in a very intensive meeting called the “Target Acquisition Assessment Meeting,” or TAAM. We have drilled 43 holes on Mars now and it’s always nerve-wracking, waiting to see if the information we gathered during our initial contact science and preload give us a go-ahead. About midway through the planning day, we got the news that TAAM said yes to drilling here, so we will drill on the first sol of this weekend plan. If the drill is successful, we will have no contact science for at least a week, as the arm cannot be deployed during a drill campaign. Normally, as I’m APXS PUDL (responsible for uplinking new APXS targets and assessing downlink of previous targets), the idea of a week with no contact science would be disappointing to me — but not during a drill campaign! CheMin (Chemistry Mineralogy) and SAM (Sample Analysis at Mars) will use the drilled sample to give us extra depth of information, looking at mineralogy and composition in a way that is not possible for APXS and ChemCam. We can then use that drill data to help us interpret the APXS and ChemCam data and better understand the formation of these boxworks, especially if we can pair it with a suitable target on the ridges. In the meantime of course, we continue to monitor the atmosphere and environment around us. The Mastcam team are planning some amazing images from this site and ChemCam will continue to characterize the nearby bedrock and image the far-off hills. Want to read more posts from the Curiosity team? Visit Mission Updates Want to learn more about Curiosity’s science instruments? Visit the Science Instruments page NASA’s Mars rover Curiosity at the base of Mount Sharp NASA/JPL-Caltech/MSSS Share Details Last Updated Nov 13, 2025 Related Terms Blogs Explore More 4 min read Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today! Article 38 minutes ago 3 min read Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande Article 40 minutes ago 4 min read Curiosity Blog, Sols 4682-4688: Seven Mars Years Article 50 minutes ago Keep Exploring Discover More Topics From NASA Mars Mars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited… All Mars Resources Explore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,… Rover Basics Each robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a… Mars Exploration: Science Goals The key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
                "timestamp": "2025-11-14T00:22:05+00:00"
            }
        ],
        "urls": [
            "https://science.nasa.gov/blog/curiosity-blog-sols-4689-4694-drill-in-the-boxwork-unit-is-go/"
        ],
        "rep_text": "Curiosity Navigation Curiosity Home Mission Overview Where is Curiosity? Mission Updates Science Overview Instruments Highlights Exploration Goals News and Features Multimedia Curiosity Raw Images Images Videos Audio Mosaics More Resources Mars Missions Mars Sample Return Mars Perseverance Rover Mars Curiosity Rover MAVEN Mars Reconnaissance Orbiter Mars Odyssey More Mars Missions Mars Home 3 min read Curiosity Blog, Sols 4689-4694: Drill in the Boxwork Unit is GO! NASA’s Mars rover Curiosity acquired this image showing the “Valle de la Luna” block in the “Monte Grande” hollow, a location it targeted for drilling the weekend of Oct. 18-19, 2025. Curiosity captured the image with its Front Hazard Avoidance Camera (Front Hazcam) on Oct. 12, 2025 — Sol 4687, or Martian day 4,687 of the Mars Science Laboratory mission — at 23:11:12 UTC. NASA/JPL-Caltech Written by Catherine O’Connell-Cooper, APXS Payload Uplink/Downlink Lead, University of New Brunswick Earth planning date: Friday, Oct. 17, 2025 Curiosity has been investigating the “boxwork unit” for several months now. Readers might remember we drilled at the edge of the boxwork at “Altadena ,” back in June. Since then, we have driven just under a kilometer across the boxwork unit (about 0.6 miles) and now we are ready to acquire the next drill target, in an area where the structure is really well preserved. The boxwork structures are a series of ridges and hollows, so our plan is to drill within one of the hollows and then on one of the adjacent ridges. On Monday, we did our drill triage on “Valle de la Luna” within the hollow “ Monte Grande ” – a multi-instrument endeavor. We assessed the chemistry using APXS and ChemCam, to make sure it is within the expected range and not something completely different from the bedrock compositions we have been tracking. The rover planners (RPs) use a “pre-load” test, putting pressure on the bedrock surface to characterize how the rover arm and rock might behave during drilling. We take multiple images (including images before and after the pre-load test), using MAHLI and Mastcam to help the RPs assess the surface of the potential drill area. Finding a suitable place to drill in the hollows was a challenge, as the low point of each hollow (what we are most interested in) is often covered in sand or small pebbles, with just sparse bedrock peeking through, as you can see in the accompanying image . However, we got lucky here in Monte Grande. The chemistry shows that this rock is within our expected compositional range. The MAHLI images show a smoother surface in the center of the brushed area (where the drill will focus), and the before-and-after images indicated that the rock reacted well to the pre-load test. On Friday, the RPs and mission scientists pored over the data in a very intensive meeting called the “Target Acquisition Assessment Meeting,” or TAAM. We have drilled 43 holes on Mars now and it’s always nerve-wracking, waiting to see if the information we gathered during our initial contact science and preload give us a go-ahead. About midway through the planning day, we got the news that TAAM said yes to drilling here, so we will drill on the first sol of this weekend plan. If the drill is successful, we will have no contact science for at least a week, as the arm cannot be deployed during a drill campaign. Normally, as I’m APXS PUDL (responsible for uplinking new APXS targets and assessing downlink of previous targets), the idea of a week with no contact science would be disappointing to me — but not during a drill campaign! CheMin (Chemistry Mineralogy) and SAM (Sample Analysis at Mars) will use the drilled sample to give us extra depth of information, looking at mineralogy and composition in a way that is not possible for APXS and ChemCam. We can then use that drill data to help us interpret the APXS and ChemCam data and better understand the formation of these boxworks, especially if we can pair it with a suitable target on the ridges. In the meantime of course, we continue to monitor the atmosphere and environment around us. The Mastcam team are planning some amazing images from this site and ChemCam will continue to characterize the nearby bedrock and image the far-off hills. Want to read more posts from the Curiosity team? Visit Mission Updates Want to learn more about Curiosity’s science instruments? Visit the Science Instruments page NASA’s Mars rover Curiosity at the base of Mount Sharp NASA/JPL-Caltech/MSSS Share Details Last Updated Nov 13, 2025 Related Terms Blogs Explore More 4 min read Curiosity Blog, Sols 4702-4708: It’s Only Spooky Here on Earth Today! Article 38 minutes ago 3 min read Curiosity Blog, Sols 4695-4701: Searching for Answers at Monte Grande Article 40 minutes ago 4 min read Curiosity Blog, Sols 4682-4688: Seven Mars Years Article 50 minutes ago Keep Exploring Discover More Topics From NASA Mars Mars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited… All Mars Resources Explore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,… Rover Basics Each robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a… Mars Exploration: Science Goals The key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "e50aa79a9905407f4333ea63241e54af",
        "rep_id": "e50aa79a9905407f4333ea63241e54af",
        "member_ids": [
            "e50aa79a9905407f4333ea63241e54af"
        ],
        "rep_title": "Sentinel-6 mission",
        "sources": [
            "ESA"
        ],
        "timestamp": "2017-04-12T14:25:00+00:00",
        "articles": [
            {
                "id": "e50aa79a9905407f4333ea63241e54af",
                "title": "Sentinel-6 mission",
                "source": "ESA",
                "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-6",
                "text": "Charting sea level for Copernicus With global mean sea level rising because of climate change, Copernicus Sentinel-6 is the next radar altimetry reference mission to extend the legacy of sea-surface height measurements until at least 2030. Each satellite carries a Poseidon-4 radar altimeter and a microwave radiometer. Date : Sentinel-6 Michael Freilich - 21 November 2020 Sentinel-6B - 17 November 2025 Site : Vandenberg, California, US Rocket : SpaceX Falcon 9 Copernicus Sentinel-6: Enhanced continuity of satellite sea level measurements",
                "timestamp": "2017-04-12T14:25:00+00:00"
            }
        ],
        "urls": [
            "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-6"
        ],
        "rep_text": "Charting sea level for Copernicus With global mean sea level rising because of climate change, Copernicus Sentinel-6 is the next radar altimetry reference mission to extend the legacy of sea-surface height measurements until at least 2030. Each satellite carries a Poseidon-4 radar altimeter and a microwave radiometer. Date : Sentinel-6 Michael Freilich - 21 November 2020 Sentinel-6B - 17 November 2025 Site : Vandenberg, California, US Rocket : SpaceX Falcon 9 Copernicus Sentinel-6: Enhanced continuity of satellite sea level measurements",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "a639fd8770f8707c4eef01327ff713b1",
        "rep_id": "a639fd8770f8707c4eef01327ff713b1",
        "member_ids": [
            "a639fd8770f8707c4eef01327ff713b1"
        ],
        "rep_title": "A solar prominence hovers over the Sun",
        "sources": [
            "ESA"
        ],
        "timestamp": "2025-11-14T15:00:00+00:00",
        "articles": [
            {
                "id": "a639fd8770f8707c4eef01327ff713b1",
                "title": "A solar prominence hovers over the Sun",
                "source": "ESA",
                "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/11/A_solar_prominence_hovers_over_the_Sun",
                "text": "Video: 00:00:22 The Sun is always mesmerising to watch, but Solar Orbiter captured a special treat on camera: a dark ‘prominence’ sticking out from the side of the Sun. The dark-looking material is dense plasma (charged gas) trapped by the Sun's complex magnetic field. It looks dark because it is cooler than its surroundings, being around 10 000 °C compared to the surrounding million-degree plasma. When viewed against the background of space, the hovering plasma is referred to as a prominence. When viewed against the Sun's surface, it is called a filament. (In this image you can see examples of both.) Solar prominences and filaments extend for tens of thousands of kilometres, several times the diameter of Earth. They can last days or even months. This video shows one hour of footage, sped up to make movement more clearly visible. Solar Orbiter recorded this video with its Extreme Ultraviolet Imager (EUI) instrument on 17 March 2025. At the time, the spacecraft was around 63 million km from the Sun, similar to planet Mercury. Solar Orbiter is a space mission of international collaboration between ESA and NASA. The EUI instrument is led by the Royal Observatory of Belgium (ROB). [Video description: Close-up video of the Sun, filling the left half of the view, its surface covered what looks like moving, glowing hairs accompanied by some short-lived bright arcs. Protruding to the right, in the centre of the video, is dark material that looks almost feathery, with thin streaks flowing both away from and towards the Sun.]",
                "timestamp": "2025-11-14T15:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.esa.int/ESA_Multimedia/Videos/2025/11/A_solar_prominence_hovers_over_the_Sun"
        ],
        "rep_text": "Video: 00:00:22 The Sun is always mesmerising to watch, but Solar Orbiter captured a special treat on camera: a dark ‘prominence’ sticking out from the side of the Sun. The dark-looking material is dense plasma (charged gas) trapped by the Sun's complex magnetic field. It looks dark because it is cooler than its surroundings, being around 10 000 °C compared to the surrounding million-degree plasma. When viewed against the background of space, the hovering plasma is referred to as a prominence. When viewed against the Sun's surface, it is called a filament. (In this image you can see examples of both.) Solar prominences and filaments extend for tens of thousands of kilometres, several times the diameter of Earth. They can last days or even months. This video shows one hour of footage, sped up to make movement more clearly visible. Solar Orbiter recorded this video with its Extreme Ultraviolet Imager (EUI) instrument on 17 March 2025. At the time, the spacecraft was around 63 million km from the Sun, similar to planet Mercury. Solar Orbiter is a space mission of international collaboration between ESA and NASA. The EUI instrument is led by the Royal Observatory of Belgium (ROB). [Video description: Close-up video of the Sun, filling the left half of the view, its surface covered what looks like moving, glowing hairs accompanied by some short-lived bright arcs. Protruding to the right, in the centre of the video, is dark material that looks almost feathery, with thin streaks flowing both away from and towards the Sun.]",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "90da16464c767be4743fa45e951996cf",
        "rep_id": "90da16464c767be4743fa45e951996cf",
        "member_ids": [
            "90da16464c767be4743fa45e951996cf"
        ],
        "rep_title": "Brazil gears up to harness ESA’s Biomass data",
        "sources": [
            "ESA"
        ],
        "timestamp": "2025-11-13T13:10:00+00:00",
        "articles": [
            {
                "id": "90da16464c767be4743fa45e951996cf",
                "title": "Brazil gears up to harness ESA’s Biomass data",
                "source": "ESA",
                "url": "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/Biomass/Brazil_gears_up_to_harness_ESA_s_Biomass_data",
                "text": "<p>As the COP30 climate conference gets underway in Brazil, the world’s attention is once again drawn to the plight of the Amazon – the planet’s largest and most vital rainforest. With the European Space Agency’s Earth Explorer Biomass satellite now in orbit, ESA is helping Brazil prepare to transform this new mission’s groundbreaking data into actionable knowledge for protecting the rainforest and confronting climate change.</p>",
                "timestamp": "2025-11-13T13:10:00+00:00"
            }
        ],
        "urls": [
            "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/Biomass/Brazil_gears_up_to_harness_ESA_s_Biomass_data"
        ],
        "rep_text": "<p>As the COP30 climate conference gets underway in Brazil, the world’s attention is once again drawn to the plight of the Amazon – the planet’s largest and most vital rainforest. With the European Space Agency’s Earth Explorer Biomass satellite now in orbit, ESA is helping Brazil prepare to transform this new mission’s groundbreaking data into actionable knowledge for protecting the rainforest and confronting climate change.</p>",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "004694186ed63feab2e23582774b0937",
        "rep_id": "004694186ed63feab2e23582774b0937",
        "member_ids": [
            "004694186ed63feab2e23582774b0937"
        ],
        "rep_title": "OHB raises concerns about planned European space joint venture",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-16T21:54:39+00:00",
        "articles": [
            {
                "id": "004694186ed63feab2e23582774b0937",
                "title": "OHB raises concerns about planned European space joint venture",
                "source": "SpaceNews",
                "url": "https://spacenews.com/ohb-raises-concerns-about-planned-european-space-joint-venture/",
                "text": "The head of OHB says he is concerned about a planned joint venture among three of his competitors, even as the company sees opportunities from growing European space spending. The post OHB raises concerns about planned European space joint venture appeared first on SpaceNews",
                "timestamp": "2025-11-16T21:54:39+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/ohb-raises-concerns-about-planned-european-space-joint-venture/"
        ],
        "rep_text": "The head of OHB says he is concerned about a planned joint venture among three of his competitors, even as the company sees opportunities from growing European space spending. The post OHB raises concerns about planned European space joint venture appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "82c104b748455e4731f03eafe4a66ac3",
        "rep_id": "82c104b748455e4731f03eafe4a66ac3",
        "member_ids": [
            "82c104b748455e4731f03eafe4a66ac3"
        ],
        "rep_title": "Dream Chaser completes key tests ahead of first flight",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-16T09:13:30+00:00",
        "articles": [
            {
                "id": "82c104b748455e4731f03eafe4a66ac3",
                "title": "Dream Chaser completes key tests ahead of first flight",
                "source": "SpaceNews",
                "url": "https://spacenews.com/dream-chaser-completes-key-tests-ahead-of-first-flight/",
                "text": "Sierra Space has completed key testing milestones for its Dream Chaser vehicle as the company explores both civil and national security missions for the spaceplane. The post Dream Chaser completes key tests ahead of first flight appeared first on SpaceNews",
                "timestamp": "2025-11-16T09:13:30+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/dream-chaser-completes-key-tests-ahead-of-first-flight/"
        ],
        "rep_text": "Sierra Space has completed key testing milestones for its Dream Chaser vehicle as the company explores both civil and national security missions for the spaceplane. The post Dream Chaser completes key tests ahead of first flight appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "675907cf8f0a5cc85af04c0ce9ae57b4",
        "rep_id": "675907cf8f0a5cc85af04c0ce9ae57b4",
        "member_ids": [
            "675907cf8f0a5cc85af04c0ce9ae57b4",
            "b8c3683c83c19f80d1a29f239e764612"
        ],
        "rep_title": "Blue Origin planning next New Glenn flight for early next year",
        "sources": [
            "SpaceNews",
            "SpaceNews"
        ],
        "timestamp": "2025-11-15T01:48:36+00:00",
        "articles": [
            {
                "id": "675907cf8f0a5cc85af04c0ce9ae57b4",
                "title": "Blue Origin planning next New Glenn flight for early next year",
                "source": "SpaceNews",
                "url": "https://spacenews.com/blue-origin-planning-next-new-glenn-flight-for-early-next-year/",
                "text": "After a successful second flight of New Glenn, includig landing the booster, Blue Origin is looking to perform its next launch early next year, possibly with the same booster. The post Blue Origin planning next New Glenn flight for early next year appeared first on SpaceNews",
                "timestamp": "2025-11-15T01:48:36+00:00"
            },
            {
                "id": "b8c3683c83c19f80d1a29f239e764612",
                "title": "New Glenn launches NASA’s ESCAPADE Mars mission, lands booster",
                "source": "SpaceNews",
                "url": "https://spacenews.com/new-glenn-launches-nasas-escapade-mars-mission-lands-booster/",
                "text": "Blue Origin successfully launched a NASA Mars mission on the second flight of its New Glenn booster Nov. 13, landing the vehicle’s first stage in the process. The post New Glenn launches NASA’s ESCAPADE Mars mission, lands booster appeared first on SpaceNews",
                "timestamp": "2025-11-13T21:38:41+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/blue-origin-planning-next-new-glenn-flight-for-early-next-year/",
            "https://spacenews.com/new-glenn-launches-nasas-escapade-mars-mission-lands-booster/"
        ],
        "rep_text": "After a successful second flight of New Glenn, includig landing the booster, Blue Origin is looking to perform its next launch early next year, possibly with the same booster. The post Blue Origin planning next New Glenn flight for early next year appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "4e8a8af71ca90e25970f9b0dc4186f24",
        "rep_id": "4e8a8af71ca90e25970f9b0dc4186f24",
        "member_ids": [
            "4e8a8af71ca90e25970f9b0dc4186f24"
        ],
        "rep_title": "SES adds to GEO’s busiest servicing pipeline with Infinite Orbits contract",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-14T21:47:22+00:00",
        "articles": [
            {
                "id": "4e8a8af71ca90e25970f9b0dc4186f24",
                "title": "SES adds to GEO’s busiest servicing pipeline with Infinite Orbits contract",
                "source": "SpaceNews",
                "url": "https://spacenews.com/ses-adds-to-geos-busiest-servicing-pipeline-with-infinite-orbits-contract/",
                "text": "SES is adding another servicer to what is already the broadest and busiest satellite life-extension roster in the commercial geostationary orbit market, with five missions now scheduled between 2026 and 2029. The post SES adds to GEO’s busiest servicing pipeline with Infinite Orbits contract appeared first on SpaceNews",
                "timestamp": "2025-11-14T21:47:22+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/ses-adds-to-geos-busiest-servicing-pipeline-with-infinite-orbits-contract/"
        ],
        "rep_text": "SES is adding another servicer to what is already the broadest and busiest satellite life-extension roster in the commercial geostationary orbit market, with five missions now scheduled between 2026 and 2029. The post SES adds to GEO’s busiest servicing pipeline with Infinite Orbits contract appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "e48c6576a19bc12e54f3490c87a5f20d",
        "rep_id": "e48c6576a19bc12e54f3490c87a5f20d",
        "member_ids": [
            "e48c6576a19bc12e54f3490c87a5f20d"
        ],
        "rep_title": "Maryland congressional delegation seeks information on Goddard facility closures",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-14T11:30:08+00:00",
        "articles": [
            {
                "id": "e48c6576a19bc12e54f3490c87a5f20d",
                "title": "Maryland congressional delegation seeks information on Goddard facility closures",
                "source": "SpaceNews",
                "url": "https://spacenews.com/maryland-congressional-delegation-seeks-information-on-goddard-facility-closures/",
                "text": "Members of Maryland’s congressional delegation added their voices to concerns about the closure of offices and labs at the Goddard Space Flight Center. The post Maryland congressional delegation seeks information on Goddard facility closures appeared first on SpaceNews",
                "timestamp": "2025-11-14T11:30:08+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/maryland-congressional-delegation-seeks-information-on-goddard-facility-closures/"
        ],
        "rep_text": "Members of Maryland’s congressional delegation added their voices to concerns about the closure of offices and labs at the Goddard Space Flight Center. The post Maryland congressional delegation seeks information on Goddard facility closures appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "b97276c28107f566e975c857e5b47024",
        "rep_id": "b97276c28107f566e975c857e5b47024",
        "member_ids": [
            "b97276c28107f566e975c857e5b47024"
        ],
        "rep_title": "Shenzhou-20 astronauts safely return to Earth on Shenzhou-21 spacecraft after space debris damage concerns",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-14T09:32:39+00:00",
        "articles": [
            {
                "id": "b97276c28107f566e975c857e5b47024",
                "title": "Shenzhou-20 astronauts safely return to Earth on Shenzhou-21 spacecraft after space debris damage concerns",
                "source": "SpaceNews",
                "url": "https://spacenews.com/shenzhou-20-astronauts-safely-return-to-earth-on-shenzhou-21-spacecraft-after-space-debris-damage-concerns/",
                "text": "Three Chinese astronauts have safely returned to Earth in the recently-launched Shenzhou-21 spacecraft after their own spacecraft was declared unsafe. The post Shenzhou-20 astronauts safely return to Earth on Shenzhou-21 spacecraft after space debris damage concerns appeared first on SpaceNews",
                "timestamp": "2025-11-14T09:32:39+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/shenzhou-20-astronauts-safely-return-to-earth-on-shenzhou-21-spacecraft-after-space-debris-damage-concerns/"
        ],
        "rep_text": "Three Chinese astronauts have safely returned to Earth in the recently-launched Shenzhou-21 spacecraft after their own spacecraft was declared unsafe. The post Shenzhou-20 astronauts safely return to Earth on Shenzhou-21 spacecraft after space debris damage concerns appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "b8fd3ae0d5c174d54dbce56bbcc01e3e",
        "rep_id": "b8fd3ae0d5c174d54dbce56bbcc01e3e",
        "member_ids": [
            "b8fd3ae0d5c174d54dbce56bbcc01e3e"
        ],
        "rep_title": "Virgin Galactic on track to begin commercial flights in 2026",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-14T08:41:11+00:00",
        "articles": [
            {
                "id": "b8fd3ae0d5c174d54dbce56bbcc01e3e",
                "title": "Virgin Galactic on track to begin commercial flights in 2026",
                "source": "SpaceNews",
                "url": "https://spacenews.com/virgin-galactic-on-track-to-begin-commercial-flights-in-2026/",
                "text": "Virgin Galactic says it remains on schedule to complete development of its next-generation suborbital spaceplane and begin commercial flights before the end of 2026. The post Virgin Galactic on track to begin commercial flights in 2026 appeared first on SpaceNews",
                "timestamp": "2025-11-14T08:41:11+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/virgin-galactic-on-track-to-begin-commercial-flights-in-2026/"
        ],
        "rep_text": "Virgin Galactic says it remains on schedule to complete development of its next-generation suborbital spaceplane and begin commercial flights before the end of 2026. The post Virgin Galactic on track to begin commercial flights in 2026 appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "359030f98793ed4262194620e525afe8",
        "rep_id": "359030f98793ed4262194620e525afe8",
        "member_ids": [
            "359030f98793ed4262194620e525afe8"
        ],
        "rep_title": "ULA launches Viasat’s second shot at a terabit-class broadband satellite",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-14T08:07:54+00:00",
        "articles": [
            {
                "id": "359030f98793ed4262194620e525afe8",
                "title": "ULA launches Viasat’s second shot at a terabit-class broadband satellite",
                "source": "SpaceNews",
                "url": "https://spacenews.com/ula-launches-viasats-second-shot-at-a-terabit-class-broadband-satellite/",
                "text": "An Atlas 5 rocket sent Viasat’s second ViaSat-3 satellite toward geostationary orbit Nov. 13, bringing the U.S. broadband provider closer to operating a terabit-per-second giant it had hoped to debut six years ago. The post ULA launches Viasat’s second shot at a terabit-class broadband satellite appeared first on SpaceNews",
                "timestamp": "2025-11-14T08:07:54+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/ula-launches-viasats-second-shot-at-a-terabit-class-broadband-satellite/"
        ],
        "rep_text": "An Atlas 5 rocket sent Viasat’s second ViaSat-3 satellite toward geostationary orbit Nov. 13, bringing the U.S. broadband provider closer to operating a terabit-per-second giant it had hoped to debut six years ago. The post ULA launches Viasat’s second shot at a terabit-class broadband satellite appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "7345870cc4da060aa5ead24432de729c",
        "rep_id": "7345870cc4da060aa5ead24432de729c",
        "member_ids": [
            "7345870cc4da060aa5ead24432de729c"
        ],
        "rep_title": "Canada’s SBQuantum wins contract to supply ESA magnetometer",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-14T04:00:00+00:00",
        "articles": [
            {
                "id": "7345870cc4da060aa5ead24432de729c",
                "title": "Canada’s SBQuantum wins contract to supply ESA magnetometer",
                "source": "SpaceNews",
                "url": "https://spacenews.com/canadas-sbquantum-wins-contract-to-supply-esa-magnetometer/",
                "text": "SAN FRANCISCO – Canada’s SBQuantum has won an €800,000 ($932,000) European Space Agency contract to deliver a prototype quantum magnetometer for space-based Earth observation. Under the 21-month contract, announced Nov. 14, SBQuantum will upgrade the quantum diamond magnetometer delivered to ESA for testing and evaluation in 2024. The new version of the sensor will be […] The post Canada’s SBQuantum wins contract to supply ESA magnetometer appeared first on SpaceNews",
                "timestamp": "2025-11-14T04:00:00+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/canadas-sbquantum-wins-contract-to-supply-esa-magnetometer/"
        ],
        "rep_text": "SAN FRANCISCO – Canada’s SBQuantum has won an €800,000 ($932,000) European Space Agency contract to deliver a prototype quantum magnetometer for space-based Earth observation. Under the 21-month contract, announced Nov. 14, SBQuantum will upgrade the quantum diamond magnetometer delivered to ESA for testing and evaluation in 2024. The new version of the sensor will be […] The post Canada’s SBQuantum wins contract to supply ESA magnetometer appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "1d4bb5c0d04d46c64e8b4884e7bfe307",
        "rep_id": "1d4bb5c0d04d46c64e8b4884e7bfe307",
        "member_ids": [
            "1d4bb5c0d04d46c64e8b4884e7bfe307"
        ],
        "rep_title": "Project Kuiper becomes Amazon Leo ahead of LEO broadband service debut",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T20:19:23+00:00",
        "articles": [
            {
                "id": "1d4bb5c0d04d46c64e8b4884e7bfe307",
                "title": "Project Kuiper becomes Amazon Leo ahead of LEO broadband service debut",
                "source": "SpaceNews",
                "url": "https://spacenews.com/project-kuiper-becomes-amazon-leo-ahead-of-leo-broadband-service-debut/",
                "text": "Project Kuiper has shed its seven-year-old code name, emerging as Amazon Leo Nov. 13 as the company nears the start of initial broadband services from the low Earth orbit constellation next year. The post Project Kuiper becomes Amazon Leo ahead of LEO broadband service debut appeared first on SpaceNews",
                "timestamp": "2025-11-13T20:19:23+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/project-kuiper-becomes-amazon-leo-ahead-of-leo-broadband-service-debut/"
        ],
        "rep_text": "Project Kuiper has shed its seven-year-old code name, emerging as Amazon Leo Nov. 13 as the company nears the start of initial broadband services from the low Earth orbit constellation next year. The post Project Kuiper becomes Amazon Leo ahead of LEO broadband service debut appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "42374388da1b6252781c5463c586cd11",
        "rep_id": "42374388da1b6252781c5463c586cd11",
        "member_ids": [
            "42374388da1b6252781c5463c586cd11"
        ],
        "rep_title": "Firefly deepens push into defense market after closing SciTec acquisition",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T16:35:41+00:00",
        "articles": [
            {
                "id": "42374388da1b6252781c5463c586cd11",
                "title": "Firefly deepens push into defense market after closing SciTec acquisition",
                "source": "SpaceNews",
                "url": "https://spacenews.com/firefly-deepens-push-into-defense-market-after-closing-scitec-acquisition/",
                "text": "On its third-quarter earnings call Nov. 12, Firefly executives highlighted the company’s alignment with the Pentagon’s planned “Golden Dome” missile defense initiative The post Firefly deepens push into defense market after closing SciTec acquisition appeared first on SpaceNews",
                "timestamp": "2025-11-13T16:35:41+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/firefly-deepens-push-into-defense-market-after-closing-scitec-acquisition/"
        ],
        "rep_text": "On its third-quarter earnings call Nov. 12, Firefly executives highlighted the company’s alignment with the Pentagon’s planned “Golden Dome” missile defense initiative The post Firefly deepens push into defense market after closing SciTec acquisition appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "16e82e7cddcf0e0e4a24099ad910a6d2",
        "rep_id": "16e82e7cddcf0e0e4a24099ad910a6d2",
        "member_ids": [
            "16e82e7cddcf0e0e4a24099ad910a6d2"
        ],
        "rep_title": "Countering China’s Space Silk Road: a U.S. partnership model for the Middle East",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T14:00:00+00:00",
        "articles": [
            {
                "id": "16e82e7cddcf0e0e4a24099ad910a6d2",
                "title": "Countering China’s Space Silk Road: a U.S. partnership model for the Middle East",
                "source": "SpaceNews",
                "url": "https://spacenews.com/countering-chinas-space-silk-road-a-u-s-partnership-model-for-the-middle-east/",
                "text": "The Middle East is no longer asking whether it should develop domestic space capabilities; it’s deciding with whom it will develop them. If the United States wants to be the country of choice ahead of China, it must create a joint space partnership agreement framework to align American and partner nations’ industry, government and financial […] The post Countering China’s Space Silk Road: a U.S. partnership model for the Middle East appeared first on SpaceNews",
                "timestamp": "2025-11-13T14:00:00+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/countering-chinas-space-silk-road-a-u-s-partnership-model-for-the-middle-east/"
        ],
        "rep_text": "The Middle East is no longer asking whether it should develop domestic space capabilities; it’s deciding with whom it will develop them. If the United States wants to be the country of choice ahead of China, it must create a joint space partnership agreement framework to align American and partner nations’ industry, government and financial […] The post Countering China’s Space Silk Road: a U.S. partnership model for the Middle East appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "d80336d4d5ceea94b7f24cfe7dec962e",
        "rep_id": "d80336d4d5ceea94b7f24cfe7dec962e",
        "member_ids": [
            "d80336d4d5ceea94b7f24cfe7dec962e"
        ],
        "rep_title": "Keeping America first in space",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T13:34:44+00:00",
        "articles": [
            {
                "id": "d80336d4d5ceea94b7f24cfe7dec962e",
                "title": "Keeping America first in space",
                "source": "SpaceNews",
                "url": "https://spacenews.com/keeping-america-first-in-space/",
                "text": "In this episode of Space Minds, host David Ariosto speaks with Jim Bridenstine, former NASA Administrator and U.S. Congressman, who oversaw the launch of the Artemis program—America’s renewed effort to return astronauts to the Moon. The post Keeping America first in space appeared first on SpaceNews",
                "timestamp": "2025-11-13T13:34:44+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/keeping-america-first-in-space/"
        ],
        "rep_text": "In this episode of Space Minds, host David Ariosto speaks with Jim Bridenstine, former NASA Administrator and U.S. Congressman, who oversaw the launch of the Artemis program—America’s renewed effort to return astronauts to the Moon. The post Keeping America first in space appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "b3fad7a3937d1effb1d82f491844bf88",
        "rep_id": "b3fad7a3937d1effb1d82f491844bf88",
        "member_ids": [
            "b3fad7a3937d1effb1d82f491844bf88"
        ],
        "rep_title": "Lux Aeterna nets US government partnerships for reusable satellite technology",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T12:05:00+00:00",
        "articles": [
            {
                "id": "b3fad7a3937d1effb1d82f491844bf88",
                "title": "Lux Aeterna nets US government partnerships for reusable satellite technology",
                "source": "SpaceNews",
                "url": "https://spacenews.com/lux-aeterna-nets-us-government-partnerships-for-reusable-satellite-technology/",
                "text": "Lux Aeterna is attracting growing interest from across the U.S. government for heat shield technology designed to make satellites fully reusable, securing two partnership agreements since emerging from stealth in June. The post Lux Aeterna nets US government partnerships for reusable satellite technology appeared first on SpaceNews",
                "timestamp": "2025-11-13T12:05:00+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/lux-aeterna-nets-us-government-partnerships-for-reusable-satellite-technology/"
        ],
        "rep_text": "Lux Aeterna is attracting growing interest from across the U.S. government for heat shield technology designed to make satellites fully reusable, securing two partnership agreements since emerging from stealth in June. The post Lux Aeterna nets US government partnerships for reusable satellite technology appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "7b555d92d5b776476d7242d4765be128",
        "rep_id": "7b555d92d5b776476d7242d4765be128",
        "member_ids": [
            "7b555d92d5b776476d7242d4765be128"
        ],
        "rep_title": "‘Uncontrolled experiment:’ Study links harmful atmospheric metals to spacecraft reentry",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T12:00:00+00:00",
        "articles": [
            {
                "id": "7b555d92d5b776476d7242d4765be128",
                "title": "‘Uncontrolled experiment:’ Study links harmful atmospheric metals to spacecraft reentry",
                "source": "SpaceNews",
                "url": "https://spacenews.com/uncontrolled-experiment-study-links-harmful-atmospheric-metals-to-spacecraft-reentry/",
                "text": "GOLDEN, CO — The surge in megasatellite constellations is creating problems beyond amplifying the Earth-circling space debris, according to new research. Reentering spacecraft and rocket stages may also be damaging Earth’s atmosphere, as well as increasing the risk of space waste hitting the Earth. New research posted to the preprint database ArXiv finds that “space […] The post ‘Uncontrolled experiment:’ Study links harmful atmospheric metals to spacecraft reentry appeared first on SpaceNews",
                "timestamp": "2025-11-13T12:00:00+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/uncontrolled-experiment-study-links-harmful-atmospheric-metals-to-spacecraft-reentry/"
        ],
        "rep_text": "GOLDEN, CO — The surge in megasatellite constellations is creating problems beyond amplifying the Earth-circling space debris, according to new research. Reentering spacecraft and rocket stages may also be damaging Earth’s atmosphere, as well as increasing the risk of space waste hitting the Earth. New research posted to the preprint database ArXiv finds that “space […] The post ‘Uncontrolled experiment:’ Study links harmful atmospheric metals to spacecraft reentry appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "6d15cc8d70d1d30abee13a36ec36a0af",
        "rep_id": "6d15cc8d70d1d30abee13a36ec36a0af",
        "member_ids": [
            "6d15cc8d70d1d30abee13a36ec36a0af"
        ],
        "rep_title": "Ground truth: Why the lunar program needs its Earthbound network",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T11:00:00+00:00",
        "articles": [
            {
                "id": "6d15cc8d70d1d30abee13a36ec36a0af",
                "title": "Ground truth: Why the lunar program needs its Earthbound network",
                "source": "SpaceNews",
                "url": "https://spacenews.com/ground-truth-why-the-lunar-program-needs-its-earthbound-network/",
                "text": "As the world prepares to return to the moon, much of the attention remains fixed on the visible frontier: the rockets, landers and orbital stations that will make it possible. Yet the success of this new era in exploration depends on something far less visible — the communications infrastructure that keeps those missions alive once […] The post Ground truth: Why the lunar program needs its Earthbound network appeared first on SpaceNews",
                "timestamp": "2025-11-13T11:00:00+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/ground-truth-why-the-lunar-program-needs-its-earthbound-network/"
        ],
        "rep_text": "As the world prepares to return to the moon, much of the attention remains fixed on the visible frontier: the rockets, landers and orbital stations that will make it possible. Yet the success of this new era in exploration depends on something far less visible — the communications infrastructure that keeps those missions alive once […] The post Ground truth: Why the lunar program needs its Earthbound network appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "56fdb3c6d032b8a70f37bb71cb3dff8b",
        "rep_id": "56fdb3c6d032b8a70f37bb71cb3dff8b",
        "member_ids": [
            "56fdb3c6d032b8a70f37bb71cb3dff8b"
        ],
        "rep_title": "SES expands launch contract with Relativity Space",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T10:25:42+00:00",
        "articles": [
            {
                "id": "56fdb3c6d032b8a70f37bb71cb3dff8b",
                "title": "SES expands launch contract with Relativity Space",
                "source": "SpaceNews",
                "url": "https://spacenews.com/ses-expands-launch-contract-with-relativity-space/",
                "text": "Relativity Space, a launch startup developing a reusable rocket, has expanded a contract to provide launches for satellite operator SES. The post SES expands launch contract with Relativity Space appeared first on SpaceNews",
                "timestamp": "2025-11-13T10:25:42+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/ses-expands-launch-contract-with-relativity-space/"
        ],
        "rep_text": "Relativity Space, a launch startup developing a reusable rocket, has expanded a contract to provide launches for satellite operator SES. The post SES expands launch contract with Relativity Space appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "7bb430f26543d5021d3b3b3f00b1abee",
        "rep_id": "7bb430f26543d5021d3b3b3f00b1abee",
        "member_ids": [
            "7bb430f26543d5021d3b3b3f00b1abee"
        ],
        "rep_title": "Firefly identifies cause of Alpha booster test failure",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T00:01:20+00:00",
        "articles": [
            {
                "id": "7bb430f26543d5021d3b3b3f00b1abee",
                "title": "Firefly identifies cause of Alpha booster test failure",
                "source": "SpaceNews",
                "url": "https://spacenews.com/firefly-identifies-cause-of-alpha-booster-test-failure/",
                "text": "Firefly Aerospace says contamination in a fluid line caused the loss in September of an Alpha first stage being tested for an upcoming launch. The post Firefly identifies cause of Alpha booster test failure appeared first on SpaceNews",
                "timestamp": "2025-11-13T00:01:20+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/firefly-identifies-cause-of-alpha-booster-test-failure/"
        ],
        "rep_text": "Firefly Aerospace says contamination in a fluid line caused the loss in September of an Alpha first stage being tested for an upcoming launch. The post Firefly identifies cause of Alpha booster test failure appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "faa9961f65300ac3e30948a8eaa6493a",
        "rep_id": "faa9961f65300ac3e30948a8eaa6493a",
        "member_ids": [
            "faa9961f65300ac3e30948a8eaa6493a"
        ],
        "rep_title": "Airspace closure suggests China is preparing for a Shenzhou landing after debris impact scare",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-12T22:38:47+00:00",
        "articles": [
            {
                "id": "faa9961f65300ac3e30948a8eaa6493a",
                "title": "Airspace closure suggests China is preparing for a Shenzhou landing after debris impact scare",
                "source": "SpaceNews",
                "url": "https://spacenews.com/airspace-closure-suggests-china-is-preparing-for-a-shenzhou-landing-after-debris-impact-scare/",
                "text": "China issued an airspace closure notice, suggesting preparations for a spacecraft landing days after a suspected debris strike delayed the planned return of Shenzhou-20. The post Airspace closure suggests China is preparing for a Shenzhou landing after debris impact scare appeared first on SpaceNews",
                "timestamp": "2025-11-12T22:38:47+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/airspace-closure-suggests-china-is-preparing-for-a-shenzhou-landing-after-debris-impact-scare/"
        ],
        "rep_text": "China issued an airspace closure notice, suggesting preparations for a spacecraft landing days after a suspected debris strike delayed the planned return of Shenzhou-20. The post Airspace closure suggests China is preparing for a Shenzhou landing after debris impact scare appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "86ecc570e3a5be2108cea6c2b0a05d0e",
        "rep_id": "86ecc570e3a5be2108cea6c2b0a05d0e",
        "member_ids": [
            "86ecc570e3a5be2108cea6c2b0a05d0e"
        ],
        "rep_title": "Live Event: The Role of Space-Based Interceptors in Golden Dome (Replay)",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-12T19:57:42+00:00",
        "articles": [
            {
                "id": "86ecc570e3a5be2108cea6c2b0a05d0e",
                "title": "Live Event: The Role of Space-Based Interceptors in Golden Dome (Replay)",
                "source": "SpaceNews",
                "url": "https://spacenews.com/live-event-the-role-of-space-based-interceptors-in-golden-dome/",
                "text": "From inflationary pressures and shifting interest rates to supply chain challenges and intensifying great-power competition, today’s macroeconomic and geopolitical forces are reshaping the future of space investment. For investors and businesses, navigating this environment means balancing capital market dynamics, technology cycles, and an increasingly complex landscape of export controls, trade restrictions, and government influence. The post Live Event: The Role of Space-Based Interceptors in Golden Dome (Replay) appeared first on SpaceNews",
                "timestamp": "2025-11-12T19:57:42+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/live-event-the-role-of-space-based-interceptors-in-golden-dome/"
        ],
        "rep_text": "From inflationary pressures and shifting interest rates to supply chain challenges and intensifying great-power competition, today’s macroeconomic and geopolitical forces are reshaping the future of space investment. For investors and businesses, navigating this environment means balancing capital market dynamics, technology cycles, and an increasingly complex landscape of export controls, trade restrictions, and government influence. The post Live Event: The Role of Space-Based Interceptors in Golden Dome (Replay) appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "486424cb40e8d61766787e07302358d1",
        "rep_id": "486424cb40e8d61766787e07302358d1",
        "member_ids": [
            "486424cb40e8d61766787e07302358d1"
        ],
        "rep_title": "French startup U-Space raises €24 million for smallsat manufacting",
        "sources": [
            "SpaceNews"
        ],
        "timestamp": "2025-11-12T17:21:39+00:00",
        "articles": [
            {
                "id": "486424cb40e8d61766787e07302358d1",
                "title": "French startup U-Space raises €24 million for smallsat manufacting",
                "source": "SpaceNews",
                "url": "https://spacenews.com/french-startup-u-space-raises-24-million-for-smallsat-manufacting/",
                "text": "SAN FRANCISCO – French startup U-Space has raised €24 million ($27.8 million) to expand its role in the small satellite constellation market. With funding from the Series A round, Toulouse-based […] The post French startup U-Space raises €24 million for smallsat manufacting appeared first on SpaceNews",
                "timestamp": "2025-11-12T17:21:39+00:00"
            }
        ],
        "urls": [
            "https://spacenews.com/french-startup-u-space-raises-24-million-for-smallsat-manufacting/"
        ],
        "rep_text": "SAN FRANCISCO – French startup U-Space has raised €24 million ($27.8 million) to expand its role in the small satellite constellation market. With funding from the Series A round, Toulouse-based […] The post French startup U-Space raises €24 million for smallsat manufacting appeared first on SpaceNews",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "802d9716114cca20c83dbfd0916bc11f",
        "rep_id": "802d9716114cca20c83dbfd0916bc11f",
        "member_ids": [
            "802d9716114cca20c83dbfd0916bc11f",
            "a381490a22493b9bb174878c9c1d0bed"
        ],
        "rep_title": "SpaceX completes second fastest turnaround between Falcon 9 launches from Cape Canaveral",
        "sources": [
            "SpaceflightNow",
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-14T23:35:50+00:00",
        "articles": [
            {
                "id": "802d9716114cca20c83dbfd0916bc11f",
                "title": "SpaceX completes second fastest turnaround between Falcon 9 launches from Cape Canaveral",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/14/live-coverage-spacex-to-launch-predawn-starlink-mission-from-cape-canaveral/",
                "text": "A SpaceX Falcon 9 rocket lifts off from Space Launch Complex 39A (LC-39A) at Cape Canaveral Space Force Station to begin the Starlink 6-85 mission on Nov. 15, 2025. Image: Adam Bernstein / Spaceflight Now Update Nov. 15, 2:24 a.m. EST (0724 UTC): SpaceX landed its first stage booster. SpaceX kicked off the weekend with a pair of Falcon 9 launches. With both flights depart Florida’s Space Coast at about three hours and 35 minutes of each other, this was the second shortest turnaround from Cape-based flights for SpaceX. The Starlink 6-85 mission was the second scheduled to fly, departing from pad 40 at Cape Canaveral Space Force Station at 1:44 a.m. EST (0644 UTC). The Starlink 6-89 mission launched from pad 39A at NASA’s Kennedy Space Center at 10:08 p.m. EST (0308 UTC). Each mission carried 29 Starlink V2 Mini satellites on board. ﻿ Given the proximity of the two missions, the 45th Weather Squadron issued identical forecasts for both missions, citing a greater than 95 percent chance for favorable weather at liftoff. After a few days of notable solar activity, launch weather officers dropped the potential for solar impacts down to a moderate risk on a low-moderate-high scale. The Starlink 6-85 mission launched with the Falcon 9 booster with the tail number B1078, which flew for a 24th time. Its previous missions included Crew-6, USSF-124 and AST SpaceMobile’s BlueBird 1-5. About 8.5 minutes after liftoff, B1078 performed an autonomous landing on the drone ship, ‘Just Read the Instructions’, which was positioned in the Atlantic Ocean to the east of The Bahamas. With the pair of Starlink missions, SpaceX now has nearly 9,000 of its satellites in low Earth orbit.",
                "timestamp": "2025-11-14T23:35:50+00:00"
            },
            {
                "id": "a381490a22493b9bb174878c9c1d0bed",
                "title": "SpaceX launches 29 Starlink satellites on Falcon 9 rocket from NASA’s Kennedy Space Center",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/14/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-nasas-kennedy-space-center-2/",
                "text": "A SpaceX Falcon 9 rocket lifts off from Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center to begin the Starlink 6-89 mission on Nov. 14, 2025. Image: Adam Bernstein / Spaceflight Now Update Nov. 14, 11:40 p.m. EST (0440 UTC) SpaceX headed into the weekend with a pair of launches planned for Florida’s Space Coast with both supporting the company’s Starlink broadband satellite internet constellation. First up to bat was Starlink 6-89, which flew from Launch Complex 39A at NASA’s Kennedy Space Center. Liftoff happened at 10:08 p.m. EST (0308 UTC) with the rocket flying on a south-easterly trajectory. ﻿ With both this and the second mission, Starlink 6-85 , scheduled to launch within the same four-hour window of opportunity, the 45th Weather Squadron issued identical forecasts for both missions, citing a greater than 95 percent chance for favorable weather at liftoff. After a few days of notable solar activity, launch weather officers dropped the potential for solar impacts down to a moderate risk on a low-moderate-high scale. The Starlink 6-89 mission used the Falcon 9 booster with the tail number B1092, which flew for an eighth time. Its previous missions include CRS-32, GPS III SV08 and NROL-69. About 8.5 minutes after liftoff, B1092 performed a landing on the drone ship, ‘A Shortfall of Gravitas’, positioned out in the Atlantic Ocean to the east of The Bahamas. This was the 132nd landing on this vessel and the 533rd booster landing to date for SpaceX.",
                "timestamp": "2025-11-14T23:17:07+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/14/live-coverage-spacex-to-launch-predawn-starlink-mission-from-cape-canaveral/",
            "https://spaceflightnow.com/2025/11/14/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-nasas-kennedy-space-center-2/"
        ],
        "rep_text": "A SpaceX Falcon 9 rocket lifts off from Space Launch Complex 39A (LC-39A) at Cape Canaveral Space Force Station to begin the Starlink 6-85 mission on Nov. 15, 2025. Image: Adam Bernstein / Spaceflight Now Update Nov. 15, 2:24 a.m. EST (0724 UTC): SpaceX landed its first stage booster. SpaceX kicked off the weekend with a pair of Falcon 9 launches. With both flights depart Florida’s Space Coast at about three hours and 35 minutes of each other, this was the second shortest turnaround from Cape-based flights for SpaceX. The Starlink 6-85 mission was the second scheduled to fly, departing from pad 40 at Cape Canaveral Space Force Station at 1:44 a.m. EST (0644 UTC). The Starlink 6-89 mission launched from pad 39A at NASA’s Kennedy Space Center at 10:08 p.m. EST (0308 UTC). Each mission carried 29 Starlink V2 Mini satellites on board. ﻿ Given the proximity of the two missions, the 45th Weather Squadron issued identical forecasts for both missions, citing a greater than 95 percent chance for favorable weather at liftoff. After a few days of notable solar activity, launch weather officers dropped the potential for solar impacts down to a moderate risk on a low-moderate-high scale. The Starlink 6-85 mission launched with the Falcon 9 booster with the tail number B1078, which flew for a 24th time. Its previous missions included Crew-6, USSF-124 and AST SpaceMobile’s BlueBird 1-5. About 8.5 minutes after liftoff, B1078 performed an autonomous landing on the drone ship, ‘Just Read the Instructions’, which was positioned in the Atlantic Ocean to the east of The Bahamas. With the pair of Starlink missions, SpaceX now has nearly 9,000 of its satellites in low Earth orbit.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "cdc6c39e4338659605c48826af697fca",
        "rep_id": "cdc6c39e4338659605c48826af697fca",
        "member_ids": [
            "cdc6c39e4338659605c48826af697fca",
            "b8c3683c83c19f80d1a29f239e764612"
        ],
        "rep_title": "Blue Origin launches twin Mars probes for NASA as New Glenn makes first landing",
        "sources": [
            "SpaceflightNow",
            "SpaceNews"
        ],
        "timestamp": "2025-11-13T22:39:00+00:00",
        "articles": [
            {
                "id": "cdc6c39e4338659605c48826af697fca",
                "title": "Blue Origin launches twin Mars probes for NASA as New Glenn makes first landing",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/13/blue-origin-launches-twin-mars-probes-for-nasa-as-new-glenn-makes-first-landing/",
                "text": "New Glenn lifts off from Launch Complex 36 at Cape Canaveral, carrying twin Mars probes for NASA. Image: Michael Cain/Spaceflight Now. Blue Origin launched its second heavy-lift New Glenn rocket Thursday, putting two small NASA satellites onto a long, looping course to Mars to learn more about how the sun has slowly blown away the red planet’s once thick atmosphere. The centerpiece of Amazon- and Blue Origin-founder Jeff Bezos’ space ambitious, the towering 321-foot tall New Glenn rocket’s seven methane-burning main engines ignited at 3:55 p.m. EST, majestically pushing the booster skyward atop 3.8 million pounds of thrust. The launching came four days late due to stormy weather on Earth and in space where a powerful solar storm buffeted the upper atmosphere with a torrent of high-energy radiation that could have caused electrical problems with the rocket or its payloads. The storm had abated by launch time Thursday and Blue Origin employees, looking on from viewing sites several miles from the Cape Canaveral Space Force Station launch pad, cheered and applauded as the booster climbed skyward, followed moments later by the booming roar of its engines sweeping across the Space Coast. The New Glenn first stage standing on the deck of Blue Origin’s recovery vessel Jacklyn. Image: Blue Origin. The New Glenn’s maiden flight last January successfully boosted a Blue Origin payload into orbit, but the reusable first stage failed in its attempt to reach an off-shore landing ship, named after Bezos’ mother Jacklyn. The 188-foot-tall first stage launched Thursday, nicknamed “Never Tell Me The Odds,” featured a variety of upgrades to improve performance. As with SpaceX booster landings, the New Glenn stage fired three engines to slow down for re-entry, then restarted the engines just before touchdown, followed by landing on the power of a single engine. This time around, the booster made an on-target, picture-perfect landing, prompting another round of raucous cheers and applause from Blue Origin workers. Much like returning SpaceX Falcon 9 rockets, the larger New Glenn booster will be hauled back to Port Canaveral and, depending on its condition, be refurbished and readied for use on an upcoming New Glenn flight. New Glenn thunders away from its launch pad in near perfect weather conditions. Image: Adam Bernstein/Spaceflight Now. The second stage, meanwhile, pressed ahead, carrying out two firings of its twin engines to reach the planned Earth-escape trajectory. Thirty-three minutes after liftoff, the ESCAPADE satellites were released to fly on their own. The NASA-sponsored payload, managed by the UC-Berkeley Space Sciences Laboratory, is made up of two small, low-budget satellites known as Blue and Gold that make up the heart of the ESCAPADE mission. The acronym stands for Escape, Plasma Acceleration and Dynamics Explorers. The probes were built for UC-Berkeley by Rocketlab under a NASA program intended to develop lower-cost, fast-track planetary missions. ESCAPADE cost $107.4 million, a bargain compared to the cost of more traditional, more sophisticated planetary spacecraft that can cost hundreds of millions to well over a billion dollars each. New Glenn soars above a cruise ship departing Port Canaveral. Image: John Pisani/Spaceflight Now. The ESCAPADE probes were originally expected to hitch a ride to Mars a few years ago with NASA’s Psyche asteroid probe. But for a variety of reasons, the Mars satellites mission ultimately ended up on New Glenn’s second flight. Mars launch windows typically open every two years when Earth and the red planet reach favorable positions in their orbits to permit direct flights using current rockets. The next such window opens in 2026. To make Wednesday’s New Glenn launch work in 2025, mission planners with Advanced Space LLC came up with an innovative flight plan, one that will take Blue and Gold longer to reach Mars but will enable more flexible trajectories for future missions. The probes were deployed on a trajectory that will carry them a million miles out, well past the moon’s orbit, where they will loiter for the next 11 months before heading back toward Earth. Passing within 600 miles of Earth in November 2027, the ESCAPADE probes will make velocity-boosting gravity assist flybys, augmented by on-board propulsion, to finally head for Mars. In all, the twin spacecraft will spend a full year in that initial kidney bean-shaped orbit out past the moon and back and another 10 months in transit to Mars. The probes won’t reach the red planet until September 2027. “We are using a very flexible … approach where we go into a loiter orbit around Earth in order to sort of wait until Earth and Mars are lined up correctly in November of next year to go to Mars,” said Robert Lillis, the principal investigator. “This is an exciting, flexible way to get to Mars because in the future … we could potentially queue up spacecraft using the approach that ESCAPADE is pioneering” without having to wait for a planetary launch window to open. While the ESCAPADE mission is modest compared to Mars rovers and more sophisticated orbiters, the probes are designed to answer key questions about the evolution of the martian atmosphere. Mars once had a global magnetic field like Earth, but its molten core, which powered that field, mostly froze in place long ago leaving only patchy, isolated remnants of that once-protective field in magnetized deposits. Without a protective global field like Earth’s, the martian atmosphere faces a constant barrage of high-speed electrons and protons blown away from the sun and from dense clouds of charged particles erupting from powerful solar storms. Working in tandem, first in the same orbit at different distances from each other and then from different altitudes, Blue and Gold will measure how the solar wind and energetic electrons and protons from solar storms interact with the martian atmosphere. Data from earlier Mars satellites showed the planet’s atmosphere is constantly being stripped by those interactions, but exactly how that happens over time is not fully understood. “We really, really want to understand the interaction of the solar wind with Mars better than we do now,” Lillis said. “We know that atmospheric escape from Mars is a major driver for the evolution of the Martian climate. “We know that Mars at least was episodically warm and wet for a couple billion years, but hasn’t been so for about two billion years or so. And we think atmospheric escape is a major reason for that.” Blue and Gold will provide what amounts to a stereo view of those processes. “If you only have one spacecraft, you can either measure what the sun is throwing at Mars, the so-called space weather environment upstream of Mars, or you can measure the conditions close to Mars in its upper atmosphere, where the atmosphere is escaping,” Lillis said. “You can’t be in two places at once. But we can, because we have two spacecraft to do this. So we can really get that cause-and-effect at the same time. We’ve never had that before, and that’s really exciting.”",
                "timestamp": "2025-11-13T22:39:00+00:00"
            },
            {
                "id": "b8c3683c83c19f80d1a29f239e764612",
                "title": "New Glenn launches NASA’s ESCAPADE Mars mission, lands booster",
                "source": "SpaceNews",
                "url": "https://spacenews.com/new-glenn-launches-nasas-escapade-mars-mission-lands-booster/",
                "text": "Blue Origin successfully launched a NASA Mars mission on the second flight of its New Glenn booster Nov. 13, landing the vehicle’s first stage in the process. The post New Glenn launches NASA’s ESCAPADE Mars mission, lands booster appeared first on SpaceNews",
                "timestamp": "2025-11-13T21:38:41+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/13/blue-origin-launches-twin-mars-probes-for-nasa-as-new-glenn-makes-first-landing/",
            "https://spacenews.com/new-glenn-launches-nasas-escapade-mars-mission-lands-booster/"
        ],
        "rep_text": "New Glenn lifts off from Launch Complex 36 at Cape Canaveral, carrying twin Mars probes for NASA. Image: Michael Cain/Spaceflight Now. Blue Origin launched its second heavy-lift New Glenn rocket Thursday, putting two small NASA satellites onto a long, looping course to Mars to learn more about how the sun has slowly blown away the red planet’s once thick atmosphere. The centerpiece of Amazon- and Blue Origin-founder Jeff Bezos’ space ambitious, the towering 321-foot tall New Glenn rocket’s seven methane-burning main engines ignited at 3:55 p.m. EST, majestically pushing the booster skyward atop 3.8 million pounds of thrust. The launching came four days late due to stormy weather on Earth and in space where a powerful solar storm buffeted the upper atmosphere with a torrent of high-energy radiation that could have caused electrical problems with the rocket or its payloads. The storm had abated by launch time Thursday and Blue Origin employees, looking on from viewing sites several miles from the Cape Canaveral Space Force Station launch pad, cheered and applauded as the booster climbed skyward, followed moments later by the booming roar of its engines sweeping across the Space Coast. The New Glenn first stage standing on the deck of Blue Origin’s recovery vessel Jacklyn. Image: Blue Origin. The New Glenn’s maiden flight last January successfully boosted a Blue Origin payload into orbit, but the reusable first stage failed in its attempt to reach an off-shore landing ship, named after Bezos’ mother Jacklyn. The 188-foot-tall first stage launched Thursday, nicknamed “Never Tell Me The Odds,” featured a variety of upgrades to improve performance. As with SpaceX booster landings, the New Glenn stage fired three engines to slow down for re-entry, then restarted the engines just before touchdown, followed by landing on the power of a single engine. This time around, the booster made an on-target, picture-perfect landing, prompting another round of raucous cheers and applause from Blue Origin workers. Much like returning SpaceX Falcon 9 rockets, the larger New Glenn booster will be hauled back to Port Canaveral and, depending on its condition, be refurbished and readied for use on an upcoming New Glenn flight. New Glenn thunders away from its launch pad in near perfect weather conditions. Image: Adam Bernstein/Spaceflight Now. The second stage, meanwhile, pressed ahead, carrying out two firings of its twin engines to reach the planned Earth-escape trajectory. Thirty-three minutes after liftoff, the ESCAPADE satellites were released to fly on their own. The NASA-sponsored payload, managed by the UC-Berkeley Space Sciences Laboratory, is made up of two small, low-budget satellites known as Blue and Gold that make up the heart of the ESCAPADE mission. The acronym stands for Escape, Plasma Acceleration and Dynamics Explorers. The probes were built for UC-Berkeley by Rocketlab under a NASA program intended to develop lower-cost, fast-track planetary missions. ESCAPADE cost $107.4 million, a bargain compared to the cost of more traditional, more sophisticated planetary spacecraft that can cost hundreds of millions to well over a billion dollars each. New Glenn soars above a cruise ship departing Port Canaveral. Image: John Pisani/Spaceflight Now. The ESCAPADE probes were originally expected to hitch a ride to Mars a few years ago with NASA’s Psyche asteroid probe. But for a variety of reasons, the Mars satellites mission ultimately ended up on New Glenn’s second flight. Mars launch windows typically open every two years when Earth and the red planet reach favorable positions in their orbits to permit direct flights using current rockets. The next such window opens in 2026. To make Wednesday’s New Glenn launch work in 2025, mission planners with Advanced Space LLC came up with an innovative flight plan, one that will take Blue and Gold longer to reach Mars but will enable more flexible trajectories for future missions. The probes were deployed on a trajectory that will carry them a million miles out, well past the moon’s orbit, where they will loiter for the next 11 months before heading back toward Earth. Passing within 600 miles of Earth in November 2027, the ESCAPADE probes will make velocity-boosting gravity assist flybys, augmented by on-board propulsion, to finally head for Mars. In all, the twin spacecraft will spend a full year in that initial kidney bean-shaped orbit out past the moon and back and another 10 months in transit to Mars. The probes won’t reach the red planet until September 2027. “We are using a very flexible … approach where we go into a loiter orbit around Earth in order to sort of wait until Earth and Mars are lined up correctly in November of next year to go to Mars,” said Robert Lillis, the principal investigator. “This is an exciting, flexible way to get to Mars because in the future … we could potentially queue up spacecraft using the approach that ESCAPADE is pioneering” without having to wait for a planetary launch window to open. While the ESCAPADE mission is modest compared to Mars rovers and more sophisticated orbiters, the probes are designed to answer key questions about the evolution of the martian atmosphere. Mars once had a global magnetic field like Earth, but its molten core, which powered that field, mostly froze in place long ago leaving only patchy, isolated remnants of that once-protective field in magnetized deposits. Without a protective global field like Earth’s, the martian atmosphere faces a constant barrage of high-speed electrons and protons blown away from the sun and from dense clouds of charged particles erupting from powerful solar storms. Working in tandem, first in the same orbit at different distances from each other and then from different altitudes, Blue and Gold will measure how the solar wind and energetic electrons and protons from solar storms interact with the martian atmosphere. Data from earlier Mars satellites showed the planet’s atmosphere is constantly being stripped by those interactions, but exactly how that happens over time is not fully understood. “We really, really want to understand the interaction of the solar wind with Mars better than we do now,” Lillis said. “We know that atmospheric escape from Mars is a major driver for the evolution of the Martian climate. “We know that Mars at least was episodically warm and wet for a couple billion years, but hasn’t been so for about two billion years or so. And we think atmospheric escape is a major reason for that.” Blue and Gold will provide what amounts to a stereo view of those processes. “If you only have one spacecraft, you can either measure what the sun is throwing at Mars, the so-called space weather environment upstream of Mars, or you can measure the conditions close to Mars in its upper atmosphere, where the atmosphere is escaping,” Lillis said. “You can’t be in two places at once. But we can, because we have two spacecraft to do this. So we can really get that cause-and-effect at the same time. We’ve never had that before, and that’s really exciting.”",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "2704107f520411f23373c95f7a12ed40",
        "rep_id": "2704107f520411f23373c95f7a12ed40",
        "member_ids": [
            "2704107f520411f23373c95f7a12ed40"
        ],
        "rep_title": "ULA launches ViaSat-3 following valve replacement on Atlas 5 rocket",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-13T13:37:48+00:00",
        "articles": [
            {
                "id": "2704107f520411f23373c95f7a12ed40",
                "title": "ULA launches ViaSat-3 following valve replacement on Atlas 5 rocket",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/13/live-coverage-ula-to-launch-viasat-3-following-valve-replacement-on-atlas-5-rocket/",
                "text": "A United Launch Alliance Atlas 5 551 rocket lifts off from Space Launch Complex 41 (SLC-41) at Cape Canaveral Space Force Station to begin the ViaSat-3 F2 mission for Viasat. Image: Adam Bernstein / Spaceflight Now Update Nov. 13, 11 p.m. EST (0400 UTC): ULA launched its Atlas 5 rocket and completed the first two out of three upper stage engine burns. United Launch Alliance launched its Atlas 5 rocket Thursday night, which carried a communications satellite for California-based communications company, Viasat. The launch came a week after the mission was scrubbed due to a faulty liquid oxygen tank vent valve on the Atlas booster. ULA rolled the rocket back to the Vertical Integration Facility about third of a mile away, replaced it with a new valve and returned the rocket to the pad on Nov. 12. The 6-metric-ton satellite will be launched to a geosynchronous transfer orbit, deploying nearly 3.5 hours after the rocket lifts off from Cape Canaveral Space Force Station. Liftoff from Space Launch Complex 41 happened at 10:04 p.m. EST (0304 UTC), the opening of a 44-minute-long window. The rocket headed due east upon leaving Florida’s Space Coast. ﻿ ULA launched this mission using an Atlas 5 rocket in its 551 configuration. The 196-foot-tall (59.7 meters) rocket was supported by five solid rocket boosters, which combined with the RD-180 main engine to produce about 2.7 million pounds (12 megaNewtons) of thrust at liftoff. The SRBs jettisoned less than two minutes into the flight, followed by the payload fairings about a minute and a half later. It will take three separate firings of the RL10C-1-1 engine on the Centaur 3 upper stage to reach the correct orbit to release the ViaSat-3 F2 satellite. Following release, the upper stage will be placed in a so-called graveyard orbit nearly an hour later. This rocket had the designation of AV-100 and was the 105th Atlas V rocket launched to date. Following this launch, ULA now has 11 of these rockets remaining before it is officially retired: 6 – Boeing’s CST-100 Starliner 5 – Amazon’s Project Kuiper A United Launch Alliance Atlas 5 551 rocket lifts off from Space Launch Complex 41 (SLC-41) at Cape Canaveral Space Force Station to begin the ViaSat-3 F2 mission for Viasat. Image: John Pisani / Spaceflight Now What’s onboard? This was the second satellite in the ViaSat-3 series that will operate in geostationary Earth orbit, following the launch of the first spacecraft in 2023. After the ViaSat-3 F1 satellite launched on a SpaceX Falcon Heavy rocket, it suffered an issue with its antenna, which both delayed the start of service and resulted in a reduced capacity. Viasat officials said ahead of the launch that this new satellite will provide needed Ka-band network capabilities, adding more than 1 terabits per second (Tbps) of capacity to the network over the Americas. Following a months of on-orbit testing at its operating slog of 79 degrees West longitude, the ViaSat-3 F2 spacecraft is expected to enter service in early 2026. The ViaSat-3 F2 satellite is moved within the Astrotech Space Operations facility in Titusville, Florida, where it was encapsulated in payload fairings for United Launch Alliance’s Atlas 5 rocket. Image: Viasat “Beyond an incredible capacity increase, ViaSat-3 F2’s dynamic beam forming capabilities will greatly benefit our customers by efficiently deploying bandwidth to the highest demand places, allowing us to scale performance and the number and density of users,” said Mark Dankberg, Chairman and CEO of Viasat, in a statement. “These capabilities will continue to fuel our successful, multi-orbit service offerings, including service platforms such as Viasat Amara, NexusWave, and a resilient, hybrid SATCOM architecture for government.” The satellite is built on Boeing’s 702MP+ platform, which uses electric propulsion and solar arrays, the latter of which is from Boeing subsidiary, Spectrolab. Boeing is supporting Viasat in both launch operations and post-deployment checkouts. “Our goal is to enable missions with reliability and timely delivery,” said Michelle Parker, Vice President of Boeing Space Mission Systems. “With ViaSat‑3 F2, we leveraged proven 702 heritage, advanced power systems and all‑electric propulsion to enable high-speed connectivity for users who rely on it.”",
                "timestamp": "2025-11-13T13:37:48+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/13/live-coverage-ula-to-launch-viasat-3-following-valve-replacement-on-atlas-5-rocket/"
        ],
        "rep_text": "A United Launch Alliance Atlas 5 551 rocket lifts off from Space Launch Complex 41 (SLC-41) at Cape Canaveral Space Force Station to begin the ViaSat-3 F2 mission for Viasat. Image: Adam Bernstein / Spaceflight Now Update Nov. 13, 11 p.m. EST (0400 UTC): ULA launched its Atlas 5 rocket and completed the first two out of three upper stage engine burns. United Launch Alliance launched its Atlas 5 rocket Thursday night, which carried a communications satellite for California-based communications company, Viasat. The launch came a week after the mission was scrubbed due to a faulty liquid oxygen tank vent valve on the Atlas booster. ULA rolled the rocket back to the Vertical Integration Facility about third of a mile away, replaced it with a new valve and returned the rocket to the pad on Nov. 12. The 6-metric-ton satellite will be launched to a geosynchronous transfer orbit, deploying nearly 3.5 hours after the rocket lifts off from Cape Canaveral Space Force Station. Liftoff from Space Launch Complex 41 happened at 10:04 p.m. EST (0304 UTC), the opening of a 44-minute-long window. The rocket headed due east upon leaving Florida’s Space Coast. ﻿ ULA launched this mission using an Atlas 5 rocket in its 551 configuration. The 196-foot-tall (59.7 meters) rocket was supported by five solid rocket boosters, which combined with the RD-180 main engine to produce about 2.7 million pounds (12 megaNewtons) of thrust at liftoff. The SRBs jettisoned less than two minutes into the flight, followed by the payload fairings about a minute and a half later. It will take three separate firings of the RL10C-1-1 engine on the Centaur 3 upper stage to reach the correct orbit to release the ViaSat-3 F2 satellite. Following release, the upper stage will be placed in a so-called graveyard orbit nearly an hour later. This rocket had the designation of AV-100 and was the 105th Atlas V rocket launched to date. Following this launch, ULA now has 11 of these rockets remaining before it is officially retired: 6 – Boeing’s CST-100 Starliner 5 – Amazon’s Project Kuiper A United Launch Alliance Atlas 5 551 rocket lifts off from Space Launch Complex 41 (SLC-41) at Cape Canaveral Space Force Station to begin the ViaSat-3 F2 mission for Viasat. Image: John Pisani / Spaceflight Now What’s onboard? This was the second satellite in the ViaSat-3 series that will operate in geostationary Earth orbit, following the launch of the first spacecraft in 2023. After the ViaSat-3 F1 satellite launched on a SpaceX Falcon Heavy rocket, it suffered an issue with its antenna, which both delayed the start of service and resulted in a reduced capacity. Viasat officials said ahead of the launch that this new satellite will provide needed Ka-band network capabilities, adding more than 1 terabits per second (Tbps) of capacity to the network over the Americas. Following a months of on-orbit testing at its operating slog of 79 degrees West longitude, the ViaSat-3 F2 spacecraft is expected to enter service in early 2026. The ViaSat-3 F2 satellite is moved within the Astrotech Space Operations facility in Titusville, Florida, where it was encapsulated in payload fairings for United Launch Alliance’s Atlas 5 rocket. Image: Viasat “Beyond an incredible capacity increase, ViaSat-3 F2’s dynamic beam forming capabilities will greatly benefit our customers by efficiently deploying bandwidth to the highest demand places, allowing us to scale performance and the number and density of users,” said Mark Dankberg, Chairman and CEO of Viasat, in a statement. “These capabilities will continue to fuel our successful, multi-orbit service offerings, including service platforms such as Viasat Amara, NexusWave, and a resilient, hybrid SATCOM architecture for government.” The satellite is built on Boeing’s 702MP+ platform, which uses electric propulsion and solar arrays, the latter of which is from Boeing subsidiary, Spectrolab. Boeing is supporting Viasat in both launch operations and post-deployment checkouts. “Our goal is to enable missions with reliability and timely delivery,” said Michelle Parker, Vice President of Boeing Space Mission Systems. “With ViaSat‑3 F2, we leveraged proven 702 heritage, advanced power systems and all‑electric propulsion to enable high-speed connectivity for users who rely on it.”",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "a70dc6c91bdefc5768c412113ecf610d",
        "rep_id": "a70dc6c91bdefc5768c412113ecf610d",
        "member_ids": [
            "a70dc6c91bdefc5768c412113ecf610d"
        ],
        "rep_title": "Launch preview: Blue Origin to launch NASA’s ESCAPADE following scrubs from clouds, space weather",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-13T13:17:28+00:00",
        "articles": [
            {
                "id": "a70dc6c91bdefc5768c412113ecf610d",
                "title": "Launch preview: Blue Origin to launch NASA’s ESCAPADE following scrubs from clouds, space weather",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/13/live-coverage-blue-origin-to-launch-nasas-escapade-following-scrubs-from-clouds-space-weather/",
                "text": "Blue Origin’s New Glenn rocket that will launch NASA’s ESCAPADE (Escape and Plasma Acceleration Dynamics Explorers) mission along with a technology demonstration from Viasat. Image: Blue Origin Blue Origin is stepping back up to the plate and will take another crack at launching its 98-meter-tall (321 ft) rocket from Cape Canaveral Space Force Station on Thursday, Nov. 13. A confluence of poor weather, an errant cruise ship in the keep out zone and a ground systems issue at the pad were roadblocks to a Sunday launch attempt. Its second attempt on Wednesday was halted because a trio of coronal mass ejections from the Sun created too high of a probability for strong geomagnetic storms. The company founded by Amazon founder Jeff Bezos is now targeting liftoff from Launch Complex 36 during an 88-minute window that opens at 2:57 p.m. EST (1957 UTC). Spaceflight Now will have live coverage beginning about three hours prior to liftoff. ﻿ The 45th Weather Squadron forecast a greater than 95 percent chance of liftoff during the window, citing no concerns for meteorological impacts that would prevent launch. Teams were also watching for the lingering effects of the geomagnetic storms, placing them as a “moderate” risk to launch on Thursday. On Tuesday afternoon, NOAA’s Space Weather Prediction Center forecast a G4 Severe Watch connected to a coronal mass ejection first detected on Sunday, Nov. 9. It noted that this is just the fourth G4 Watch issued this solar cycle, making it “very rare,” and added that impacts are expected “about midday on Nov. 12.” “A CME is anticipated to arrive at and partially impact Earth around midday, 12 Nov; with the potential for elevated geomagnetic response and dependent upon the orientation of the embedded magnetic field, potential exists for Severe Storm levels.” In its latest update on Thursday morning, NOAA issued an extended warning for “Proton 10MeV Integral Flux above 10pfu.” This type of so-called Solar Proton Event or SPE for short can be harmful to spacecraft electronics. ﻿ Roughly three minutes after liftoff, Blue Origin will attempt to propel the first stage booster, named ‘Never Tell Me the Odds’, towards a landing on its barge, ‘Jacklyn’, which is staged about 375 miles (603.5 km) downrange of the launch pad. The company attempted a similar landing with its first New Glenn booster, ‘So You’re Telling Me There’s a Chance’, but it failed to properly relight the three gimbaling BE-4 engines for the reentry burn. If all goes well, Blue Origin will become the second private company to perform a propulsive landing an orbital class rocket. It plans to reuse its boosters for up to 25 flights initially, assuming successful landings. The Recovery Remotely Operated Vehicle (ROV) pictured on Blue Origin’s landing vessel, named ‘Jacklyn,’ after founder Jeff Bezos’ mother. ROV will deploy following a booster landing and provide power, communication and pneumatic links between the booster and Jacklyn, according to Blue Origin CEO Dave Limp. Image: Blue Origin What’s onboard? Nestled within the New Glenn’s 7 m (23 ft) payload fairings are the twin spacecraft that makeup NASA’s Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission as well as a ride share communications technology demonstration from Viasat. A little more than 33 minutes after liftoff, the two ESCAPADE satellites, Blue and Gold will deploy from a satellite adaptor called an Evolved Expendable Launch Vehicle (ESPA) ring. Blue separates first and then Gold about 30 seconds later. They are being released into a highly elliptical orbit, “just shy of Earth escape velocity,” Blue Origin CEO Dave Limp said in a social media post on Nov. 9. The twins will loiter in a novel so-called “kidney bean” shaped orbit around Lagrange Point 2 about a million miles from Earth for about a year. They will then use the Earth for a gravity assist around fall 2026 to begin a roughly 11-month journey to the Red Planet. They will arrive at Mars roughly two days apart when they will each perform a Mars insertion burn to enter into an elliptical orbit that will slowly be lowered into their target science orbit. They will be studying Mars’ magnetosphere to learn more about how it’s been influenced by space weather over time. Rocket Lab built ESCAPADE twin spacecraft fully assembled and ready for shipping at the company’s Spacecraft Production Complex and headquarters in Long Beach, California, before shipping to the launch site at Cape Canaveral, Florida. Image: Rocket Lab The other payload onboard New Glenn from Viasat will remain fixed to the upper stage and be activated about five minutes after the deployment of the second ESCAPADE spacecraft. This is a demonstration of Viasat’s InRange launch telemetry relay solution, which is part of the company’s work under the NASA Communications Services Project. “InRange is a specific launch telemetry data relay service designed to support launch providers with responsive, real-time data transmission during launch using Viasat’s L-band network,” a Viasat spokesperson told Spaceflight Now in a statement. “This is a separate solution from Viasat’s high-capacity Ka-band data relay capability (i.e. Real-Time Space Relay), which is also being developed and will separately be demonstrated as part of our NASA CSP program work.”",
                "timestamp": "2025-11-13T13:17:28+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/13/live-coverage-blue-origin-to-launch-nasas-escapade-following-scrubs-from-clouds-space-weather/"
        ],
        "rep_text": "Blue Origin’s New Glenn rocket that will launch NASA’s ESCAPADE (Escape and Plasma Acceleration Dynamics Explorers) mission along with a technology demonstration from Viasat. Image: Blue Origin Blue Origin is stepping back up to the plate and will take another crack at launching its 98-meter-tall (321 ft) rocket from Cape Canaveral Space Force Station on Thursday, Nov. 13. A confluence of poor weather, an errant cruise ship in the keep out zone and a ground systems issue at the pad were roadblocks to a Sunday launch attempt. Its second attempt on Wednesday was halted because a trio of coronal mass ejections from the Sun created too high of a probability for strong geomagnetic storms. The company founded by Amazon founder Jeff Bezos is now targeting liftoff from Launch Complex 36 during an 88-minute window that opens at 2:57 p.m. EST (1957 UTC). Spaceflight Now will have live coverage beginning about three hours prior to liftoff. ﻿ The 45th Weather Squadron forecast a greater than 95 percent chance of liftoff during the window, citing no concerns for meteorological impacts that would prevent launch. Teams were also watching for the lingering effects of the geomagnetic storms, placing them as a “moderate” risk to launch on Thursday. On Tuesday afternoon, NOAA’s Space Weather Prediction Center forecast a G4 Severe Watch connected to a coronal mass ejection first detected on Sunday, Nov. 9. It noted that this is just the fourth G4 Watch issued this solar cycle, making it “very rare,” and added that impacts are expected “about midday on Nov. 12.” “A CME is anticipated to arrive at and partially impact Earth around midday, 12 Nov; with the potential for elevated geomagnetic response and dependent upon the orientation of the embedded magnetic field, potential exists for Severe Storm levels.” In its latest update on Thursday morning, NOAA issued an extended warning for “Proton 10MeV Integral Flux above 10pfu.” This type of so-called Solar Proton Event or SPE for short can be harmful to spacecraft electronics. ﻿ Roughly three minutes after liftoff, Blue Origin will attempt to propel the first stage booster, named ‘Never Tell Me the Odds’, towards a landing on its barge, ‘Jacklyn’, which is staged about 375 miles (603.5 km) downrange of the launch pad. The company attempted a similar landing with its first New Glenn booster, ‘So You’re Telling Me There’s a Chance’, but it failed to properly relight the three gimbaling BE-4 engines for the reentry burn. If all goes well, Blue Origin will become the second private company to perform a propulsive landing an orbital class rocket. It plans to reuse its boosters for up to 25 flights initially, assuming successful landings. The Recovery Remotely Operated Vehicle (ROV) pictured on Blue Origin’s landing vessel, named ‘Jacklyn,’ after founder Jeff Bezos’ mother. ROV will deploy following a booster landing and provide power, communication and pneumatic links between the booster and Jacklyn, according to Blue Origin CEO Dave Limp. Image: Blue Origin What’s onboard? Nestled within the New Glenn’s 7 m (23 ft) payload fairings are the twin spacecraft that makeup NASA’s Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission as well as a ride share communications technology demonstration from Viasat. A little more than 33 minutes after liftoff, the two ESCAPADE satellites, Blue and Gold will deploy from a satellite adaptor called an Evolved Expendable Launch Vehicle (ESPA) ring. Blue separates first and then Gold about 30 seconds later. They are being released into a highly elliptical orbit, “just shy of Earth escape velocity,” Blue Origin CEO Dave Limp said in a social media post on Nov. 9. The twins will loiter in a novel so-called “kidney bean” shaped orbit around Lagrange Point 2 about a million miles from Earth for about a year. They will then use the Earth for a gravity assist around fall 2026 to begin a roughly 11-month journey to the Red Planet. They will arrive at Mars roughly two days apart when they will each perform a Mars insertion burn to enter into an elliptical orbit that will slowly be lowered into their target science orbit. They will be studying Mars’ magnetosphere to learn more about how it’s been influenced by space weather over time. Rocket Lab built ESCAPADE twin spacecraft fully assembled and ready for shipping at the company’s Spacecraft Production Complex and headquarters in Long Beach, California, before shipping to the launch site at Cape Canaveral, Florida. Image: Rocket Lab The other payload onboard New Glenn from Viasat will remain fixed to the upper stage and be activated about five minutes after the deployment of the second ESCAPADE spacecraft. This is a demonstration of Viasat’s InRange launch telemetry relay solution, which is part of the company’s work under the NASA Communications Services Project. “InRange is a specific launch telemetry data relay service designed to support launch providers with responsive, real-time data transmission during launch using Viasat’s L-band network,” a Viasat spokesperson told Spaceflight Now in a statement. “This is a separate solution from Viasat’s high-capacity Ka-band data relay capability (i.e. Real-Time Space Relay), which is also being developed and will separately be demonstrated as part of our NASA CSP program work.”",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "bda57ebfbdc27211133af448c7040026",
        "rep_id": "bda57ebfbdc27211133af448c7040026",
        "member_ids": [
            "bda57ebfbdc27211133af448c7040026"
        ],
        "rep_title": "NASA scrubs ESCAPADE launch due to ‘highly elevated solar activity’",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-11T23:07:49+00:00",
        "articles": [
            {
                "id": "bda57ebfbdc27211133af448c7040026",
                "title": "NASA scrubs ESCAPADE launch due to ‘highly elevated solar activity’",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/11/live-coverage-blue-origin-targets-nov-12-new-glenn-launch-following-weekend-weather-scrub/",
                "text": "Blue Origin’s New Glenn rocket designed for the NG-2 mission is pictured at sunset at Launch Complex 36, the evening of Nov. 8, 2025. The rocket will carry NASA’s ESCAPADE mission along with a payload demonstration for Viasat. Image: Adam Bernstein / Spaceflight Now Update Nov. 12, 10:40 a.m. EST (1540 UTC): NASA scrubbed the launch due to strong solar impacts. After terrestrial weather forced Blue Origin to scrub its Sunday attempt to launch its 98-meter-tall (321 ft) New Glenn rocket, unacceptable space weather prevented a launch attempt on Wednesday from Cape Canaveral Space Force Station. In a post on social media, the company said NASA made the call to stand down “due to highly elevated solar activity and its potential effects on the ESCAPADE spacecraft.” “NASA is postponing launch until space weather conditions improve. We are currently assessing opportunities to establish our next launch,” Blue Origin wrote in a post on X. A confluence of poor weather, an errant cruise ship in the keep out zone and a ground systems issue at Launch Complex 36 were roadblocks to a Sunday launch attempt. In rescheduling the mission, Blue Origin said in another social media post that it was avoiding poor weather on Monday and Tuesday, but didn’t mention the status of the ground systems issue. G3 conditions are currently being observed. G4 conditions with a chance for higher levels remain possible throughout the day as another CME is expected to arrive midday (EST). pic.twitter.com/XcBmeNns4J — NOAA Space Weather Prediction Center (@NWSSWPC) November 12, 2025 The 45th Weather Squadron forecast a greater than 95 percent chance of liftoff during the window, citing no concerns for meteorological impacts that would prevent launch. Teams did highlight the booster recovery zone as watch item, stating that it was a “moderate” risk on a low-moderate-high scale. Space weather could also be an issue. On Tuesday afternoon, NOAA’s Space Weather Prediction Center forecast a G4 Severe Watch connected to a coronal mass ejection first detected on Sunday, Nov. 9. It noted that this is just the fourth G4 Watch issued this solar cycle, making it “very rare,” and added that impacts are expected “about midday on Nov. 12.” “A CME is anticipated to arrive at and partially impact Earth around midday, 12 Nov; with the potential for elevated geomagnetic response and dependent upon the orientation of the embedded magnetic field, potential exists for Severe Storm levels.” Blue Origin’s New Glenn rocket designed for the NG-2 mission is pictured at sunset at Launch Complex 36, the evening of Nov. 8, 2025. The rocket will carry NASA’s ESCAPADE mission along with a payload demonstration for Viasat. Image: Adam Bernstein / Spaceflight Now When the mission is able to launch, starting at stage separation, roughly three minutes after liftoff, teams will attempt to steer the first stage booster, named ‘Never Tell Me the Odds’, towards a landing in the Atlantic on a barge, ‘Jacklyn’, which is staged about 375 miles (603.5 km) downrange of the launch pad. Blue Origin attempted a similar landing with its first New Glenn booster, ‘So You’re Telling Me There’s a Chance’, but the rocket failed to properly relight the three gimbaling BE-4 engines for the reentry burn. If all goes well, Blue Origin will become the second private company to perform a propulsive landing an orbital class rocket. It plans to reuse its boosters for up to 25 flights initially, assuming successful landings. The Recovery Remotely Operated Vehicle (ROV) pictured on Blue Origin’s landing vessel, named ‘Jacklyn,’ after founder Jeff Bezos’ mother. ROV will deploy following a booster landing and provide power, communication and pneumatic links between the booster and Jacklyn, according to Blue Origin CEO Dave Limp. Image: Blue Origin What’s onboard? Nestled within the New Glenn’s 7 m (23 ft) payload fairings are the twin spacecraft that makeup NASA’s Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission as well as a ride share communications technology demonstration from Viasat. A little more than 33 minutes after liftoff, the two ESCAPADE satellites, Blue and Gold will deploy from a satellite adaptor called an Evolved Expendable Launch Vehicle (ESPA) ring. Blue separates first and then Gold about 30 seconds later. They are being released into a highly elliptical orbit, “just shy of Earth escape velocity,” Blue Origin CEO Dave Limp said in a social media post on Nov. 9. The twins will loiter in a novel so-called “kidney bean” shaped orbit around Lagrange Point 2 about a million miles from Earth for about a year. They will then use the Earth for a gravity assist around fall 2026 to begin a roughly 11-month journey to the Red Planet. They will arrive at Mars roughly two days apart when they will each perform a Mars insertion burn to enter into an elliptical orbit that will slowly be lowered into their target science orbit. They will be studying Mars’ magnetosphere to learn more about how it’s been influenced by space weather over time. Mating the twins to their Evolved Expendable Launch Vehicle Secondary Payload Adapter (ESPA) ring. The ESPA ring is what lets multiple smaller spacecraft share a launch on the same rocket. pic.twitter.com/tBlxMkfGG6 — Rocket Lab (@RocketLab) November 9, 2025 The other payload onboard New Glenn from Viasat will remain fixed to the upper stage and be activated about five minutes after the deployment of the second ESCAPADE spacecraft. This is a demonstration of Viasat’s InRange launch telemetry relay solution, which is part of the company’s work under the NASA Communications Services Project. “InRange is a specific launch telemetry data relay service designed to support launch providers with responsive, real-time data transmission during launch using Viasat’s L-band network,” a Viasat spokesperson told Spaceflight Now in a statement. “This is a separate solution from Viasat’s high-capacity Ka-band data relay capability (i.e. Real-Time Space Relay), which is also being developed and will separately be demonstrated as part of our NASA CSP program work.”",
                "timestamp": "2025-11-11T23:07:49+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/11/live-coverage-blue-origin-targets-nov-12-new-glenn-launch-following-weekend-weather-scrub/"
        ],
        "rep_text": "Blue Origin’s New Glenn rocket designed for the NG-2 mission is pictured at sunset at Launch Complex 36, the evening of Nov. 8, 2025. The rocket will carry NASA’s ESCAPADE mission along with a payload demonstration for Viasat. Image: Adam Bernstein / Spaceflight Now Update Nov. 12, 10:40 a.m. EST (1540 UTC): NASA scrubbed the launch due to strong solar impacts. After terrestrial weather forced Blue Origin to scrub its Sunday attempt to launch its 98-meter-tall (321 ft) New Glenn rocket, unacceptable space weather prevented a launch attempt on Wednesday from Cape Canaveral Space Force Station. In a post on social media, the company said NASA made the call to stand down “due to highly elevated solar activity and its potential effects on the ESCAPADE spacecraft.” “NASA is postponing launch until space weather conditions improve. We are currently assessing opportunities to establish our next launch,” Blue Origin wrote in a post on X. A confluence of poor weather, an errant cruise ship in the keep out zone and a ground systems issue at Launch Complex 36 were roadblocks to a Sunday launch attempt. In rescheduling the mission, Blue Origin said in another social media post that it was avoiding poor weather on Monday and Tuesday, but didn’t mention the status of the ground systems issue. G3 conditions are currently being observed. G4 conditions with a chance for higher levels remain possible throughout the day as another CME is expected to arrive midday (EST). pic.twitter.com/XcBmeNns4J — NOAA Space Weather Prediction Center (@NWSSWPC) November 12, 2025 The 45th Weather Squadron forecast a greater than 95 percent chance of liftoff during the window, citing no concerns for meteorological impacts that would prevent launch. Teams did highlight the booster recovery zone as watch item, stating that it was a “moderate” risk on a low-moderate-high scale. Space weather could also be an issue. On Tuesday afternoon, NOAA’s Space Weather Prediction Center forecast a G4 Severe Watch connected to a coronal mass ejection first detected on Sunday, Nov. 9. It noted that this is just the fourth G4 Watch issued this solar cycle, making it “very rare,” and added that impacts are expected “about midday on Nov. 12.” “A CME is anticipated to arrive at and partially impact Earth around midday, 12 Nov; with the potential for elevated geomagnetic response and dependent upon the orientation of the embedded magnetic field, potential exists for Severe Storm levels.” Blue Origin’s New Glenn rocket designed for the NG-2 mission is pictured at sunset at Launch Complex 36, the evening of Nov. 8, 2025. The rocket will carry NASA’s ESCAPADE mission along with a payload demonstration for Viasat. Image: Adam Bernstein / Spaceflight Now When the mission is able to launch, starting at stage separation, roughly three minutes after liftoff, teams will attempt to steer the first stage booster, named ‘Never Tell Me the Odds’, towards a landing in the Atlantic on a barge, ‘Jacklyn’, which is staged about 375 miles (603.5 km) downrange of the launch pad. Blue Origin attempted a similar landing with its first New Glenn booster, ‘So You’re Telling Me There’s a Chance’, but the rocket failed to properly relight the three gimbaling BE-4 engines for the reentry burn. If all goes well, Blue Origin will become the second private company to perform a propulsive landing an orbital class rocket. It plans to reuse its boosters for up to 25 flights initially, assuming successful landings. The Recovery Remotely Operated Vehicle (ROV) pictured on Blue Origin’s landing vessel, named ‘Jacklyn,’ after founder Jeff Bezos’ mother. ROV will deploy following a booster landing and provide power, communication and pneumatic links between the booster and Jacklyn, according to Blue Origin CEO Dave Limp. Image: Blue Origin What’s onboard? Nestled within the New Glenn’s 7 m (23 ft) payload fairings are the twin spacecraft that makeup NASA’s Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission as well as a ride share communications technology demonstration from Viasat. A little more than 33 minutes after liftoff, the two ESCAPADE satellites, Blue and Gold will deploy from a satellite adaptor called an Evolved Expendable Launch Vehicle (ESPA) ring. Blue separates first and then Gold about 30 seconds later. They are being released into a highly elliptical orbit, “just shy of Earth escape velocity,” Blue Origin CEO Dave Limp said in a social media post on Nov. 9. The twins will loiter in a novel so-called “kidney bean” shaped orbit around Lagrange Point 2 about a million miles from Earth for about a year. They will then use the Earth for a gravity assist around fall 2026 to begin a roughly 11-month journey to the Red Planet. They will arrive at Mars roughly two days apart when they will each perform a Mars insertion burn to enter into an elliptical orbit that will slowly be lowered into their target science orbit. They will be studying Mars’ magnetosphere to learn more about how it’s been influenced by space weather over time. Mating the twins to their Evolved Expendable Launch Vehicle Secondary Payload Adapter (ESPA) ring. The ESPA ring is what lets multiple smaller spacecraft share a launch on the same rocket. pic.twitter.com/tBlxMkfGG6 — Rocket Lab (@RocketLab) November 9, 2025 The other payload onboard New Glenn from Viasat will remain fixed to the upper stage and be activated about five minutes after the deployment of the second ESCAPADE spacecraft. This is a demonstration of Viasat’s InRange launch telemetry relay solution, which is part of the company’s work under the NASA Communications Services Project. “InRange is a specific launch telemetry data relay service designed to support launch providers with responsive, real-time data transmission during launch using Viasat’s L-band network,” a Viasat spokesperson told Spaceflight Now in a statement. “This is a separate solution from Viasat’s high-capacity Ka-band data relay capability (i.e. Real-Time Space Relay), which is also being developed and will separately be demonstrated as part of our NASA CSP program work.”",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "a315d6386c8d6eb950e715f0bf0147a8",
        "rep_id": "a315d6386c8d6eb950e715f0bf0147a8",
        "member_ids": [
            "a315d6386c8d6eb950e715f0bf0147a8"
        ],
        "rep_title": "Rocket Lab delays debut of Neutron rocket to 2026",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-11T04:31:24+00:00",
        "articles": [
            {
                "id": "a315d6386c8d6eb950e715f0bf0147a8",
                "title": "Rocket Lab delays debut of Neutron rocket to 2026",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/11/rocket-lab-delays-debut-of-neutron-rocket-to-2026/",
                "text": "An artist’s rendering of a Rocket Lab Neutron rocket during stage separation. Illustration: Rocket Lab The inaugural flight of Rocket Lab’s reusable, medium-lift Neutron rocket is now set for 2026, instead of this year. The company said more testing and qualification work was needed. Sir Peter Beck, the CEO of Rocket Lab, announced the shift in plans during the third quarter earnings call with investors on Nov. 10. He said that the company’s goal is to get the rocket out to Launch Complex 3 at the Virginia Spaceport Authority’s (VSA) Mid-Atlantic Regional Spaceport (MARS) within the first quarter of 2026 “with first launch thereafter.” “As always, this is a rocket program that’s been completed at a pace and a cost that nobody has achieved before and the financial and long-term impacts are insignificant to take a little bit more time to get it right,” Beck told investors on the call. Without naming names, Beck said others have raced to the launch pad without being fully ready for launch and that would not be their approach. He emphasized that Rocket Lab’s goal is to have a fully successful first flight and to make it to orbit without issue. “You won’t see us minimizing some qualifier about us just clearing the pad and claiming success and whatnot,” Beck said. “And that means we don’t want to learn something during Neutron’s first flight that could be learned on the ground during the testing phase. “At the end of the day, Neutron will fly when we’re very confident it’s ready and we’re not going to break the mold of the Rocket Lab magic.” A slide from Rocket Lab’s Q3 earnings presentation shown during an investor’s earning call on Nov. 10, 2025. Graphic: Rocket Lab While the 141-foot-tall (43 m) two-stage rocket is designed to be reusable, part of a successful first flight of Neutron won’t be proving reuse of the booster. Rocket Lab is still developing its 400-foot-long landing barge called ‘Return on Investment’, which Beck said should be ready to support Neutron’s second launch. Beck said that the methane and liquid oxygen powered Archimedes engines, which will power the liftoff of Neutron with 1.5 million pounds of thrust, continue to go through validation and qualification. He said they’re using two test stands at NASA’s Stennis Space Center in Mississippi at a 20-7 rate: 20 hours a day, seven days a week. “The only way you can get through years of qualification that are always expected for an engine program is to squeeze years of hours into months,” Beck said. “As you can imagine, no weekends or evenings are left on the table at the Stennis test facility.” When asked by Michael Leshock of KeyBanc Capital Markets about how close they were to a finalized design of the Archimedes engine, Beck said the “engine design’s pretty stable at this point,” adding that Rocket Lab had “met all the performance criteria.” “With ascent there’s one set of environments and with descent, there’s an entirely new set of environments and much more challenging environments because your propellant will warm and lower pressures,” Beck said. “The vast, vast majority of all the components for Flight 1 engines are either complete or in some kind of form of build. “We’re iterating on the engine for sure, but the production machine is stood up and ready to support.” Archimedes full mission duration hot fire. Enjoy. pic.twitter.com/jF3I3zDM9G — Rocket Lab (@RocketLab) August 7, 2025 Leshock also asked whether the original budget prediction of Neutron was holding in the $250 million to $300 million range, Adam Spice, the Chief Financial Officer at Rocket Lab, said that the push of first launch from the end of 2025 into 2026 means that the company likely will have spent about $360 million on the program by the end of 2025. “As Pete mentioned, it’s about a $15 million impact on the human capital side of things per quarter,” Spice said. “When the program delays, you end up obviously incurring an extension of that staffing-related expenses to the program.” Spice said Rocket Lab expects to reach the peak of their quarterly expenditures on the Neutron program by the end of the fourth quarter of 2025. In another part of the earnings call, Spice said the first launch of Neutron won’t include a customer on board, but said they do have “two, fully priced missions in the backlog right now.” “For Neutron, there’s a third contract admission… made to be a rideshare,” Spice said. “We don’t have that in the backlog because we don’t do that until we’ve actually added the payloads into the manifest.” Spice reported that Rocket Lab’s backlog at the end of the third quarter was $1.1 billion with 47 percent coming from the launch side of the company versus their space systems business, which provides both spacecraft (like the two ESCAPADE satellites awaiting launch in Florida) and spacecraft components to customers. ﻿",
                "timestamp": "2025-11-11T04:31:24+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/11/rocket-lab-delays-debut-of-neutron-rocket-to-2026/"
        ],
        "rep_text": "An artist’s rendering of a Rocket Lab Neutron rocket during stage separation. Illustration: Rocket Lab The inaugural flight of Rocket Lab’s reusable, medium-lift Neutron rocket is now set for 2026, instead of this year. The company said more testing and qualification work was needed. Sir Peter Beck, the CEO of Rocket Lab, announced the shift in plans during the third quarter earnings call with investors on Nov. 10. He said that the company’s goal is to get the rocket out to Launch Complex 3 at the Virginia Spaceport Authority’s (VSA) Mid-Atlantic Regional Spaceport (MARS) within the first quarter of 2026 “with first launch thereafter.” “As always, this is a rocket program that’s been completed at a pace and a cost that nobody has achieved before and the financial and long-term impacts are insignificant to take a little bit more time to get it right,” Beck told investors on the call. Without naming names, Beck said others have raced to the launch pad without being fully ready for launch and that would not be their approach. He emphasized that Rocket Lab’s goal is to have a fully successful first flight and to make it to orbit without issue. “You won’t see us minimizing some qualifier about us just clearing the pad and claiming success and whatnot,” Beck said. “And that means we don’t want to learn something during Neutron’s first flight that could be learned on the ground during the testing phase. “At the end of the day, Neutron will fly when we’re very confident it’s ready and we’re not going to break the mold of the Rocket Lab magic.” A slide from Rocket Lab’s Q3 earnings presentation shown during an investor’s earning call on Nov. 10, 2025. Graphic: Rocket Lab While the 141-foot-tall (43 m) two-stage rocket is designed to be reusable, part of a successful first flight of Neutron won’t be proving reuse of the booster. Rocket Lab is still developing its 400-foot-long landing barge called ‘Return on Investment’, which Beck said should be ready to support Neutron’s second launch. Beck said that the methane and liquid oxygen powered Archimedes engines, which will power the liftoff of Neutron with 1.5 million pounds of thrust, continue to go through validation and qualification. He said they’re using two test stands at NASA’s Stennis Space Center in Mississippi at a 20-7 rate: 20 hours a day, seven days a week. “The only way you can get through years of qualification that are always expected for an engine program is to squeeze years of hours into months,” Beck said. “As you can imagine, no weekends or evenings are left on the table at the Stennis test facility.” When asked by Michael Leshock of KeyBanc Capital Markets about how close they were to a finalized design of the Archimedes engine, Beck said the “engine design’s pretty stable at this point,” adding that Rocket Lab had “met all the performance criteria.” “With ascent there’s one set of environments and with descent, there’s an entirely new set of environments and much more challenging environments because your propellant will warm and lower pressures,” Beck said. “The vast, vast majority of all the components for Flight 1 engines are either complete or in some kind of form of build. “We’re iterating on the engine for sure, but the production machine is stood up and ready to support.” Archimedes full mission duration hot fire. Enjoy. pic.twitter.com/jF3I3zDM9G — Rocket Lab (@RocketLab) August 7, 2025 Leshock also asked whether the original budget prediction of Neutron was holding in the $250 million to $300 million range, Adam Spice, the Chief Financial Officer at Rocket Lab, said that the push of first launch from the end of 2025 into 2026 means that the company likely will have spent about $360 million on the program by the end of 2025. “As Pete mentioned, it’s about a $15 million impact on the human capital side of things per quarter,” Spice said. “When the program delays, you end up obviously incurring an extension of that staffing-related expenses to the program.” Spice said Rocket Lab expects to reach the peak of their quarterly expenditures on the Neutron program by the end of the fourth quarter of 2025. In another part of the earnings call, Spice said the first launch of Neutron won’t include a customer on board, but said they do have “two, fully priced missions in the backlog right now.” “For Neutron, there’s a third contract admission… made to be a rideshare,” Spice said. “We don’t have that in the backlog because we don’t do that until we’ve actually added the payloads into the manifest.” Spice reported that Rocket Lab’s backlog at the end of the third quarter was $1.1 billion with 47 percent coming from the launch side of the company versus their space systems business, which provides both spacecraft (like the two ESCAPADE satellites awaiting launch in Florida) and spacecraft components to customers. ﻿",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "1b0e7ef39148d83d7b896a11aa5ac1ac",
        "rep_id": "1b0e7ef39148d83d7b896a11aa5ac1ac",
        "member_ids": [
            "1b0e7ef39148d83d7b896a11aa5ac1ac"
        ],
        "rep_title": "Florida annual launch record broken with late-night Starlink flight",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-10T20:00:00+00:00",
        "articles": [
            {
                "id": "1b0e7ef39148d83d7b896a11aa5ac1ac",
                "title": "Florida annual launch record broken with late-night Starlink flight",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/10/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-3/",
                "text": "A long-exposure shot of SpaceX’s Falcon 9 rocket blasting off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station on Nov. 10, 2025. Image: John Pisani / Spaceflight Now Update Nov. 10, 11:30 p.m. EST (04130UTC): SpaceX confirms deployment of the 29 Starlink satellites. The busiest spaceport in the world broke another record on Monday night. SpaceX’s Falcon 9 rocket was the 94th launch for an orbital class rocket from Florida, surpassing the total achieved in 2024. The total was a combination of Falcon 9 rockets as well as Atlas 5 and Vulcan rockets from United Launch Alliance and one New Glenn flight from Blue Origin. The Monday night mission that tipped the scales into the record books was Starlink 6-87, which added another 29 broadband internet satellites to the company’s mega-constellation in low Earth orbit. SpaceX accomplished liftoff from pad 40 at Cape Canaveral Space Force Station at 10:21 p.m. EST (0321 UTC). The launch was originally scheduled about five hours earlier in the day, but it was pushed later because the Federal Aviation Administration is limiting commercial launches to between the hours of 10 p.m. and 6 a.m., due to the shortage of air traffic controllers during the government shutdown. Launches add significantly to the workload of air traffic controllers due to the need to divert flights away from the launch danger area. The 45th Weather Squadron forecast a 60 percent chance for favorable weather during the launch window thanks to a “strong cold front” moving across the state on Monday. Meteorologists citied concerns from strong winds at liftoff as well as upper-level wind shear and somewhat questionable weather in the booster recovery zone near the Bahamas. “The front itself will cross the region Monday morning, ushering in a blast of strong northwesterly winds and chilly temps that will linger through at least the first half of Tuesday,” launch weather officers wrote. “As a result, the main concern for the primary launch window will be liftoff winds.” SpaceX used B1096 for the Starlink 6-87 mission, one of the newer Falcon 9 boosters in its fleet. Monday’s launch was its third flight following KF-01 for Amazon’s Project Kuiper and NASA’s IMAP rideshare mission earlier this year. Less than eight minutes after liftoff, B1096 performed an autonomous landing attempt on the drone ship, ‘Just Read the Instructions’. This was the 141st landing on this vessel and the 532nd booster landing to date. Records are made to be broken For more than half a decade, Florida’s spaceport, a combination of both NASA’s Kennedy Space Center and Cape Canaveral Space Force Station, have been steadily increasing the number of orbital launches, thanks in large part to a yearly ramp up in flights from SpaceX. Between its two Falcon launch pads, Launch Complex 39A and Space Launch Complex 40, SpaceX will have launched 88 times after flying the Starlink 6-87 mission, about 95 percent of the launches from Florida’s Space Coast. Falcon launch #130 for 2025. The rolling 365 launch total is 166 launches! Notable records from this morning: * Fastest launch to launch from the same American Launch Pad at 55 Hrs, 29 minutes and 9 seconds * Fastest TE roll in to hangar for booster integration to launch at 12… https://t.co/kgrHZ7yXD5 — Kiko Dontchev (@TurkeyBeaver) October 16, 2025 The impact of some of those launches was reflected in October’s monthly CEO report delivered by Capt. John Murray, to the Port Canaveral Commission on Oct. 22. He noted that for all of Fiscal Year 2025 (Oct. 1, 2024 – Sept. 30, 2025) that there were 90 boosters brought into port along with 194 payload fairings, which he described as “quite significant.” Port Canaveral doesn’t explicitly break down its listing of “Space Component Recoveries” in its report. Presumably, these numbers reflect just SpaceX components, but Spaceflight Now did reach out to Port Canaveral to seek clarification. The ramp up in launch cadence required both increased agility on the part of launch operators, like SpaceX and United Launch Alliance as well as from those who manage the Eastern Range. Ahead of the Aug. 4, 2022, launches of both the SBIRS GEO-6 and the Korea Pathfinder Lunar Orbiter by ULA and SpaceX respectively, Spaceflight Now Reporter Will Robinson-Smith spoke with members of the 1st Range Ops Squadron (1 ROPS) in his capacity as a reporter for Spectrum News 13 at the time. Back then, a double launch day was something that hadn’t been achieved in Florida since the 1960s. U.S. Space Force 2nd Lt. Christian Jackson said that a ramped up launch cadence was “something that we train for every week” in preparation for a more airport-like flight environment. “Just a few years ago, they were launching maybe 12 rockets in a year. We’ve got about 60 plus on the manifest to finish out this year and there are hopes of possibly doing up to 100 launches next year,” Jackson said in 2022. “So, if we want to reach those numbers, we’re definitely going to get to that point where we’re launching over one in a day.” There have been many double launch days since then, with the most recent being September 25, which saw the launches of the Starlink 10-15 mission on a Falcon 9 rocket and the Kuiper Atlas 03 mission on an Atlas 5 551 rocket. Leadership at the Cape has been working to increase payload processing facility capacity to allow for further ramp up of missions, with facilities like one dedicated to Amazon’s Kuiper satellites coming online earlier this year. Orbital launches by year from Cape Canaveral, including failures. Graphic: Spaceflight Now.",
                "timestamp": "2025-11-10T20:00:00+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/10/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-3/"
        ],
        "rep_text": "A long-exposure shot of SpaceX’s Falcon 9 rocket blasting off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station on Nov. 10, 2025. Image: John Pisani / Spaceflight Now Update Nov. 10, 11:30 p.m. EST (04130UTC): SpaceX confirms deployment of the 29 Starlink satellites. The busiest spaceport in the world broke another record on Monday night. SpaceX’s Falcon 9 rocket was the 94th launch for an orbital class rocket from Florida, surpassing the total achieved in 2024. The total was a combination of Falcon 9 rockets as well as Atlas 5 and Vulcan rockets from United Launch Alliance and one New Glenn flight from Blue Origin. The Monday night mission that tipped the scales into the record books was Starlink 6-87, which added another 29 broadband internet satellites to the company’s mega-constellation in low Earth orbit. SpaceX accomplished liftoff from pad 40 at Cape Canaveral Space Force Station at 10:21 p.m. EST (0321 UTC). The launch was originally scheduled about five hours earlier in the day, but it was pushed later because the Federal Aviation Administration is limiting commercial launches to between the hours of 10 p.m. and 6 a.m., due to the shortage of air traffic controllers during the government shutdown. Launches add significantly to the workload of air traffic controllers due to the need to divert flights away from the launch danger area. The 45th Weather Squadron forecast a 60 percent chance for favorable weather during the launch window thanks to a “strong cold front” moving across the state on Monday. Meteorologists citied concerns from strong winds at liftoff as well as upper-level wind shear and somewhat questionable weather in the booster recovery zone near the Bahamas. “The front itself will cross the region Monday morning, ushering in a blast of strong northwesterly winds and chilly temps that will linger through at least the first half of Tuesday,” launch weather officers wrote. “As a result, the main concern for the primary launch window will be liftoff winds.” SpaceX used B1096 for the Starlink 6-87 mission, one of the newer Falcon 9 boosters in its fleet. Monday’s launch was its third flight following KF-01 for Amazon’s Project Kuiper and NASA’s IMAP rideshare mission earlier this year. Less than eight minutes after liftoff, B1096 performed an autonomous landing attempt on the drone ship, ‘Just Read the Instructions’. This was the 141st landing on this vessel and the 532nd booster landing to date. Records are made to be broken For more than half a decade, Florida’s spaceport, a combination of both NASA’s Kennedy Space Center and Cape Canaveral Space Force Station, have been steadily increasing the number of orbital launches, thanks in large part to a yearly ramp up in flights from SpaceX. Between its two Falcon launch pads, Launch Complex 39A and Space Launch Complex 40, SpaceX will have launched 88 times after flying the Starlink 6-87 mission, about 95 percent of the launches from Florida’s Space Coast. Falcon launch #130 for 2025. The rolling 365 launch total is 166 launches! Notable records from this morning: * Fastest launch to launch from the same American Launch Pad at 55 Hrs, 29 minutes and 9 seconds * Fastest TE roll in to hangar for booster integration to launch at 12… https://t.co/kgrHZ7yXD5 — Kiko Dontchev (@TurkeyBeaver) October 16, 2025 The impact of some of those launches was reflected in October’s monthly CEO report delivered by Capt. John Murray, to the Port Canaveral Commission on Oct. 22. He noted that for all of Fiscal Year 2025 (Oct. 1, 2024 – Sept. 30, 2025) that there were 90 boosters brought into port along with 194 payload fairings, which he described as “quite significant.” Port Canaveral doesn’t explicitly break down its listing of “Space Component Recoveries” in its report. Presumably, these numbers reflect just SpaceX components, but Spaceflight Now did reach out to Port Canaveral to seek clarification. The ramp up in launch cadence required both increased agility on the part of launch operators, like SpaceX and United Launch Alliance as well as from those who manage the Eastern Range. Ahead of the Aug. 4, 2022, launches of both the SBIRS GEO-6 and the Korea Pathfinder Lunar Orbiter by ULA and SpaceX respectively, Spaceflight Now Reporter Will Robinson-Smith spoke with members of the 1st Range Ops Squadron (1 ROPS) in his capacity as a reporter for Spectrum News 13 at the time. Back then, a double launch day was something that hadn’t been achieved in Florida since the 1960s. U.S. Space Force 2nd Lt. Christian Jackson said that a ramped up launch cadence was “something that we train for every week” in preparation for a more airport-like flight environment. “Just a few years ago, they were launching maybe 12 rockets in a year. We’ve got about 60 plus on the manifest to finish out this year and there are hopes of possibly doing up to 100 launches next year,” Jackson said in 2022. “So, if we want to reach those numbers, we’re definitely going to get to that point where we’re launching over one in a day.” There have been many double launch days since then, with the most recent being September 25, which saw the launches of the Starlink 10-15 mission on a Falcon 9 rocket and the Kuiper Atlas 03 mission on an Atlas 5 551 rocket. Leadership at the Cape has been working to increase payload processing facility capacity to allow for further ramp up of missions, with facilities like one dedicated to Amazon’s Kuiper satellites coming online earlier this year. Orbital launches by year from Cape Canaveral, including failures. Graphic: Spaceflight Now.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "950b23f481240a6894d3cceaa5b75ff2",
        "rep_id": "950b23f481240a6894d3cceaa5b75ff2",
        "member_ids": [
            "950b23f481240a6894d3cceaa5b75ff2"
        ],
        "rep_title": "Poor weather prevents Blue Origin from launching NASA’s Mars-bound ESCAPADE mission",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-08T18:53:03+00:00",
        "articles": [
            {
                "id": "950b23f481240a6894d3cceaa5b75ff2",
                "title": "Poor weather prevents Blue Origin from launching NASA’s Mars-bound ESCAPADE mission",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/08/live-coverage-blue-origin-to-launch-nasas-mars-bound-escapade-mission/",
                "text": "Blue Origin scrubbed a launch attempt of the NG-2 mission on Nov. 9, 2025, due to cumulus clouds in the area. Image: Spaceflight Now Update Nov. 9, 5 p.m. EST (2200 UTC): Blue Origin scrubbed the mission and is assessing its next launch opportunity. Blue Origin’s second New Glenn rocket will have to wait at least another day before it’s able to take flight. A launch attempt on Sunday, Nov. 9, of a pair of Mars-bound satellites for NASA along with a communications demonstration payload for Viasat was squashed due to the presence of cumulus clouds in the area of the pad. Launch teams were also working a ground systems issue heading into the launch readiness poll conducted at T-17 minutes as well as a cruise ship that was in the keep out zone. Blue Origin is assessing its next available launch opportunity. The company will also need to gain permission from the Federal Aviation Administration to launch a daylight flight, given the new commercial launch curfew put into effect beginning Nov. 10 in connection to the ongoing federal shutdown. When it’s able to launch, the 321-foot-tall (98 m) rocket will fly on a south-easterly trajectory upon leaving Launch Complex 36 at Cape Canaveral Space Force Station. The 45th Weather Squadron forecast a 65 percent chance for favorable weather at the opening Sunday’s launch opportunity, but that slides to 55 percent as time goes on. Meteorologists cited concerns with cumulus clouds, lightning and anvil clouds, noting that a cold front will be in place by Sunday. “As the front approaches the region from the northwest, there will be enough moisture in place for showers to form out ahead of and along the front,” launch weather officers wrote. “A few strong to severe thunderstorms may develop Sunday afternoon, with a small chance of a thunderstorm wind gust near 80 fps.” The 24-hour backup opportunity on Monday, Nov. 10, showed a 75 percent chance for favorable conditions at liftoff, but noted that the booster recovery risk was “moderate” on a scale of low-moderate-high. Like with the first New Glenn launch in January 2025, Blue Origin will attempt to land its first stage booster on its autonomous barge, Jacklyn. The 188-foot-tall (57.4 m) booster named ‘Never Tell Me the Odds’ will progress from using three to then one BE-4 engine to perform the final landing burn. Blue Origin previously said it plans to reuse this booster on its third flight if all goes well with this recovery effort. The company’s CEO, Dave Limp, said in a social media post on Wednesday that all will be well even if they’re unable to recover this booster. “We’ve got several more New Glenn boosters already in production,” Limp wrote. Blue Origin transported its New Glenn first stage booster, ‘Never Tell Me the Odds,’ from its facilities at Rocket Park to Launch Complex 36 at Cape Canaveral Space Force Station on Oct. 8, 2025. Image: John Pisani / Spaceflight Now The New Glenn 2 (NG-2) mission will be the first time that Blue Origin’s orbital class rocket will carry customer payloads to space. The two ESCAPADE spacecraft — named ‘Blue’ and ‘Gold’ — were encapsulated inside the rocket’s 23-foot-diameter (7 m) payload fairings on Oct. 31. Blue Origin will perform two burns of the BE-3U engines on the rocket’s upper stage before the twin satellites deploy about 33 minutes after liftoff. The Viasat tech demo will activate about five minutes after the second ESCAPADE satellite, Gold, is released. Blue Origin’s New Glenn rocket designed for the NG-2 mission is pictured at sunset at Launch Complex 36, the evening of Nov. 8, 2025. The rocket will carry NASA’s ESCAPADE mission along with a payload demonstration for Viasat. Image: Adam Bernstein / Spaceflight Now The launch was coordinated by NASA’s Launch Services Program, based at the Kennedy Space Center. The rocket was assigned through the agency’s Venture-Class Acquisition of Dedicated and Rideshare (VADR) launch services contract. The overall contract has a maximum total value of $300 million over a five-year ordering period. When it was assigned to Blue Origin with its New Glenn rocket, the ESCAPADE mission was scheduled to launch in late 2024 on the inaugural flight of the rocket. However, because New Glenn wasn’t ready to fly in time, the mission was moved to the rocket’s second launch. An artist’s rendering of the ESCAPADE mission patch. Graphic: University of California, Berkeley Mission to Mars NASA’s ESCAPADE’s science mission is led by NASA’s Goddard Space Flight Center and the University of California, Berkeley, Space Science Laboratory. The mission is being done in collaboration with Rocket Lab, Advanced Space, Embry-Riddle Aeronautical University and Northern Arizona University. The two spacecraft will work in tandem to better understand Mars’ magnetosphere and learn how its affected by space weather. That give researchers a better grasp on the climatological history of the Red Planet and how it lost its atmosphere. “Really excited to see (NASA’s) Heliophysics’ first mission to Mars and being able to deliver that space weather information that will hopefully help as humanity expands out into the cosmos,” Joseph Westlake, NASA Heliophysics Director, told Spaceflight Now in in an interview earlier this year. What began as the Mars Ion and Sputtering Escape Network (MISEN) concept proposal in October 2016 evolved in to ESCAPADE by July 2018. In June 2019, NASA picked it as one of three finalists as part of the agency’s Small, Innovative Missions for Planetary Exploration or SIMPLEx for short. These types of missions are designed with a higher risk tolerance, a shorter timeline and a lower budget. Rocket Lab built EscaPADE twin spacecraft fully assembled and ready for shipping at the company’s Spacecraft Production Complex and headquarters in Long Beach, California, before shipping to the launch site at Cape Canaveral, Florida. Image: Rocket Lab “We had three-and-a-half years to make two satellites to go to Mars. A typical timeline for a Mars mission is a decade,” said Christophe Mandy, during an August 2024 media tour of Rocket Lab’s Long Beach, California, facilities. “Big missions, like [Mars Sample Return], MSR started in 2002, so it’s already been over two decades. That’s the normal pace for an interplanetary mission,” Mandy said. “We had three-and-a-half years for everything.” Blue and Gold were built on Rocket Lab’s Explorer satellite bus, characterized by the company as a “high delta-V spacecraft with large propellant tanks, deep space capable avionics, and ranging transponders.” The Rocket Lab-built spacecraft for NASA’s Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission are encapsulated in the 7 meter payload fairings for Blue Origin’s New Glenn rocket. Image: Blue Origin “The Explorer product line has a very, very high mass fraction that is fuel,” Mandy said. “In the case of ESCAPADE, it’s almost 70 percent, which is an enormous number. So, if you are the type of mission that needs a lot of delta-V, you’ll probably go for Explorer.” The spacecraft will linger in Earth orbit for about a year before beginning a 10-month cruise to Mars. This altered trajectory, created by Advanced Space, was a result the launch delay of more than a year. The Mars orbit insertion burn is anticipated in September 2027 with checkouts and orbit refining to follow. The science mission is scheduled to last from June 2028 until May 2029. Long Beach Cape Canaveral MARS Our ESCAPADE spacecraft have already travelled across the country and soon will be on their next – and much longer – journey to Mars. Our twin spacecraft have a 43-month mission ahead of them, with 11 months spent studying Mars’… pic.twitter.com/GTPK3ah3as — Rocket Lab (@RocketLab) November 6, 2025",
                "timestamp": "2025-11-08T18:53:03+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/08/live-coverage-blue-origin-to-launch-nasas-mars-bound-escapade-mission/"
        ],
        "rep_text": "Blue Origin scrubbed a launch attempt of the NG-2 mission on Nov. 9, 2025, due to cumulus clouds in the area. Image: Spaceflight Now Update Nov. 9, 5 p.m. EST (2200 UTC): Blue Origin scrubbed the mission and is assessing its next launch opportunity. Blue Origin’s second New Glenn rocket will have to wait at least another day before it’s able to take flight. A launch attempt on Sunday, Nov. 9, of a pair of Mars-bound satellites for NASA along with a communications demonstration payload for Viasat was squashed due to the presence of cumulus clouds in the area of the pad. Launch teams were also working a ground systems issue heading into the launch readiness poll conducted at T-17 minutes as well as a cruise ship that was in the keep out zone. Blue Origin is assessing its next available launch opportunity. The company will also need to gain permission from the Federal Aviation Administration to launch a daylight flight, given the new commercial launch curfew put into effect beginning Nov. 10 in connection to the ongoing federal shutdown. When it’s able to launch, the 321-foot-tall (98 m) rocket will fly on a south-easterly trajectory upon leaving Launch Complex 36 at Cape Canaveral Space Force Station. The 45th Weather Squadron forecast a 65 percent chance for favorable weather at the opening Sunday’s launch opportunity, but that slides to 55 percent as time goes on. Meteorologists cited concerns with cumulus clouds, lightning and anvil clouds, noting that a cold front will be in place by Sunday. “As the front approaches the region from the northwest, there will be enough moisture in place for showers to form out ahead of and along the front,” launch weather officers wrote. “A few strong to severe thunderstorms may develop Sunday afternoon, with a small chance of a thunderstorm wind gust near 80 fps.” The 24-hour backup opportunity on Monday, Nov. 10, showed a 75 percent chance for favorable conditions at liftoff, but noted that the booster recovery risk was “moderate” on a scale of low-moderate-high. Like with the first New Glenn launch in January 2025, Blue Origin will attempt to land its first stage booster on its autonomous barge, Jacklyn. The 188-foot-tall (57.4 m) booster named ‘Never Tell Me the Odds’ will progress from using three to then one BE-4 engine to perform the final landing burn. Blue Origin previously said it plans to reuse this booster on its third flight if all goes well with this recovery effort. The company’s CEO, Dave Limp, said in a social media post on Wednesday that all will be well even if they’re unable to recover this booster. “We’ve got several more New Glenn boosters already in production,” Limp wrote. Blue Origin transported its New Glenn first stage booster, ‘Never Tell Me the Odds,’ from its facilities at Rocket Park to Launch Complex 36 at Cape Canaveral Space Force Station on Oct. 8, 2025. Image: John Pisani / Spaceflight Now The New Glenn 2 (NG-2) mission will be the first time that Blue Origin’s orbital class rocket will carry customer payloads to space. The two ESCAPADE spacecraft — named ‘Blue’ and ‘Gold’ — were encapsulated inside the rocket’s 23-foot-diameter (7 m) payload fairings on Oct. 31. Blue Origin will perform two burns of the BE-3U engines on the rocket’s upper stage before the twin satellites deploy about 33 minutes after liftoff. The Viasat tech demo will activate about five minutes after the second ESCAPADE satellite, Gold, is released. Blue Origin’s New Glenn rocket designed for the NG-2 mission is pictured at sunset at Launch Complex 36, the evening of Nov. 8, 2025. The rocket will carry NASA’s ESCAPADE mission along with a payload demonstration for Viasat. Image: Adam Bernstein / Spaceflight Now The launch was coordinated by NASA’s Launch Services Program, based at the Kennedy Space Center. The rocket was assigned through the agency’s Venture-Class Acquisition of Dedicated and Rideshare (VADR) launch services contract. The overall contract has a maximum total value of $300 million over a five-year ordering period. When it was assigned to Blue Origin with its New Glenn rocket, the ESCAPADE mission was scheduled to launch in late 2024 on the inaugural flight of the rocket. However, because New Glenn wasn’t ready to fly in time, the mission was moved to the rocket’s second launch. An artist’s rendering of the ESCAPADE mission patch. Graphic: University of California, Berkeley Mission to Mars NASA’s ESCAPADE’s science mission is led by NASA’s Goddard Space Flight Center and the University of California, Berkeley, Space Science Laboratory. The mission is being done in collaboration with Rocket Lab, Advanced Space, Embry-Riddle Aeronautical University and Northern Arizona University. The two spacecraft will work in tandem to better understand Mars’ magnetosphere and learn how its affected by space weather. That give researchers a better grasp on the climatological history of the Red Planet and how it lost its atmosphere. “Really excited to see (NASA’s) Heliophysics’ first mission to Mars and being able to deliver that space weather information that will hopefully help as humanity expands out into the cosmos,” Joseph Westlake, NASA Heliophysics Director, told Spaceflight Now in in an interview earlier this year. What began as the Mars Ion and Sputtering Escape Network (MISEN) concept proposal in October 2016 evolved in to ESCAPADE by July 2018. In June 2019, NASA picked it as one of three finalists as part of the agency’s Small, Innovative Missions for Planetary Exploration or SIMPLEx for short. These types of missions are designed with a higher risk tolerance, a shorter timeline and a lower budget. Rocket Lab built EscaPADE twin spacecraft fully assembled and ready for shipping at the company’s Spacecraft Production Complex and headquarters in Long Beach, California, before shipping to the launch site at Cape Canaveral, Florida. Image: Rocket Lab “We had three-and-a-half years to make two satellites to go to Mars. A typical timeline for a Mars mission is a decade,” said Christophe Mandy, during an August 2024 media tour of Rocket Lab’s Long Beach, California, facilities. “Big missions, like [Mars Sample Return], MSR started in 2002, so it’s already been over two decades. That’s the normal pace for an interplanetary mission,” Mandy said. “We had three-and-a-half years for everything.” Blue and Gold were built on Rocket Lab’s Explorer satellite bus, characterized by the company as a “high delta-V spacecraft with large propellant tanks, deep space capable avionics, and ranging transponders.” The Rocket Lab-built spacecraft for NASA’s Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission are encapsulated in the 7 meter payload fairings for Blue Origin’s New Glenn rocket. Image: Blue Origin “The Explorer product line has a very, very high mass fraction that is fuel,” Mandy said. “In the case of ESCAPADE, it’s almost 70 percent, which is an enormous number. So, if you are the type of mission that needs a lot of delta-V, you’ll probably go for Explorer.” The spacecraft will linger in Earth orbit for about a year before beginning a 10-month cruise to Mars. This altered trajectory, created by Advanced Space, was a result the launch delay of more than a year. The Mars orbit insertion burn is anticipated in September 2027 with checkouts and orbit refining to follow. The science mission is scheduled to last from June 2028 until May 2029. Long Beach Cape Canaveral MARS Our ESCAPADE spacecraft have already travelled across the country and soon will be on their next – and much longer – journey to Mars. Our twin spacecraft have a 43-month mission ahead of them, with 11 months spent studying Mars’… pic.twitter.com/GTPK3ah3as — Rocket Lab (@RocketLab) November 6, 2025",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "8eba6121fbe5b5440c17f79693419ec7",
        "rep_id": "8eba6121fbe5b5440c17f79693419ec7",
        "member_ids": [
            "8eba6121fbe5b5440c17f79693419ec7"
        ],
        "rep_title": "SpaceX launches Sunday Starlink mission following Saturday scrub",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-07T19:59:30+00:00",
        "articles": [
            {
                "id": "8eba6121fbe5b5440c17f79693419ec7",
                "title": "SpaceX launches Sunday Starlink mission following Saturday scrub",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/07/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-nasas-kennedy-space-center/",
                "text": "A long-exposure shot of SpaceX’s Falcon 9 rocket as it soars away from Launch Complex 39A at NASA’s Kennedy Space Center to begin the Starlink 10-51 mission on Nov. 9, 2025. Image: Michael Cain / Spaceflight Now Update Nov. 9, 3:50 a.m. EST (0850 UTC): SpaceX landed its booster on the drone ship. Update Nov. 8, 7:30 a.m. EST (1230 UTC): SpaceX scrubbed the launch due to poor booster recovery weather. Following a last minute scrub Saturday morning, SpaceX launched a batch of Starlink satellites in the predawn hours of Sunday morning. The launch came as the Federal Aviation Administration readies a rollout of commercial launch restrictions for U.S. airspace. The company said poor weather in the booster recovery zone caused them stand down from Saturday’s launch opportunity, but conditions were enough improved to support Sunday’s launch. The Starlink 10-51 mission lifted off on a Falcon 9 rocket from Launch Complex 39A at NASA’s Kennedy Space Center at 3:10 a.m. EST (0810 UTC). The rocket flew on a north-easterly trajectory upon leaving Florida’s Space Coast. ﻿ The 45th Weather Squadron forecast a 95 percent chance for favorable weather at liftoff on Sunday, citing a small chance for interference from cumulus clouds. “A low-pressure system will begin to develop over the Midwest and track to the northeast, dragging a cold front into the Florida panhandle on Sunday, with rounds of prefrontal showers starting as early as Saturday afternoon,” launch weather officers wrote. “For the launch window early Sunday morning, weather appears quiet ahead of the incoming front with only a distant chance of a Cumulus Cloud Rule violation, though winds at the recovery site are likely to be elevated due to a tightening pressure gradient on the east side of the Carolina low.” SpaceX launched the mission using the Falcon 9 booster with the tail number B1069, which made its 28th flight. Its previous missions included CRS-24, OneWeb Launch #15 and Eutelsat Hotbird 13F. Nearly 8.5 minutes after liftoff, B1069 performed an autonomous landing on the drone ship, ‘A Shortfall of Gravitas’, positioned in the Atlantic Ocean off the coast of South Carolina. This was the 131st booster landing on this vessel and the 531st booster landing to date. SpaceX intends to deploy the 29 Starlink V2 Mini Optimized satellites from the rocket’s upper stage a little more than an hour after liftoff. Liftoff of SpaceX’s Falcon 9 rocket as it soars away from Launch Complex 39A at NASA’s Kennedy Space Center to begin the Starlink 10-51 mission on Nov. 9, 2025. Image: Michael Cain / Spaceflight Now Curfew coming The mission came days in advance of a new, emergency directive issued by the FAA on Thursday that restricts commercial space launches and reentries sanctioned by the FAA to take place between 10 p.m. and 6 a.m. local time beginning at 6 a.m. EST on Nov. 10. In the face of the ongoing government shutdown, U.S. Transportation Secretary Sean Duffy, who is also serving as NASA’s acting administrator, also issued a “temporary 10 percent reduction in flights at 40 high traffic airports across the country.” Among those impacted airports are Orlando International Airport and Los Angeles International Airport, the two closest major airports to both Cape Canaveral and Vandenberg respectively. The launch curfew will have varying degrees of impact, depending on the interpretation of “commercial launch”. SpaceX announced five more Starlink missions between Nov. 10 and Nov. 19 and is also planning to launch the Transporter-15 mission on Nov. 11. Following a scrub Thursday night, United Launch Alliance’s next attempt to launch the ViaSat-3 F2 mission will also fall after the FAA’s launch restrictions go into effect. SpaceX does have some latitude with shuffling its launch times for its Starlink mission to fit the FAA’s new mandate. However, missions like Transporter-15 that seek to launch payloads into a Sun-synchronous orbit may need to seek special exemption. Spaceflight Now also reached out to the FAA for comment, but received the automated response: “Due to a lapse in funding, the FAA is not responding to routine media inquiries.” Rocket Lab for its part said that it shouldn’t face much impact from the decision. “We can confirm launches from [Launch Complex 1] in New Zealand are unaffected by the restrictions, as these launches do not operate in U.S. airspace,” the company said. “We also expect minimal impact to launches from LC-2 in Virginia.” A long-exposure shot of SpaceX’s Falcon 9 rocket as it soars away from Launch Complex 39A at NASA’s Kennedy Space Center to begin the Starlink 10-51 mission on Nov. 9, 2025. Image: John Pisani / Spaceflight Now",
                "timestamp": "2025-11-07T19:59:30+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/07/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-nasas-kennedy-space-center/"
        ],
        "rep_text": "A long-exposure shot of SpaceX’s Falcon 9 rocket as it soars away from Launch Complex 39A at NASA’s Kennedy Space Center to begin the Starlink 10-51 mission on Nov. 9, 2025. Image: Michael Cain / Spaceflight Now Update Nov. 9, 3:50 a.m. EST (0850 UTC): SpaceX landed its booster on the drone ship. Update Nov. 8, 7:30 a.m. EST (1230 UTC): SpaceX scrubbed the launch due to poor booster recovery weather. Following a last minute scrub Saturday morning, SpaceX launched a batch of Starlink satellites in the predawn hours of Sunday morning. The launch came as the Federal Aviation Administration readies a rollout of commercial launch restrictions for U.S. airspace. The company said poor weather in the booster recovery zone caused them stand down from Saturday’s launch opportunity, but conditions were enough improved to support Sunday’s launch. The Starlink 10-51 mission lifted off on a Falcon 9 rocket from Launch Complex 39A at NASA’s Kennedy Space Center at 3:10 a.m. EST (0810 UTC). The rocket flew on a north-easterly trajectory upon leaving Florida’s Space Coast. ﻿ The 45th Weather Squadron forecast a 95 percent chance for favorable weather at liftoff on Sunday, citing a small chance for interference from cumulus clouds. “A low-pressure system will begin to develop over the Midwest and track to the northeast, dragging a cold front into the Florida panhandle on Sunday, with rounds of prefrontal showers starting as early as Saturday afternoon,” launch weather officers wrote. “For the launch window early Sunday morning, weather appears quiet ahead of the incoming front with only a distant chance of a Cumulus Cloud Rule violation, though winds at the recovery site are likely to be elevated due to a tightening pressure gradient on the east side of the Carolina low.” SpaceX launched the mission using the Falcon 9 booster with the tail number B1069, which made its 28th flight. Its previous missions included CRS-24, OneWeb Launch #15 and Eutelsat Hotbird 13F. Nearly 8.5 minutes after liftoff, B1069 performed an autonomous landing on the drone ship, ‘A Shortfall of Gravitas’, positioned in the Atlantic Ocean off the coast of South Carolina. This was the 131st booster landing on this vessel and the 531st booster landing to date. SpaceX intends to deploy the 29 Starlink V2 Mini Optimized satellites from the rocket’s upper stage a little more than an hour after liftoff. Liftoff of SpaceX’s Falcon 9 rocket as it soars away from Launch Complex 39A at NASA’s Kennedy Space Center to begin the Starlink 10-51 mission on Nov. 9, 2025. Image: Michael Cain / Spaceflight Now Curfew coming The mission came days in advance of a new, emergency directive issued by the FAA on Thursday that restricts commercial space launches and reentries sanctioned by the FAA to take place between 10 p.m. and 6 a.m. local time beginning at 6 a.m. EST on Nov. 10. In the face of the ongoing government shutdown, U.S. Transportation Secretary Sean Duffy, who is also serving as NASA’s acting administrator, also issued a “temporary 10 percent reduction in flights at 40 high traffic airports across the country.” Among those impacted airports are Orlando International Airport and Los Angeles International Airport, the two closest major airports to both Cape Canaveral and Vandenberg respectively. The launch curfew will have varying degrees of impact, depending on the interpretation of “commercial launch”. SpaceX announced five more Starlink missions between Nov. 10 and Nov. 19 and is also planning to launch the Transporter-15 mission on Nov. 11. Following a scrub Thursday night, United Launch Alliance’s next attempt to launch the ViaSat-3 F2 mission will also fall after the FAA’s launch restrictions go into effect. SpaceX does have some latitude with shuffling its launch times for its Starlink mission to fit the FAA’s new mandate. However, missions like Transporter-15 that seek to launch payloads into a Sun-synchronous orbit may need to seek special exemption. Spaceflight Now also reached out to the FAA for comment, but received the automated response: “Due to a lapse in funding, the FAA is not responding to routine media inquiries.” Rocket Lab for its part said that it shouldn’t face much impact from the decision. “We can confirm launches from [Launch Complex 1] in New Zealand are unaffected by the restrictions, as these launches do not operate in U.S. airspace,” the company said. “We also expect minimal impact to launches from LC-2 in Virginia.” A long-exposure shot of SpaceX’s Falcon 9 rocket as it soars away from Launch Complex 39A at NASA’s Kennedy Space Center to begin the Starlink 10-51 mission on Nov. 9, 2025. Image: John Pisani / Spaceflight Now",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "0fbd1e808839943795a5ff7641bb293d",
        "rep_id": "0fbd1e808839943795a5ff7641bb293d",
        "member_ids": [
            "0fbd1e808839943795a5ff7641bb293d"
        ],
        "rep_title": "Evidence for the Keplerian orbit of a close companion around a giant star",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-13T00:00:00+00:00",
        "articles": [
            {
                "id": "0fbd1e808839943795a5ff7641bb293d",
                "title": "Evidence for the Keplerian orbit of a close companion around a giant star",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02697-2",
                "text": "Nature Astronomy, Published online: 13 November 2025; doi:10.1038/s41550-025-02697-2 How do low-mass binaries age? Astronomers have constrained a tight, circular orbit of a close-in companion around a dying giant star, raising new questions about how tidal forces shape binary orbits in the final phases of stellar evolution.",
                "timestamp": "2025-11-13T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02697-2"
        ],
        "rep_text": "Nature Astronomy, Published online: 13 November 2025; doi:10.1038/s41550-025-02697-2 How do low-mass binaries age? Astronomers have constrained a tight, circular orbit of a close-in companion around a dying giant star, raising new questions about how tidal forces shape binary orbits in the final phases of stellar evolution.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "7b26fdbf3bee0efbb1f2b3f2edcffb96",
        "rep_id": "7b26fdbf3bee0efbb1f2b3f2edcffb96",
        "member_ids": [
            "7b26fdbf3bee0efbb1f2b3f2edcffb96"
        ],
        "rep_title": "An impact-related origin for lunar magmatic rocks?",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-07T00:00:00+00:00",
        "articles": [
            {
                "id": "7b26fdbf3bee0efbb1f2b3f2edcffb96",
                "title": "An impact-related origin for lunar magmatic rocks?",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02704-6",
                "text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02704-6 Magmatic rocks from the far side of the Moon might not originate from the lunar mantle, but from the mineral cumulates resulting from the crystallization of a magma pond formed by the South Pole–Aitken impact on the far side of the Moon.",
                "timestamp": "2025-11-07T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02704-6"
        ],
        "rep_text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02704-6 Magmatic rocks from the far side of the Moon might not originate from the lunar mantle, but from the mineral cumulates resulting from the crystallization of a magma pond formed by the South Pole–Aitken impact on the far side of the Moon.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "62ca45d1090e2837bda4389c59875305",
        "rep_id": "62ca45d1090e2837bda4389c59875305",
        "member_ids": [
            "62ca45d1090e2837bda4389c59875305"
        ],
        "rep_title": "Warm and cool components found in an eruption from a solar analogue",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-07T00:00:00+00:00",
        "articles": [
            {
                "id": "62ca45d1090e2837bda4389c59875305",
                "title": "Warm and cool components found in an eruption from a solar analogue",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02707-3",
                "text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02707-3 Coordinated observations between the Hubble Space Telescope and ground-based telescopes of a star that is an analogue of the young Sun have uncovered multi-temperature signatures of stellar coronal mass ejections. The detection of fast–warm and slow–cool plasma components suggests a solar-like but more complex picture of stellar eruptions, with impact on the planets around young stars.",
                "timestamp": "2025-11-07T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02707-3"
        ],
        "rep_text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02707-3 Coordinated observations between the Hubble Space Telescope and ground-based telescopes of a star that is an analogue of the young Sun have uncovered multi-temperature signatures of stellar coronal mass ejections. The detection of fast–warm and slow–cool plasma components suggests a solar-like but more complex picture of stellar eruptions, with impact on the planets around young stars.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "edd028cc9bd3497cbb5e37d1592e2393",
        "rep_id": "edd028cc9bd3497cbb5e37d1592e2393",
        "member_ids": [
            "edd028cc9bd3497cbb5e37d1592e2393"
        ],
        "rep_title": "Strife on Mars",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-07T00:00:00+00:00",
        "articles": [
            {
                "id": "edd028cc9bd3497cbb5e37d1592e2393",
                "title": "Strife on Mars",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02696-3",
                "text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02696-3 Strife on Mars",
                "timestamp": "2025-11-07T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02696-3"
        ],
        "rep_text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02696-3 Strife on Mars",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "28fc2433326fe7130151031f3f6543de",
        "rep_id": "28fc2433326fe7130151031f3f6543de",
        "member_ids": [
            "28fc2433326fe7130151031f3f6543de"
        ],
        "rep_title": "NASA’s bold new telescope will do more than just hunt for life",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-07T00:00:00+00:00",
        "articles": [
            {
                "id": "28fc2433326fe7130151031f3f6543de",
                "title": "NASA’s bold new telescope will do more than just hunt for life",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02708-2",
                "text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02708-2 The Habitable Worlds Observatory will look for inhabited worlds beyond our Solar System in the 2040s and scientists are dreaming of what else it might do.",
                "timestamp": "2025-11-07T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02708-2"
        ],
        "rep_text": "Nature Astronomy, Published online: 07 November 2025; doi:10.1038/s41550-025-02708-2 The Habitable Worlds Observatory will look for inhabited worlds beyond our Solar System in the 2040s and scientists are dreaming of what else it might do.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "ac9b67ee92c143e7d9540f81d901d58c",
        "rep_id": "ac9b67ee92c143e7d9540f81d901d58c",
        "member_ids": [
            "ac9b67ee92c143e7d9540f81d901d58c"
        ],
        "rep_title": "The future ability to test theories of gravity with black-hole shadows",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-05T00:00:00+00:00",
        "articles": [
            {
                "id": "ac9b67ee92c143e7d9540f81d901d58c",
                "title": "The future ability to test theories of gravity with black-hole shadows",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02695-4",
                "text": "Nature Astronomy, Published online: 05 November 2025; doi:10.1038/s41550-025-02695-4 General-relativistic magnetohydrodynamic simulations coupled with general-relativistic radiation transfer of a wide class of black hole spacetimes forecast the ability of future VLBI projects to distinguish between black hole images.",
                "timestamp": "2025-11-05T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02695-4"
        ],
        "rep_text": "Nature Astronomy, Published online: 05 November 2025; doi:10.1038/s41550-025-02695-4 General-relativistic magnetohydrodynamic simulations coupled with general-relativistic radiation transfer of a wide class of black hole spacetimes forecast the ability of future VLBI projects to distinguish between black hole images.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "13ab78f0b8dd06c940021c12dd0377a9",
        "rep_id": "13ab78f0b8dd06c940021c12dd0377a9",
        "member_ids": [
            "13ab78f0b8dd06c940021c12dd0377a9"
        ],
        "rep_title": "An extremely luminous flare recorded from a supermassive black hole",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-11-04T00:00:00+00:00",
        "articles": [
            {
                "id": "13ab78f0b8dd06c940021c12dd0377a9",
                "title": "An extremely luminous flare recorded from a supermassive black hole",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02699-0",
                "text": "Nature Astronomy, Published online: 04 November 2025; doi:10.1038/s41550-025-02699-0 An extreme flare has been seen from a supermassive black hole at redshift z = 2.6. First detected in 2018, it is 30 times brighter than similar events. The most likely cause is the shredding of a star of 30 solar masses or more.",
                "timestamp": "2025-11-04T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02699-0"
        ],
        "rep_text": "Nature Astronomy, Published online: 04 November 2025; doi:10.1038/s41550-025-02699-0 An extreme flare has been seen from a supermassive black hole at redshift z = 2.6. First detected in 2018, it is 30 times brighter than similar events. The most likely cause is the shredding of a star of 30 solar masses or more.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "e89515eef4cf9b2480ee80b0ff42b8e2",
        "rep_id": "e89515eef4cf9b2480ee80b0ff42b8e2",
        "member_ids": [
            "e89515eef4cf9b2480ee80b0ff42b8e2"
        ],
        "rep_title": "The origin and tidal evolution of hot Jupiters constrained by a broken age–frequency relation",
        "sources": [
            "Nature Astronomy"
        ],
        "timestamp": "2025-10-31T00:00:00+00:00",
        "articles": [
            {
                "id": "e89515eef4cf9b2480ee80b0ff42b8e2",
                "title": "The origin and tidal evolution of hot Jupiters constrained by a broken age–frequency relation",
                "source": "Nature Astronomy",
                "url": "https://www.nature.com/articles/s41550-025-02693-6",
                "text": "Nature Astronomy, Published online: 31 October 2025; doi:10.1038/s41550-025-02693-6 This study reveals a broken age–frequency relation of hot Jupiters, which simultaneously constrains the tidal factor of host stars and indicates different timescales in hot Jupiter formation, with ~40% forming late on billion-year timescales through secular chaos.",
                "timestamp": "2025-10-31T00:00:00+00:00"
            }
        ],
        "urls": [
            "https://www.nature.com/articles/s41550-025-02693-6"
        ],
        "rep_text": "Nature Astronomy, Published online: 31 October 2025; doi:10.1038/s41550-025-02693-6 This study reveals a broken age–frequency relation of hot Jupiters, which simultaneously constrains the tidal factor of host stars and indicates different timescales in hot Jupiter formation, with ~40% forming late on billion-year timescales through secular chaos.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    },
    {
        "cluster_id": "a515668128b3b0b9a720f09670de6fc9",
        "rep_id": "a515668128b3b0b9a720f09670de6fc9",
        "member_ids": [
            "a515668128b3b0b9a720f09670de6fc9"
        ],
        "rep_title": "Live Coverage: SpaceX Falcon 9 to launch international satellite to keep watch on rising sea levels",
        "sources": [
            "SpaceflightNow"
        ],
        "timestamp": "2025-11-17T00:59:50+00:00",
        "articles": [
            {
                "id": "a515668128b3b0b9a720f09670de6fc9",
                "title": "Live Coverage: SpaceX Falcon 9 to launch international satellite to keep watch on rising sea levels",
                "source": "SpaceflightNow",
                "url": "https://spaceflightnow.com/2025/11/17/live-coverage-spacex-falcon-9-to-launch-international-satellite-to-keep-watch-on-rising-sea-levels/",
                "text": "A Falcon 9 rocket stands at pad 4E at Vandenberg Space Force Base ahead of the planned launch of the Sentinel-6B mission. Image: SpaceX. The second spacecraft in a billion-dollar international mission to keep watch rising sea levels is scheduled to launch from California Sunday night, local time, weather permitting. The Sentinel-6B satellite will liftoff atop a SpaceX Falcon 9 rocket from Space Launch Complex-4E at Vandenberg Space Force Base at 9:21:42 p.m. PST (12:21:42 a.m. EST / 0521:42 UTC), almost exactly five years after its twin, the Sentinel-6 Michael Freilich, launched from the same pad. Spaceflight Now will have live coverage starting about one hour prior to launch. Meteorologists with the U.S. Space Force’s Space Launch Delta 30, based at Vandenberg, said they were optimistic the weather would cooperate, despite a series of low pressure weather systems bringing heavy rainfall to the West Coast. The probability of a weather rule violation for Sunday’s launch attempt was put at 60 percent. “California has been one of the wettest places in the United States this weekend, even wetter than, say, the Midwest, which is really abnormal for Southern California,” Launch Weather Officer 1st Lt,. William F. Harbin told a pre-launch news conference Saturday. Weather conditions are forecast to improve on Monday, Harbin said, with the chance of breaking the weather rules falling to 40 percent in the event of a 24-hour delay. The Falcon 9 first stage, serial number B1097, is making its third flight. If everything goes as planned, B1097 will return to the launch site, landing approximately 1,400 feet west of the pad from which it took off. The mission will mark the 500th flight of a previously flown Falcon 9 booster. Artist’s impression of the Sentinel-6B spacecraft separating from the Falcon 9’s second stage. Image: ESA. The Sentinel-6B spacecraft, built by Airbus Defence and Space in Germany, will be deployed from the Falcon 9’s second stage 57 minutes into the flight after two burns by the Falcon 9’s second stage. Sentinel-6B and its predecessor are part of a $1 billion international collaboration to continue a decades-long effort to accurately measure sea heights from orbit. The costs of the project were split evenly between the United States and Europe. Partnering for the mission are NASA, the European Space Agency (ESA), the European Organisation for the Exploitation of Meteorological Satellites (Eumetsat), the National Oceanic and Atmospheric Administration (NOAA), the European Commission and the French space agency CNES. From its circular orbit, 830 miles (1,336 km) high, inclined at 66 degrees to the Equator, Sentinel-6B will use cloud-penetrating radar to measure sea level heights down to roughly an inch across 90 percent of the world’s oceans. “This information lets us monitor significant ocean features like ocean currents, sea level and wave height, and gives us a view into the inner workings of the ocean,” said Karen St. Germain, NASA’s director of Earth science. “This information underpins navigation, search and rescue and industries like commercial fishing and shipping, and these measurements form the basis for us, flood predictions for coastal infrastructure, real estate, energy storage, sites and other assets along our shoreline.” In line with Trump Administration policies, mission officials have made no mention of climate change, which scientists say is a major factor driving rising sea levels.",
                "timestamp": "2025-11-17T00:59:50+00:00"
            }
        ],
        "urls": [
            "https://spaceflightnow.com/2025/11/17/live-coverage-spacex-falcon-9-to-launch-international-satellite-to-keep-watch-on-rising-sea-levels/"
        ],
        "rep_text": "A Falcon 9 rocket stands at pad 4E at Vandenberg Space Force Base ahead of the planned launch of the Sentinel-6B mission. Image: SpaceX. The second spacecraft in a billion-dollar international mission to keep watch rising sea levels is scheduled to launch from California Sunday night, local time, weather permitting. The Sentinel-6B satellite will liftoff atop a SpaceX Falcon 9 rocket from Space Launch Complex-4E at Vandenberg Space Force Base at 9:21:42 p.m. PST (12:21:42 a.m. EST / 0521:42 UTC), almost exactly five years after its twin, the Sentinel-6 Michael Freilich, launched from the same pad. Spaceflight Now will have live coverage starting about one hour prior to launch. Meteorologists with the U.S. Space Force’s Space Launch Delta 30, based at Vandenberg, said they were optimistic the weather would cooperate, despite a series of low pressure weather systems bringing heavy rainfall to the West Coast. The probability of a weather rule violation for Sunday’s launch attempt was put at 60 percent. “California has been one of the wettest places in the United States this weekend, even wetter than, say, the Midwest, which is really abnormal for Southern California,” Launch Weather Officer 1st Lt,. William F. Harbin told a pre-launch news conference Saturday. Weather conditions are forecast to improve on Monday, Harbin said, with the chance of breaking the weather rules falling to 40 percent in the event of a 24-hour delay. The Falcon 9 first stage, serial number B1097, is making its third flight. If everything goes as planned, B1097 will return to the launch site, landing approximately 1,400 feet west of the pad from which it took off. The mission will mark the 500th flight of a previously flown Falcon 9 booster. Artist’s impression of the Sentinel-6B spacecraft separating from the Falcon 9’s second stage. Image: ESA. The Sentinel-6B spacecraft, built by Airbus Defence and Space in Germany, will be deployed from the Falcon 9’s second stage 57 minutes into the flight after two burns by the Falcon 9’s second stage. Sentinel-6B and its predecessor are part of a $1 billion international collaboration to continue a decades-long effort to accurately measure sea heights from orbit. The costs of the project were split evenly between the United States and Europe. Partnering for the mission are NASA, the European Space Agency (ESA), the European Organisation for the Exploitation of Meteorological Satellites (Eumetsat), the National Oceanic and Atmospheric Administration (NOAA), the European Commission and the French space agency CNES. From its circular orbit, 830 miles (1,336 km) high, inclined at 66 degrees to the Equator, Sentinel-6B will use cloud-penetrating radar to measure sea level heights down to roughly an inch across 90 percent of the world’s oceans. “This information lets us monitor significant ocean features like ocean currents, sea level and wave height, and gives us a view into the inner workings of the ocean,” said Karen St. Germain, NASA’s director of Earth science. “This information underpins navigation, search and rescue and industries like commercial fishing and shipping, and these measurements form the basis for us, flood predictions for coastal infrastructure, real estate, energy storage, sites and other assets along our shoreline.” In line with Trump Administration policies, mission officials have made no mention of climate change, which scientists say is a major factor driving rising sea levels.",
        "summary": "",
        "topics": [
            ""
        ],
        "because": "",
        "score": 0.0,
        "score_components": {}
    }
]